{"presentationList":{"presentation":[{"createdDate":null,"version":1,"id":1088,"updatedDate":1411659465423,"audioLink":"","description":"RIAs are certainly changing the way we build software. User experience is now central to building great software. How does this impact our Agile methodologies? How do we implement Agile when working with designers? What testing and development tools exist to aid us in implementing Agile in RIAs? This session will use live coding and demos to show how Agile is being used to build Flex RIAs.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-James Ward-Agile_Flex.pdf","speakers":[{"createdDate":null,"version":4,"id":1000,"updatedDate":null,"bio":"James Ward (http://www.jamesward.com) works for Typesafe where he teaches developers the Typesafe Stack (Play Framework, Scala, and Akka). James frequently presents at conferences around the world such as JavaOne, Devoxx, and many other Java get-togethers. Along with Bruce Eckel, James co-authored First Steps in Flex. He has also published numerous screencasts, blogs, and technical articles. Starting with Pascal and Assembly in the 80′s, James found his passion for writing code. Beginning in the 90′s he began doing web development with HTML, Perl/CGI, then Java. After building a Flex and Java based customer service portal in 2004 for Pillar Data Systems he became a Technical Evangelist for Flex at Adobe. In 2011 James became a Principal Developer Evangelist at Salesforce.com where he taught developers how to deploy apps on the cloud with Heroku. James Tweets as @_JamesWard and posts code at http://github.com/jamesward.","firstName":"James","lastName":"Ward","twitterId":"_JamesWard","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"An Agile Toolchain for Flex RIAs","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1091,"updatedDate":1411659465638,"audioLink":"","description":"In this session, Keith will provide a quick overview of what Spring provides for web application development.\nThen, from the ground up, he will take attendees through the process of designing and implementing a web application with the framework.\nAttendees will not only learn the Spring feature set, they will learn to apply the features effectively.\nWhether you are new to Spring, or an experienced Java developer who has used Spring before, this session should help you grow as an application developer.\n\nTopics covered:\nSpring Framework v3, MVC, \"Open Web\" stack of HTML/CSS/JavaScript, JSON, REST & resource-oriented architecture, progressive enhancement, best-of-breed development tools","presentationLink":"","speakers":[{"createdDate":null,"version":1,"id":1016,"updatedDate":null,"bio":"Keith Donald is a principal and founding partner at SpringSource, the company behind Spring and a division of VMware. At SpringSource, Keith is a full-time member of the Spring development team focusing on web application development productivity. He is also the architect behind SpringSource's state-of-the-art training curriculum, which has provided practical Spring training to over 10,000 students worldwide. Over his career, Keith, an experienced enterprise software developer and mentor, has built business applications for customers spanning a diverse set of industries including banking, network management, information assurance, education, retail, and healthcare. He is particularly skilled at translating business requirements into technical solutions.","firstName":"Keith","lastName":"Donald","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Developing Web Applications with Spring, Part I","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1095,"updatedDate":1411659465662,"audioLink":"","description":"Corporate developers have to constantly contend with fallacies often delivered to them as facts. However, each of us has a professional\nresponsibility to be objective and make decisions that will help us and our teams be productive and deliver results. In this presentation\nwe'll pick on some fallacies, lay down facts, and discuss how to stay professional and objective in our daily efforts.","presentationLink":"","speakers":[{"createdDate":null,"version":7,"id":1009,"updatedDate":1418596246756,"bio":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats@agiledeveloper.com or on twitter at @venkat_s.","firstName":"Venkat","lastName":"Subramaniam","twitterId":"venkat_s","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Facts and Fallacies of Software Development","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1103,"updatedDate":1411659465670,"audioLink":"","description":"How do you get a Java based platform to process tens of millions of transactions a day in an average of under 3 milliseconds each? Processing half of the world’s oil transactions as well as US natural gas, sugar, coffee, financial index markets and more, the ICE platform and has entrenched ICE as a leader in the world of Futures and Options. Edwin Marcial will discuss the Intercontinental Exchange (ICE) Trading Platform architecture and how it has become the fastest trading platform in the commodities industry.","presentationLink":"","speakers":[{"createdDate":null,"version":1,"id":1020,"updatedDate":null,"bio":"Edwin Marcial is a Senior Vice President and the Chief Technology Officer for the Intercontinental Exchange (ICE). Mr. Marcial has over 17 years of experience in the technology industry architecting and developing software systems. His experiences include 4 years working with Harris Energy Control Systems division where he was part of a team developing state-of-the-art distributed energy management systems. He joined Continental Power Exchange (CPEX) in 1996 and in 1998 his technical vision led to the design of an Internet based distributed commodity trading system that would evolve to become the ICE trading platform. In 2000, CPEX became the Intercontinental Exchange (ICE) and the ICE Trading System was launched. Today Mr. Marcial leads a team of very talented technologists as they continue to enhance the ICE’s core trading, clearing and data systems and build new applications for the advancement of the Intercontinental Exchange. In 2007, Mr. Marcial was named the Georgia Corporate CIO of the Year, and in 2009 he was named as one of InfoWorld’s top 25 CTOs. Mr. Marcial holds a Bachelor’s Degree in Computer Science from the University of Florida’s College of Engineering. ","firstName":"Edwin","lastName":"Marcial","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"High Performance Architectures","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1101,"updatedDate":1411659465678,"audioLink":"","description":"As the complexity of web applications continues to grow, the development tools provided to those creating such apps have remained, to a large extent, stagnant. The difficultly of adding the next \"killer\" feature while keeping load times reasonable and code size small can drive any Javascript guru to the brink of insanity. Google Web Toolkit provides tools that allow you to maintain your sanity and approach web development in the same manner you would any other large scale project. And much like any other set of tools, there are various ways to approach a project; some more efficient and scalable than others. The goal of \"GWT Best Practices\" is to take a deeper dive into slick ways to reduce code size, minimize RPC overhead, and streamline application development and testing using the MVP architecture within your GWT app.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Chris Ramsdale-GWT Best Practices.pdf","speakers":[{"createdDate":null,"version":1,"id":1018,"updatedDate":null,"bio":"Since starting at Georgia Tech in 1996, Chris Ramsdale has lived and worked in the Atlanta area for the past 13 years. Working in the mobile space with local companies such as Motorola, AppForge, and Air2Web, Chris has held positions as a Software Engineer, Tech Lead, and Product Manager. His current endeavor is working within Google's Developer Relations team to help educate and advocate Google Web Toolkit.","firstName":"Chris ","lastName":"Ramsdale","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"GWT Best Practices","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1098,"updatedDate":1411659465683,"audioLink":"","description":"Grails is the ultimate Java rapid application development environment (RAD). Using the lightweight but powerful Groovy language sitting on top of the JVM, you can put together a complete application in a fraction of time as \"normal\" web-app development. This introductory session to Grails will cover the new Grails 1.2 release using lots of\ncode examples. We'll use The new Eclipse-Groovy/Grails plugin to create a complete app during the session. We'll also use some of the *hundreds* of plugins available for Grails. These plugins offer\neasy-to-use features such as rich internet, security, clustering, etc.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Pratik Patel-Get RAD with Grails.pdf","speakers":[{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"}],"title":"Get RAD with Grails","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1097,"updatedDate":1411659465687,"audioLink":"","description":"The newly formed JBoss GateIn project promises to deliver a scalable and intuitive portal solution. I will show developers how to get started with GateIn and how to navigate and administer the portal and portlets. I will also demonstrate how to skin the portal to look like a \"normal\" web application that delivers content management, authentication, social capabilities and many other services.\nIf time allows, I will also dive into the JBoss Portlet Bridge project which allows you to run a Seam, Richfaces, or normal JSF application as a portlet.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Wesley Hales-GateIn.pdf","speakers":[{"createdDate":null,"version":4,"id":1024,"updatedDate":null,"bio":"Wesley Hales is a User Interface architect from Atlanta, GA. He has been involved in UI and User Experience roles for over a decade in both startup and enterprise environments. Wesley co-founded several enterprise frameworks during his 4.5 years at JBoss by Red Hat (including the JBoss Portlet Bridge and AeroGear projects) and also served as a co-founder of the recently acquired startup, InstaOps. He is now employed by Apigee as a software developer mainly focused on UI.\r\n\r\nOverall, Wesley enjoys creating world-class user interfaces and experiences that people fall in love with.\r\nYou can see him speak at the occasional conference, read his posts on [wesleyhales.com](http://wesleyhales.com), or follow him on twitter @wesleyhales.","firstName":"Wesley","lastName":"Hales","twitterId":"wesleyhales","googlePlusId":"114682255328371246824","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"GateIn - The Solution for Managing and Building Enterprise Web Apps","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1094,"updatedDate":1411659465691,"audioLink":"","description":"Java is a well established language, that has been around for more than a decade. Yet, programming on it has its challenges. There are concepts and\nfeatures that are tricky. When you run into those, the compiler is not there to help you. In this presentation we will look at various concepts that you will use in\ngeneral programming with Java. We will discuss the issues with those and how you can improve your code. We will look at concepts you can do better and\nthose you should outright avoid.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Venkat Subramaniam-Effective_Java.zip","speakers":[{"createdDate":null,"version":7,"id":1009,"updatedDate":1418596246756,"bio":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats@agiledeveloper.com or on twitter at @venkat_s.","firstName":"Venkat","lastName":"Subramaniam","twitterId":"venkat_s","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Effective Java","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1089,"updatedDate":1411659465695,"audioLink":"","description":"Building highly interactive software that users love to use is usually a challenging endeavor. However, the open source Flex SDK and Java are a perfect combination of technologies for building very rich and highly interactive software for the Web and the desktop. The communication between the Java back-end and Flex front-end can utilize a number of different communication protocols, but the easiest and best performing is the open source BlazeDS library. This session covers the fundamentals of using Flex, Java, Spring, EJB, Hibernate, and BlazeDS to build rich and highly interactive software for the Web and the desktop. ","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-James Ward-Better Software with Java and Flex.pdf","speakers":[{"createdDate":null,"version":4,"id":1000,"updatedDate":null,"bio":"James Ward (http://www.jamesward.com) works for Typesafe where he teaches developers the Typesafe Stack (Play Framework, Scala, and Akka). James frequently presents at conferences around the world such as JavaOne, Devoxx, and many other Java get-togethers. Along with Bruce Eckel, James co-authored First Steps in Flex. He has also published numerous screencasts, blogs, and technical articles. Starting with Pascal and Assembly in the 80′s, James found his passion for writing code. Beginning in the 90′s he began doing web development with HTML, Perl/CGI, then Java. After building a Flex and Java based customer service portal in 2004 for Pillar Data Systems he became a Technical Evangelist for Flex at Adobe. In 2011 James became a Principal Developer Evangelist at Salesforce.com where he taught developers how to deploy apps on the cloud with Heroku. James Tweets as @_JamesWard and posts code at http://github.com/jamesward.","firstName":"James","lastName":"Ward","twitterId":"_JamesWard","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Better Software with Java and Flex","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1112,"updatedDate":1411659465699,"audioLink":"","description":"Mobile applications are becoming more and more important for both users and businesses. Android provides and important platform for building and delivering those applications. Android matters because it is open, free, capable, and fully customizable. Android has been embraced by device manufacturers and mobile service providers -- and you can use it to write great applications too. This session will focus on a quick overview of the Android platform, from operating system to middleware, to applications and APIs; and then to development basics covering fundamental concepts and how to get common tasks done.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Charlie Collins-Unlocking Android Development.zip","speakers":[{"createdDate":null,"version":2,"id":1015,"updatedDate":null,"bio":"Charlie Collins is the Director of Technology at MOVL; an experienced java, mobile, and web developer; a contributor to several open source projects; and coauthor of Android in Practice, Unlocking Android, and GWT in Practice.","firstName":"Charlie","lastName":"Collins","twitterId":"CharlieCollins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Unlocking Android Development","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1111,"updatedDate":1411659465704,"audioLink":"","description":"Google AppEngine is a developer's dream: one-button deployment, no servers to configure, and ultimate scalabilty. To get these benefits, however, you must learn to design within AppEngine's constraints: no threads, no relational database, and a JRE whitelist, to name a few.\nThis presentation offers a peek inside a real-world GWT application deployed on AppEngine. We'll look at working with the AppEngine database (including version upgrade considerations), how to do\nbackground processing absent thread support, designing for quotas, and discuss one developer's overall experience launching a startup on AppEngine.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-David Chandler-The 90-Day Startup on Google AppEngine.pdf","speakers":[{"createdDate":null,"version":4,"id":1014,"updatedDate":null,"bio":"David Chandler works with the Google Developer Tools Team in Atlanta. An electrical engineer by training, Chandler got hooked on developing database Web applications in the days of NCSA Mosaic and has since written Web applications in a variety of languages, including C, perl, ksh, ColdFusion, Java, JSF, GWT, and now Dart. Prior to joining Google, Chandler worked on Internet banking applications with Intuit and launched a non-profit startup built with GWT and AppEngine. Chandler holds a patent on a method of organizing hierarchical data in a relational database and blogs about Java Web development at http://turbomanage.wordpress.com.","firstName":"David","lastName":"Chandler","twitterId":"drfibonacci","googlePlusId":"102717421433762219474","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"The 90-Day Startup with Google AppEngine: A Case Study","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1109,"updatedDate":1411659465714,"audioLink":"","description":"Java is ambitious in a few ways, but mostly it has been developed as one very practical decision after another. Scala rounds off the rough edges of Java by injecting it with many ideas from other languages, and it adds a few new features such as pattern matching that simplify your code further. I will describe the language and show a variety of ways it makes your code shorter and more to the point.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Lex Spoon-Scala: Running on the JVM with Less Boilerplate.pdf","speakers":[{"createdDate":null,"version":1,"id":1010,"updatedDate":null,"bio":"Dr. Alexander Spoon has been involved in the development of a wide variety of programming language research projects, ranging from dynamic languages like Scheme and Squeak to statically typed languages like Scala. He currently works on the compiler of the Google Web Toolkit, which converts Java code to JavaScript for running in web browsers. He previously worked two years as a post-doc at EPFL on Scala. ","firstName":"Lex","lastName":"Spoon","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Scala: Running on the JVM with Less Boilerplate","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1100,"updatedDate":1411659465747,"audioLink":"","description":"Google introduced Wave saying that this new online collaboration tool \"reinvents email\". But they have offered developers a lot more than that. The Wave architecture incorporates many innovations since email - especially live cooperative editing. So Google challenges us to reinvent our communication apps with these possibilities in mind.\n\nWave is a big topic so the talk is organized in three parts with time for discussion:\n\n1. Wave - Product, Platform, and Protocol.\nAn overview of Wave emphasizing the Wave platform for extension development.\n\n2. Wave architecture - Patterns for development.\nApproaches for using Wave's live synchronization layer with new and existing web applications.\n\n3. Development of Wave robots in Java.\nThe API for building Wave robots that watch user activity and respond with edits. Robot services range from simple text substitution to interfaces to existing web services.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Rick Thomas-Google Wave for Developers.pdf","speakers":[{"createdDate":null,"version":1,"id":1008,"updatedDate":null,"bio":"Rick Thomas, is an entrepreneur focused on the strategic design of cooperative work. His goal is \"better language\" from a fundamental perspective as well as in new media practice. In the 1980’s Mr. Thomas was a software engineer and manager on projects including avionics testing and manufacturing automation. His special interest in tools for project management led him to attend the ACM conference on Computer Supported Cooperative Work (CSCW) in 1986. In 1987 he was program chairman for the IEEE Conference on Engineering Management, which emphasized the CSCW theme. In the 1990’s Mr. Thomas applied these ideas by developing collaboration software for project and sales organizations, and later for interactive video language learning and other multimedia projects. In the 2000’s his work has been to explore the design possibilities at the intersection of three fields: 1) the natural history of language, its biology and its future, 2) applied language for management and decision making, and 3) modern media for language including internet culture, standards and applications. He is a Management Advisor to Evenview, which develops and places creative teams, and has developed a course in Managerial Decision Making at the College of Business at Georgia State University. He is active in the Atlanta technical community where he presents on Google Wave as a platform for innovation. Education: MSEE 1976, BSEE 1975, Georgia Institute of Technology. MBA 1979, Georgia State University.","firstName":"Rick","lastName":"Thomas","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Google Wave for Developers","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1099,"updatedDate":1411659465751,"audioLink":"","description":"Google App Engine is Google's cloud offering. In this presentation I'll introduce you to App Engine through comparison and contrast to typical JEE cluster deployments. You'll learn about unique, distinguishing features of App Engine; we'll walk through code examples that demonstrate App Engine capabilities; and I'll explain important differences you'll need to understand in order to develop successful App Engine applications. ","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Toby Reyelts-Google App Engine Cloud vs Cluster.pdf","speakers":[{"createdDate":null,"version":1,"id":1011,"updatedDate":null,"bio":"Toby Reyelts is a software engineer at Google who specializes in the JVM. He is a co-creator of App Engine for Java and a member of the Google Web Toolkit team. He has also authored open-source projects, such as the popular Retroweaver. Toby is at his happiest when he can make things both simple and fast. ","firstName":"Toby","lastName":"Reyelts","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Google App Engine: Cloud vs Cluster","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1106,"updatedDate":1411659465755,"audioLink":"","description":"The Java EE 6 platform is an extreme makeover from the previous versions. It is developed as JSR 316 under the Java Community Process.\n\nThe Java EE 6 platform adds more power to the platform and yet make it more flexible so that it can be adopted to different flavors of an application. It breaks the \"one size fits all\" approach with Profiles and improves on the Java EE 5 developer productivity features. It enables extensibility by embracing open source libraries and frameworks such that they are treated as first class citizens of the platform.\n\nSeveral new specifications such as Java Server Faces 2.0, Servlet 3.0, Java Persistence API 2.0, and Context and Dependency Injection 1.0 are included in the platform. All these specifications are implemented in GlassFish v3 that provides a light-weight, modular, and extensible platform for your Web applications.\n\nThis session provides an overview of Java EE 6 and its Reference Implementation - GlassFish v3. Using multiple simple-to-understand samples it explains the value proposition provided by Java EE 6.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Arun Gupta-Java EE 6 and GlassFish v3.pdf","speakers":[{"createdDate":null,"version":1,"id":1025,"updatedDate":null,"bio":"Arun Gupta is a GlassFish Evangelist working at Sun Microsystems. He has over 13 years of experience in the software industry working in various technologies, Java(TM) platform, and several web-related technologies. In his current role, he works very closely to create and foster the community around GlassFish. He has participated in several standard bodies and worked amicably with members from other companies. He has been with the Java EE team since it’s inception and contributed to all Java EE releases. He is a prolific blogger at http://blogs.sun.com/arungupta. This blog has over 1000 blog entries with frequent visitors from all over the world reaching up to 25,000 hits/day.","firstName":"Arun","lastName":"Gupta","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Java EE 6 & GlassFish v3: Paving the Path for Future","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1105,"updatedDate":1411659465759,"audioLink":"","description":"This session is aimed at helping developers get started with\nautomating the collection of software quality metrics. We'll cover\ncontinuous integration, automated code metrics gathering, and analysis\nof these metrics. The ability to be able to detect problems early, and\nalso to write higher quality code early, helps avoid bugs and headache\ndown the line. We'll cover some best practices around using and\nputting in tools to help achieve higher quality.\n\nThis course centers around two freely available tools for maintaining\nhigh quality codebases. The first is Hudson, a continuous integration\nserver. The second is Sonar, a code metrics server. In this session,\nwe'll discuss best practices and then put them into use by setting up\nand running these tools. We'll also talk about tips for getting the\nmost out of these tools. If you aren't using these tools in\ndevelopment, you absolutely need to come to this session - it will\nhelp make your life easier and impress your boss too!","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Pratik Patel-Hudson and Sonar.pdf","speakers":[{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"}],"title":"Hudson and Sonar - Automated Software Quality Control Tools","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1087,"updatedDate":1411659465809,"audioLink":"","description":"The success of Web 2.0 and the popularity of mobile applications has revealed an important fact. Having an engaging or otherwise compelling user experience is critical to an application's success. Given a choice, people will replace an application they find difficult to use with something that's easier; even if the replacement doesn't do everything the original did. Some businesses bring in professional User Experience Designers in an attempt to deal with this issue. The problem is that most designers don't actually write code, and running code is the key factor in determining what kind of user experience your customers have.\n\nThat's why it is critical that you understand the principles and fundamentals presented in this talk. You'll leave with a better handle on what user experience is, and what you can do to ensure your application delivers the best possible user experience to your customers.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Burk Hufnagel-9.7ThingsEveryProgrammerShouldKnowAboutUX.pdf","speakers":[{"createdDate":null,"version":5,"id":1022,"updatedDate":1419200564909,"bio":"Burk is a long-time programmer and software architect, with experience in multiple languages. He has presented technical topics at AJUG meetings, JavaOne, DevNexus, and the Atlanta IT Architect Regional Conference for several years. In 2010, he was voted a JavaOne Rock Star for his talk on User Experience Anti-Patterns titled \"No More Loser Experiences\". Burk wrote two articles for the O'Reilly book \"97 Things Every Software Architect Should Know\", and another two for \"97 Things Every Programmer Should Know\". He has also contributed to books like the \"SCJP for Java 6 Study Guide\", and \"Head First Software Development\", as a technical reviewer.","firstName":"Burk","lastName":"Hufnagel","twitterId":"@BurkHufnagel","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"9.7 Things Every Programmer Should Know About User Experience","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1107,"updatedDate":1411659466006,"audioLink":"","description":"JSR-299: Contexts and Dependency Injection for Java EE is an elegant set of new services for Java that draws upon ideas from JBoss Seam and Google Guice. While many of the features provided (dependency injection, contextual lifecycle, configuration, interception, event notification) are familiar, the innovative use of meta-annotations is uniquely expressive and typesafe.\n\nSeam is a powerful open source development platform for building rich Internet applications in Java. Seam is built on a JSR-299: Contexts and Dependency Injection for Java EE core (provided by Weld in JBoss Application Server), which integrates with Java EE technologies like JavaServer Faces (JSF) and Enterprise Java Beans (EJB 3.0). Seam integrates technologies such as Java Persistence (JPA), Business Process Management (BPM), Rules (Drools), Wicket, PDF and Excel reporting, Security and email into a unified full-stack solution, complete with sophisticated tooling.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Dan Allen-cdi-weld-future-of-seam.pdf","speakers":[{"createdDate":null,"version":2,"id":1012,"updatedDate":1419196225558,"bio":"Dan is an open source advocate, community catalyst, developer, published author (Seam in Action) and internationally recognized speaker. He is the lead of the Asciidoctor project (asciidoctor.org), serves as the strategic advisor for Arquillian (arquillian.org) and helps promote the JVM as a polyglot Java Champion. \r\n\r\nAs one of the founders of OpenDevise, Dan works with software communities and businesses to help them discover and cultivate their open source way. (Is there any other way?)\r\n\r\nAfter a long conference day, you'll likely find Dan enjoying chatting about tech, docs and open source with fellow community members over a Trappist beer or Kentucky Bourbon.","firstName":"Dan","lastName":"Allen","twitterId":"mojavelinux","googlePlusId":"114112334290393746697","linkedInId":"mojavelinux","lanyrdId":"mojavelinux","githubId":"mojavelinux"}],"title":"JSR-299 (CDI), Weld and the future of Seam","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1104,"updatedDate":1411659466014,"audioLink":"","description":"Top-to-bottom integration testing is a critical step in delivering quality web applications. HtmlUnit is an open source headless browser for the JVM which provides an efficient means of automating these integration tests. Unlike most other tools in this area, HtmlUnit simulates a browser rather than driving a \"real\" browser, and is capable of emulating the behavior of Firefox or IE for a very large number of web applications: from simple old-fashioned pre-AJAX applications all the way to complex Web 2.0 apps.\n\nHtmlUnit's approach provides obvious benefits in areas such as ease of deployment, performance, scalability, and AJAX testing, but also has some limitations. Project committer Daniel Gredler will provide a detailed overview of the library, explain how to get the most out of the HtmlUnit approach, and show why in many cases it is far more efficient than working with a \"real\" browser to ensure the quality of your web app.\n\nThe intended audience of the session are Java (or other JVM language) developers who need to write top-to-bottom integration tests for their web applications.\n\nAttendees will learn about:\n\n- The two approaches to web app integration testing: browser simulation vs browser driving\n- The cons of the browser simulation approach\n- The pros of the browser simulation approach\n- Key extension points provided by HtmlUnit\n- Wrappers which allow you to hedge your bets and switch between the two approaches","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Daniel Gredler-HtmlUnit.pdf","speakers":[{"createdDate":null,"version":1,"id":1017,"updatedDate":null,"bio":"Daniel Gredler is a development lead at DHL Global Mail, where he focuses on custom shipping solutions. He is a committer to the HtmlUnit and Apache Tapestry projects, and has contributed to a number of other open source projects. In his free time, Daniel enjoys reading, metal detecting, and writing conference bios about himself.","firstName":"Daniel","lastName":"Gredler","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"HtmlUnit: An Efficient Approach to Testing Web Applications","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1102,"updatedDate":1411659466018,"audioLink":"","description":"The asynchronous nature of GWT development requires a new way of thinking, especially for long-time server-side Web developers. How to notify views of changes to the model? Communicate between views? Cache data from service calls? And how to avoid UI spaghetti code? In this talk, you'll get a close-up look at a real-world app using the Model View Presenter pattern as implemented by the gwt-presenter and gwt-dispatch frameworks. We'll cover the event bus, decoupling presenters and views, making secure service calls with the Command pattern, and how GWT+MVP supports caching and an Undo feature. Learn what MVP is all about and whether it's right for you.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-David Chandler-GWT with MVP A Case Study.pdf","speakers":[{"createdDate":null,"version":4,"id":1014,"updatedDate":null,"bio":"David Chandler works with the Google Developer Tools Team in Atlanta. An electrical engineer by training, Chandler got hooked on developing database Web applications in the days of NCSA Mosaic and has since written Web applications in a variety of languages, including C, perl, ksh, ColdFusion, Java, JSF, GWT, and now Dart. Prior to joining Google, Chandler worked on Internet banking applications with Intuit and launched a non-profit startup built with GWT and AppEngine. Chandler holds a patent on a method of organizing hierarchical data in a relational database and blogs about Java Web development at http://turbomanage.wordpress.com.","firstName":"David","lastName":"Chandler","twitterId":"drfibonacci","googlePlusId":"102717421433762219474","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"GWT MVP Case Study","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1092,"updatedDate":1411659465644,"audioLink":"","description":"This session picks up where part I left off by adding an integration layer to the application.\nThis integration layer will allow the application to connect to other systems, as well as push messages to clients asynchronously.\nSecuring the web application will also be addressed, and you'll learn how to support multiple client types such as Flash (Flex) and .NET.\nAttendees will complete the session with a broad understanding of using Spring to solve enterprise integration problems.\n\nTopics covered:\nSpring Integration, Spring BlazeDS Integration (Flex), Ajax Polling/Comet, Object-To-XML Mapping (OXM), Common Enterprise Integration Patterns, best-of-breed development tools","presentationLink":"","speakers":[{"createdDate":null,"version":1,"id":1016,"updatedDate":null,"bio":"Keith Donald is a principal and founding partner at SpringSource, the company behind Spring and a division of VMware. At SpringSource, Keith is a full-time member of the Spring development team focusing on web application development productivity. He is also the architect behind SpringSource's state-of-the-art training curriculum, which has provided practical Spring training to over 10,000 students worldwide. Over his career, Keith, an experienced enterprise software developer and mentor, has built business applications for customers spanning a diverse set of industries including banking, network management, information assurance, education, retail, and healthcare. He is particularly skilled at translating business requirements into technical solutions.","firstName":"Keith","lastName":"Donald","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Developing Web Applications with Spring, Part II","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1110,"updatedDate":1411659465709,"audioLink":"","description":"Blacksmiths in 1900 and PowerBuilder developers in 1996 have something in common: they thought their job was safe forever. Yet circumstances proved them wrong. One of the nagging concerns for developers is how do you predict the Next Big Thing, preferably before you find yourself dinosaurized. This keynote discusses why people are bad at predicting the future, and why picking the Next Big Thing is hard. Then, it foolishly does just that: tries to predict the future. I also provide some guidelines on how to polish your crystal ball, giving you tools to help ferret out upcoming trends. Don't get caught by the rising tide of the next major coolness: nothing's sadder than an unemployed farrier watching cars drive by.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Neal Ford-Smithing_in_the_21st_Century.pdf","speakers":[{"createdDate":null,"version":3,"id":1006,"updatedDate":1417210185566,"bio":"Neal Ford is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, magazine articles, video/DVD presentations, and author and/or editor of eight books spanning a variety of subjects and technologies, including the most recent Presentation Patterns and Functional Thinking. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 300 developer conferences worldwide, delivering more than 2000 presentations. Check out his web site at nealford.com. He welcomes feedback and can be reached at nford@thoughtworks.com.\r\n","firstName":"Neal","lastName":"Ford","twitterId":"neal4d","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Smithing in the 21st Century","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1108,"updatedDate":1411659465719,"audioLink":"","description":"All development organizations eventually converge on a set of tools to reduce costs, lower onboarding time, and leverage knowledge in strong communities to create standard processes. To this end we see in many organizations the emergence of a standard development stack consisting of Maven, M2Eclipse, Nexus & Hudson. In this talk, Jason van Zyl will discuss the future of Maven and specifically Maven 3.x, the rapidly approaching M2Eclipse 1.0 release, the recent Nexus 1.5 release and roadmap, and the emergence of tools like Maven Shell and Polyglot Maven. Sonatype itself leverages this stack on a daily basis and this discussion will focus not only on the tools individually, but how they can work together to create a best practices approach to building and delivering your software in your organization.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Jason van Zyl-Maven.pdf","speakers":[{"createdDate":null,"version":1,"id":1007,"updatedDate":null,"bio":"Jason van Zyl is the Founder and CTO of Sonatype, the leader in Java development infrastructure whose customers include Intuit, Cisco, Qualcomm, Vanguard and E*Trade. Jason has over 10 years of experience in open source and proprietary enterprise software development. An open source enthusiast, Jason is the founder of the Apache Maven project, and the original benefactor of the Nexus and M2Eclipse projects. Jason currently serves as Chair of the Apache Maven Project Management Committee. He has been involved with the Apache Software Foundation (ASF) for seven years, helped to found Codehaus, a well respected incubation facility for open source community projects, and is a frequent speaker at many major software conferences, including JavaOne, EclipseCon, EmergingTech, and ApacheCon.","firstName":"Jason","lastName":"van Zyl","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Next Generation Development Infrastructure: Maven, M2Eclipse, Nexus & Hudson","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1093,"updatedDate":1411659465788,"audioLink":"","description":"The first book on Domain-Driven Design was published in 2003, authored by Eric Evans, who first coined the term and distilled the time-tested principles and patterns that make up the practice of DDD. In recent years, simplification and increased testability through frameworks like Spring, Hibernate, and others has substantially reduced the complexity of application infrastructure, allowing teams to turn their focus to honing their approach to software design. Domain-Driven Design meets practitioners in that quest with principles, practices, and process to recapture the spirit of software excellence that has been lost in so many of today's technology practices.\n\nThis talk will introduce the foundations of Domain-Driven Design, and present several facets of DDD in action:\n\n* How models are chosen and evaluated\n* How multiple models coexist\n* How patterns help to avoid common pitfalls, such as overly-interconnected models\n* How developers and domain experts together in a DDD team engage in deeper exploration of their problem domain and make that understanding tangible as a practical software design","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Barry Hawkins-Domain-Driven Design: An Introduction.pdf","speakers":[{"createdDate":null,"version":2,"id":1023,"updatedDate":null,"bio":"Barry has played various roles in his 17 years in the software industry, including lone developer, team lead, director, and Agile coach and mentor. Barry is one of the few native Atlantans, currently specializing in coaching and mentoring for Agile software development in addition to doing contract software development. Over the years, he has developed on multiple platforms, focusing primarily on Microsoft technologies and then Java from 2003 onward. He views technology as a set of tools, and embraces the use of dynamic as well as statically-typed languages, procedural, object-oriented, and functional programming, each having their own strengths in a given problem domain.\r\n\r\nPrior to his career in software, Barry Hawkins spent 10 years designing, selling, and delivering turn-key industrial packaging and marking systems into manufacturing plants throughout the southeastern United States. He was responsible for the implementation, maintenance, and support of every system he sold, which was a formative experience that continues to influence his approach to consulting and coaching.","firstName":"Barry","lastName":"Hawkins","twitterId":"barryhawkins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Domain-Driven Design: An Introduction","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1096,"updatedDate":1411659465889,"audioLink":"","description":"There are numerous resources available that cover the topic of software development process and project management. There are numerous resources available that cover tools, frameworks, libraries, containers, application servers, languages, databases and so on. There are numerous resources available that cover software architecture. There are numerous resources that cover software quality assurance and testing. There are numerous resources that cover team structure, organization and work environment.\n\nThe truth is, all of these topics have an impact on whether we are ultimately successful in getting the job done. This talk aims to touch all of these topics by providing an honest retrospective into how we developed and bought a brand new product to market.\n\nWe will cover the trade-offs, the challenges, the mistakes, the process, the tools, the frameworks, the regrets, the work environment and the team organization. You will learn that there are many choices to be made during the course of a software development project. You will learn about the choices we made – and you will learn that just because the choices worked for us doesn’t necessarily mean they will work for you. The goal is for you to find this useful material – whether you are building a corporate IT system, or if you are building a new software product or service regardless of whether you are developer, a product manager, an architect, a test engineer or a project manager.","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1013,"updatedDate":1389131486395,"bio":"Jason is a software guy living in Atlanta, GA. He's been slinging code since the age of 12 and would dearly love to be slinging code until he finally pops his clogs. He's worked at startups, airlines, telcos and software companies big and small. He's currently Director of Engineering at Lancope - a fast growing network security company that helps enterprises protect what is important from advanced cyber threats. ","firstName":"Jason","lastName":"Chambers","twitterId":"jasondchambers","googlePlusId":"","linkedInId":"jasondchambers","lanyrdId":"","githubId":""}],"title":"From whiteboard to product launch","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1090,"updatedDate":1411659466023,"audioLink":"","description":"In this presentation we learn how to use Terracotta Ehcache to dramatically boost application performance. Terracotta Ehcache provides a high performance Hibernate second level cache that boosts application performance as much as 10x.\n\nUnderstanding performance behavior specific to your application can be a challenging task. Every application workload is unique. To provide reliable metrics for comparison, Terracotta Ehcache has benchmarked the Spring PetClinic reference application against competitive solutions such as Memcached, Commercial IMDG, My SQL and a leading In Memory Data Grid including the impressive performance increases from the latest Terracotta 3.2 Server Array.\n\nTerracotta Ehcache EX and FX bring unparalleled scale and performance that hundreds of thousands of deployments depend on today. Some of the world’s largest companies rely on the enterprise scale of Terracotta. Whether your application simply needs easier monitoring and management capabilities or demands high performance and high availability, Terracotta Ehcache is the best solution on the market.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Greg Luck-Terracotta Ehcache.pdf","speakers":[{"createdDate":null,"version":2,"id":1005,"updatedDate":null,"bio":"Greg founded Ehcache in 2003. He regularly speaks at conferences, writes and codes. He has also founded and maintains the JPam and Spnego open source projects, which are security focused. Prior to joining Terracotta in 2009, Greg was Chief Architect at Wotif.com where he provided technical leadership as the company went from a single product startup to a billion dollar public company with multiple product lines. Before that Greg was a consultant for ThoughtWorks with engagements in the US and Australia in the travel, health care, geospatial, banking and insurance industries. Before doing programming, Greg managed IT. He was CIO at Virgin Blue, Tempo Services, Stamford Hotels and Resorts and Australian Resorts. He is a Chartered Accountant, and spent 7 years with KPMG in small business and insolvency. Greg holds a Bachelor of Commerce and a Masters in Information Technology.","firstName":"Greg","lastName":"Luck","twitterId":"gregrluck","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Boost application performance and monitoring with Terracotta Ehcache","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1113,"updatedDate":1411659465992,"audioLink":"","description":"A large number of Agile adoption initiatives start at a grassroots level among software developers who have grown uncomfortable with the blatant inefficiencies of classic approaches to software development. The teams who succeed often find themselves working more efficiently, but the impact of their success is hindered. They are still relegated to taking large functional specifications and digesting them into iterations of work, with little if any feedback from the business side of the house. A series of successful sprints can still be met with the cliche \"that's not what we wanted\" response, leaving development teams relegated to the \"well that's what you wrote\" response. Until the business people are participating in iterative feedback and realizing the flexibility and freedom they have in working with these Agile teams, there will always be a ceiling on their success.\n\nAttendees of this talk will be guided through pragmatic, proven approaches for building that bridge to the business representatives. A thorough treatment of how user stories can be used as an effective tool that allows business and development sides of the house to meet in the middle, as well as when and how to bend in order to move the adoption process forward. It will also cover the sometimes subtle pitfalls and hotspots of promoting a fully Agile process with participating business team members, and ways to hopefully allow good deeds to continue to go unpunished.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Barry Hawkins-User Stories: Agile and Lean Requirements.pdf","speakers":[{"createdDate":null,"version":2,"id":1023,"updatedDate":null,"bio":"Barry has played various roles in his 17 years in the software industry, including lone developer, team lead, director, and Agile coach and mentor. Barry is one of the few native Atlantans, currently specializing in coaching and mentoring for Agile software development in addition to doing contract software development. Over the years, he has developed on multiple platforms, focusing primarily on Microsoft technologies and then Java from 2003 onward. He views technology as a set of tools, and embraces the use of dynamic as well as statically-typed languages, procedural, object-oriented, and functional programming, each having their own strengths in a given problem domain.\r\n\r\nPrior to his career in software, Barry Hawkins spent 10 years designing, selling, and delivering turn-key industrial packaging and marking systems into manufacturing plants throughout the southeastern United States. He was responsible for the implementation, maintenance, and support of every system he sold, which was a formative experience that continues to influence his approach to consulting and coaching.","firstName":"Barry","lastName":"Hawkins","twitterId":"barryhawkins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"User Stories: Agile and Lean Requirements","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]}],"numberOfPresentations":27},"event":{"createdDate":null,"version":1,"id":1004,"updatedDate":null,"eventKey":"devnexus2010","title":"DevNexus 2010","current":false,"presentations":[{"createdDate":null,"version":1,"id":1101,"updatedDate":1411659465678,"audioLink":"","description":"As the complexity of web applications continues to grow, the development tools provided to those creating such apps have remained, to a large extent, stagnant. The difficultly of adding the next \"killer\" feature while keeping load times reasonable and code size small can drive any Javascript guru to the brink of insanity. Google Web Toolkit provides tools that allow you to maintain your sanity and approach web development in the same manner you would any other large scale project. And much like any other set of tools, there are various ways to approach a project; some more efficient and scalable than others. The goal of \"GWT Best Practices\" is to take a deeper dive into slick ways to reduce code size, minimize RPC overhead, and streamline application development and testing using the MVP architecture within your GWT app.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Chris Ramsdale-GWT Best Practices.pdf","speakers":[{"createdDate":null,"version":1,"id":1018,"updatedDate":null,"bio":"Since starting at Georgia Tech in 1996, Chris Ramsdale has lived and worked in the Atlanta area for the past 13 years. Working in the mobile space with local companies such as Motorola, AppForge, and Air2Web, Chris has held positions as a Software Engineer, Tech Lead, and Product Manager. His current endeavor is working within Google's Developer Relations team to help educate and advocate Google Web Toolkit.","firstName":"Chris ","lastName":"Ramsdale","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"GWT Best Practices","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1099,"updatedDate":1411659465751,"audioLink":"","description":"Google App Engine is Google's cloud offering. In this presentation I'll introduce you to App Engine through comparison and contrast to typical JEE cluster deployments. You'll learn about unique, distinguishing features of App Engine; we'll walk through code examples that demonstrate App Engine capabilities; and I'll explain important differences you'll need to understand in order to develop successful App Engine applications. ","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Toby Reyelts-Google App Engine Cloud vs Cluster.pdf","speakers":[{"createdDate":null,"version":1,"id":1011,"updatedDate":null,"bio":"Toby Reyelts is a software engineer at Google who specializes in the JVM. He is a co-creator of App Engine for Java and a member of the Google Web Toolkit team. He has also authored open-source projects, such as the popular Retroweaver. Toby is at his happiest when he can make things both simple and fast. ","firstName":"Toby","lastName":"Reyelts","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Google App Engine: Cloud vs Cluster","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1112,"updatedDate":1411659465699,"audioLink":"","description":"Mobile applications are becoming more and more important for both users and businesses. Android provides and important platform for building and delivering those applications. Android matters because it is open, free, capable, and fully customizable. Android has been embraced by device manufacturers and mobile service providers -- and you can use it to write great applications too. This session will focus on a quick overview of the Android platform, from operating system to middleware, to applications and APIs; and then to development basics covering fundamental concepts and how to get common tasks done.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Charlie Collins-Unlocking Android Development.zip","speakers":[{"createdDate":null,"version":2,"id":1015,"updatedDate":null,"bio":"Charlie Collins is the Director of Technology at MOVL; an experienced java, mobile, and web developer; a contributor to several open source projects; and coauthor of Android in Practice, Unlocking Android, and GWT in Practice.","firstName":"Charlie","lastName":"Collins","twitterId":"CharlieCollins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Unlocking Android Development","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1103,"updatedDate":1411659465670,"audioLink":"","description":"How do you get a Java based platform to process tens of millions of transactions a day in an average of under 3 milliseconds each? Processing half of the world’s oil transactions as well as US natural gas, sugar, coffee, financial index markets and more, the ICE platform and has entrenched ICE as a leader in the world of Futures and Options. Edwin Marcial will discuss the Intercontinental Exchange (ICE) Trading Platform architecture and how it has become the fastest trading platform in the commodities industry.","presentationLink":"","speakers":[{"createdDate":null,"version":1,"id":1020,"updatedDate":null,"bio":"Edwin Marcial is a Senior Vice President and the Chief Technology Officer for the Intercontinental Exchange (ICE). Mr. Marcial has over 17 years of experience in the technology industry architecting and developing software systems. His experiences include 4 years working with Harris Energy Control Systems division where he was part of a team developing state-of-the-art distributed energy management systems. He joined Continental Power Exchange (CPEX) in 1996 and in 1998 his technical vision led to the design of an Internet based distributed commodity trading system that would evolve to become the ICE trading platform. In 2000, CPEX became the Intercontinental Exchange (ICE) and the ICE Trading System was launched. Today Mr. Marcial leads a team of very talented technologists as they continue to enhance the ICE’s core trading, clearing and data systems and build new applications for the advancement of the Intercontinental Exchange. In 2007, Mr. Marcial was named the Georgia Corporate CIO of the Year, and in 2009 he was named as one of InfoWorld’s top 25 CTOs. Mr. Marcial holds a Bachelor’s Degree in Computer Science from the University of Florida’s College of Engineering. ","firstName":"Edwin","lastName":"Marcial","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"High Performance Architectures","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1110,"updatedDate":1411659465709,"audioLink":"","description":"Blacksmiths in 1900 and PowerBuilder developers in 1996 have something in common: they thought their job was safe forever. Yet circumstances proved them wrong. One of the nagging concerns for developers is how do you predict the Next Big Thing, preferably before you find yourself dinosaurized. This keynote discusses why people are bad at predicting the future, and why picking the Next Big Thing is hard. Then, it foolishly does just that: tries to predict the future. I also provide some guidelines on how to polish your crystal ball, giving you tools to help ferret out upcoming trends. Don't get caught by the rising tide of the next major coolness: nothing's sadder than an unemployed farrier watching cars drive by.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Neal Ford-Smithing_in_the_21st_Century.pdf","speakers":[{"createdDate":null,"version":3,"id":1006,"updatedDate":1417210185566,"bio":"Neal Ford is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, magazine articles, video/DVD presentations, and author and/or editor of eight books spanning a variety of subjects and technologies, including the most recent Presentation Patterns and Functional Thinking. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 300 developer conferences worldwide, delivering more than 2000 presentations. Check out his web site at nealford.com. He welcomes feedback and can be reached at nford@thoughtworks.com.\r\n","firstName":"Neal","lastName":"Ford","twitterId":"neal4d","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Smithing in the 21st Century","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1108,"updatedDate":1411659465719,"audioLink":"","description":"All development organizations eventually converge on a set of tools to reduce costs, lower onboarding time, and leverage knowledge in strong communities to create standard processes. To this end we see in many organizations the emergence of a standard development stack consisting of Maven, M2Eclipse, Nexus & Hudson. In this talk, Jason van Zyl will discuss the future of Maven and specifically Maven 3.x, the rapidly approaching M2Eclipse 1.0 release, the recent Nexus 1.5 release and roadmap, and the emergence of tools like Maven Shell and Polyglot Maven. Sonatype itself leverages this stack on a daily basis and this discussion will focus not only on the tools individually, but how they can work together to create a best practices approach to building and delivering your software in your organization.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Jason van Zyl-Maven.pdf","speakers":[{"createdDate":null,"version":1,"id":1007,"updatedDate":null,"bio":"Jason van Zyl is the Founder and CTO of Sonatype, the leader in Java development infrastructure whose customers include Intuit, Cisco, Qualcomm, Vanguard and E*Trade. Jason has over 10 years of experience in open source and proprietary enterprise software development. An open source enthusiast, Jason is the founder of the Apache Maven project, and the original benefactor of the Nexus and M2Eclipse projects. Jason currently serves as Chair of the Apache Maven Project Management Committee. He has been involved with the Apache Software Foundation (ASF) for seven years, helped to found Codehaus, a well respected incubation facility for open source community projects, and is a frequent speaker at many major software conferences, including JavaOne, EclipseCon, EmergingTech, and ApacheCon.","firstName":"Jason","lastName":"van Zyl","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Next Generation Development Infrastructure: Maven, M2Eclipse, Nexus & Hudson","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1105,"updatedDate":1411659465759,"audioLink":"","description":"This session is aimed at helping developers get started with\nautomating the collection of software quality metrics. We'll cover\ncontinuous integration, automated code metrics gathering, and analysis\nof these metrics. The ability to be able to detect problems early, and\nalso to write higher quality code early, helps avoid bugs and headache\ndown the line. We'll cover some best practices around using and\nputting in tools to help achieve higher quality.\n\nThis course centers around two freely available tools for maintaining\nhigh quality codebases. The first is Hudson, a continuous integration\nserver. The second is Sonar, a code metrics server. In this session,\nwe'll discuss best practices and then put them into use by setting up\nand running these tools. We'll also talk about tips for getting the\nmost out of these tools. If you aren't using these tools in\ndevelopment, you absolutely need to come to this session - it will\nhelp make your life easier and impress your boss too!","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Pratik Patel-Hudson and Sonar.pdf","speakers":[{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"}],"title":"Hudson and Sonar - Automated Software Quality Control Tools","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1090,"updatedDate":1411659466023,"audioLink":"","description":"In this presentation we learn how to use Terracotta Ehcache to dramatically boost application performance. Terracotta Ehcache provides a high performance Hibernate second level cache that boosts application performance as much as 10x.\n\nUnderstanding performance behavior specific to your application can be a challenging task. Every application workload is unique. To provide reliable metrics for comparison, Terracotta Ehcache has benchmarked the Spring PetClinic reference application against competitive solutions such as Memcached, Commercial IMDG, My SQL and a leading In Memory Data Grid including the impressive performance increases from the latest Terracotta 3.2 Server Array.\n\nTerracotta Ehcache EX and FX bring unparalleled scale and performance that hundreds of thousands of deployments depend on today. Some of the world’s largest companies rely on the enterprise scale of Terracotta. Whether your application simply needs easier monitoring and management capabilities or demands high performance and high availability, Terracotta Ehcache is the best solution on the market.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Greg Luck-Terracotta Ehcache.pdf","speakers":[{"createdDate":null,"version":2,"id":1005,"updatedDate":null,"bio":"Greg founded Ehcache in 2003. He regularly speaks at conferences, writes and codes. He has also founded and maintains the JPam and Spnego open source projects, which are security focused. Prior to joining Terracotta in 2009, Greg was Chief Architect at Wotif.com where he provided technical leadership as the company went from a single product startup to a billion dollar public company with multiple product lines. Before that Greg was a consultant for ThoughtWorks with engagements in the US and Australia in the travel, health care, geospatial, banking and insurance industries. Before doing programming, Greg managed IT. He was CIO at Virgin Blue, Tempo Services, Stamford Hotels and Resorts and Australian Resorts. He is a Chartered Accountant, and spent 7 years with KPMG in small business and insolvency. Greg holds a Bachelor of Commerce and a Masters in Information Technology.","firstName":"Greg","lastName":"Luck","twitterId":"gregrluck","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Boost application performance and monitoring with Terracotta Ehcache","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1089,"updatedDate":1411659465695,"audioLink":"","description":"Building highly interactive software that users love to use is usually a challenging endeavor. However, the open source Flex SDK and Java are a perfect combination of technologies for building very rich and highly interactive software for the Web and the desktop. The communication between the Java back-end and Flex front-end can utilize a number of different communication protocols, but the easiest and best performing is the open source BlazeDS library. This session covers the fundamentals of using Flex, Java, Spring, EJB, Hibernate, and BlazeDS to build rich and highly interactive software for the Web and the desktop. ","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-James Ward-Better Software with Java and Flex.pdf","speakers":[{"createdDate":null,"version":4,"id":1000,"updatedDate":null,"bio":"James Ward (http://www.jamesward.com) works for Typesafe where he teaches developers the Typesafe Stack (Play Framework, Scala, and Akka). James frequently presents at conferences around the world such as JavaOne, Devoxx, and many other Java get-togethers. Along with Bruce Eckel, James co-authored First Steps in Flex. He has also published numerous screencasts, blogs, and technical articles. Starting with Pascal and Assembly in the 80′s, James found his passion for writing code. Beginning in the 90′s he began doing web development with HTML, Perl/CGI, then Java. After building a Flex and Java based customer service portal in 2004 for Pillar Data Systems he became a Technical Evangelist for Flex at Adobe. In 2011 James became a Principal Developer Evangelist at Salesforce.com where he taught developers how to deploy apps on the cloud with Heroku. James Tweets as @_JamesWard and posts code at http://github.com/jamesward.","firstName":"James","lastName":"Ward","twitterId":"_JamesWard","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Better Software with Java and Flex","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1095,"updatedDate":1411659465662,"audioLink":"","description":"Corporate developers have to constantly contend with fallacies often delivered to them as facts. However, each of us has a professional\nresponsibility to be objective and make decisions that will help us and our teams be productive and deliver results. In this presentation\nwe'll pick on some fallacies, lay down facts, and discuss how to stay professional and objective in our daily efforts.","presentationLink":"","speakers":[{"createdDate":null,"version":7,"id":1009,"updatedDate":1418596246756,"bio":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats@agiledeveloper.com or on twitter at @venkat_s.","firstName":"Venkat","lastName":"Subramaniam","twitterId":"venkat_s","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Facts and Fallacies of Software Development","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1097,"updatedDate":1411659465687,"audioLink":"","description":"The newly formed JBoss GateIn project promises to deliver a scalable and intuitive portal solution. I will show developers how to get started with GateIn and how to navigate and administer the portal and portlets. I will also demonstrate how to skin the portal to look like a \"normal\" web application that delivers content management, authentication, social capabilities and many other services.\nIf time allows, I will also dive into the JBoss Portlet Bridge project which allows you to run a Seam, Richfaces, or normal JSF application as a portlet.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Wesley Hales-GateIn.pdf","speakers":[{"createdDate":null,"version":4,"id":1024,"updatedDate":null,"bio":"Wesley Hales is a User Interface architect from Atlanta, GA. He has been involved in UI and User Experience roles for over a decade in both startup and enterprise environments. Wesley co-founded several enterprise frameworks during his 4.5 years at JBoss by Red Hat (including the JBoss Portlet Bridge and AeroGear projects) and also served as a co-founder of the recently acquired startup, InstaOps. He is now employed by Apigee as a software developer mainly focused on UI.\r\n\r\nOverall, Wesley enjoys creating world-class user interfaces and experiences that people fall in love with.\r\nYou can see him speak at the occasional conference, read his posts on [wesleyhales.com](http://wesleyhales.com), or follow him on twitter @wesleyhales.","firstName":"Wesley","lastName":"Hales","twitterId":"wesleyhales","googlePlusId":"114682255328371246824","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"GateIn - The Solution for Managing and Building Enterprise Web Apps","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1087,"updatedDate":1411659465809,"audioLink":"","description":"The success of Web 2.0 and the popularity of mobile applications has revealed an important fact. Having an engaging or otherwise compelling user experience is critical to an application's success. Given a choice, people will replace an application they find difficult to use with something that's easier; even if the replacement doesn't do everything the original did. Some businesses bring in professional User Experience Designers in an attempt to deal with this issue. The problem is that most designers don't actually write code, and running code is the key factor in determining what kind of user experience your customers have.\n\nThat's why it is critical that you understand the principles and fundamentals presented in this talk. You'll leave with a better handle on what user experience is, and what you can do to ensure your application delivers the best possible user experience to your customers.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Burk Hufnagel-9.7ThingsEveryProgrammerShouldKnowAboutUX.pdf","speakers":[{"createdDate":null,"version":5,"id":1022,"updatedDate":1419200564909,"bio":"Burk is a long-time programmer and software architect, with experience in multiple languages. He has presented technical topics at AJUG meetings, JavaOne, DevNexus, and the Atlanta IT Architect Regional Conference for several years. In 2010, he was voted a JavaOne Rock Star for his talk on User Experience Anti-Patterns titled \"No More Loser Experiences\". Burk wrote two articles for the O'Reilly book \"97 Things Every Software Architect Should Know\", and another two for \"97 Things Every Programmer Should Know\". He has also contributed to books like the \"SCJP for Java 6 Study Guide\", and \"Head First Software Development\", as a technical reviewer.","firstName":"Burk","lastName":"Hufnagel","twitterId":"@BurkHufnagel","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"9.7 Things Every Programmer Should Know About User Experience","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1093,"updatedDate":1411659465788,"audioLink":"","description":"The first book on Domain-Driven Design was published in 2003, authored by Eric Evans, who first coined the term and distilled the time-tested principles and patterns that make up the practice of DDD. In recent years, simplification and increased testability through frameworks like Spring, Hibernate, and others has substantially reduced the complexity of application infrastructure, allowing teams to turn their focus to honing their approach to software design. Domain-Driven Design meets practitioners in that quest with principles, practices, and process to recapture the spirit of software excellence that has been lost in so many of today's technology practices.\n\nThis talk will introduce the foundations of Domain-Driven Design, and present several facets of DDD in action:\n\n* How models are chosen and evaluated\n* How multiple models coexist\n* How patterns help to avoid common pitfalls, such as overly-interconnected models\n* How developers and domain experts together in a DDD team engage in deeper exploration of their problem domain and make that understanding tangible as a practical software design","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Barry Hawkins-Domain-Driven Design: An Introduction.pdf","speakers":[{"createdDate":null,"version":2,"id":1023,"updatedDate":null,"bio":"Barry has played various roles in his 17 years in the software industry, including lone developer, team lead, director, and Agile coach and mentor. Barry is one of the few native Atlantans, currently specializing in coaching and mentoring for Agile software development in addition to doing contract software development. Over the years, he has developed on multiple platforms, focusing primarily on Microsoft technologies and then Java from 2003 onward. He views technology as a set of tools, and embraces the use of dynamic as well as statically-typed languages, procedural, object-oriented, and functional programming, each having their own strengths in a given problem domain.\r\n\r\nPrior to his career in software, Barry Hawkins spent 10 years designing, selling, and delivering turn-key industrial packaging and marking systems into manufacturing plants throughout the southeastern United States. He was responsible for the implementation, maintenance, and support of every system he sold, which was a formative experience that continues to influence his approach to consulting and coaching.","firstName":"Barry","lastName":"Hawkins","twitterId":"barryhawkins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Domain-Driven Design: An Introduction","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1091,"updatedDate":1411659465638,"audioLink":"","description":"In this session, Keith will provide a quick overview of what Spring provides for web application development.\nThen, from the ground up, he will take attendees through the process of designing and implementing a web application with the framework.\nAttendees will not only learn the Spring feature set, they will learn to apply the features effectively.\nWhether you are new to Spring, or an experienced Java developer who has used Spring before, this session should help you grow as an application developer.\n\nTopics covered:\nSpring Framework v3, MVC, \"Open Web\" stack of HTML/CSS/JavaScript, JSON, REST & resource-oriented architecture, progressive enhancement, best-of-breed development tools","presentationLink":"","speakers":[{"createdDate":null,"version":1,"id":1016,"updatedDate":null,"bio":"Keith Donald is a principal and founding partner at SpringSource, the company behind Spring and a division of VMware. At SpringSource, Keith is a full-time member of the Spring development team focusing on web application development productivity. He is also the architect behind SpringSource's state-of-the-art training curriculum, which has provided practical Spring training to over 10,000 students worldwide. Over his career, Keith, an experienced enterprise software developer and mentor, has built business applications for customers spanning a diverse set of industries including banking, network management, information assurance, education, retail, and healthcare. He is particularly skilled at translating business requirements into technical solutions.","firstName":"Keith","lastName":"Donald","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Developing Web Applications with Spring, Part I","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1113,"updatedDate":1411659465992,"audioLink":"","description":"A large number of Agile adoption initiatives start at a grassroots level among software developers who have grown uncomfortable with the blatant inefficiencies of classic approaches to software development. The teams who succeed often find themselves working more efficiently, but the impact of their success is hindered. They are still relegated to taking large functional specifications and digesting them into iterations of work, with little if any feedback from the business side of the house. A series of successful sprints can still be met with the cliche \"that's not what we wanted\" response, leaving development teams relegated to the \"well that's what you wrote\" response. Until the business people are participating in iterative feedback and realizing the flexibility and freedom they have in working with these Agile teams, there will always be a ceiling on their success.\n\nAttendees of this talk will be guided through pragmatic, proven approaches for building that bridge to the business representatives. A thorough treatment of how user stories can be used as an effective tool that allows business and development sides of the house to meet in the middle, as well as when and how to bend in order to move the adoption process forward. It will also cover the sometimes subtle pitfalls and hotspots of promoting a fully Agile process with participating business team members, and ways to hopefully allow good deeds to continue to go unpunished.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Barry Hawkins-User Stories: Agile and Lean Requirements.pdf","speakers":[{"createdDate":null,"version":2,"id":1023,"updatedDate":null,"bio":"Barry has played various roles in his 17 years in the software industry, including lone developer, team lead, director, and Agile coach and mentor. Barry is one of the few native Atlantans, currently specializing in coaching and mentoring for Agile software development in addition to doing contract software development. Over the years, he has developed on multiple platforms, focusing primarily on Microsoft technologies and then Java from 2003 onward. He views technology as a set of tools, and embraces the use of dynamic as well as statically-typed languages, procedural, object-oriented, and functional programming, each having their own strengths in a given problem domain.\r\n\r\nPrior to his career in software, Barry Hawkins spent 10 years designing, selling, and delivering turn-key industrial packaging and marking systems into manufacturing plants throughout the southeastern United States. He was responsible for the implementation, maintenance, and support of every system he sold, which was a formative experience that continues to influence his approach to consulting and coaching.","firstName":"Barry","lastName":"Hawkins","twitterId":"barryhawkins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"User Stories: Agile and Lean Requirements","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1100,"updatedDate":1411659465747,"audioLink":"","description":"Google introduced Wave saying that this new online collaboration tool \"reinvents email\". But they have offered developers a lot more than that. The Wave architecture incorporates many innovations since email - especially live cooperative editing. So Google challenges us to reinvent our communication apps with these possibilities in mind.\n\nWave is a big topic so the talk is organized in three parts with time for discussion:\n\n1. Wave - Product, Platform, and Protocol.\nAn overview of Wave emphasizing the Wave platform for extension development.\n\n2. Wave architecture - Patterns for development.\nApproaches for using Wave's live synchronization layer with new and existing web applications.\n\n3. Development of Wave robots in Java.\nThe API for building Wave robots that watch user activity and respond with edits. Robot services range from simple text substitution to interfaces to existing web services.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Rick Thomas-Google Wave for Developers.pdf","speakers":[{"createdDate":null,"version":1,"id":1008,"updatedDate":null,"bio":"Rick Thomas, is an entrepreneur focused on the strategic design of cooperative work. His goal is \"better language\" from a fundamental perspective as well as in new media practice. In the 1980’s Mr. Thomas was a software engineer and manager on projects including avionics testing and manufacturing automation. His special interest in tools for project management led him to attend the ACM conference on Computer Supported Cooperative Work (CSCW) in 1986. In 1987 he was program chairman for the IEEE Conference on Engineering Management, which emphasized the CSCW theme. In the 1990’s Mr. Thomas applied these ideas by developing collaboration software for project and sales organizations, and later for interactive video language learning and other multimedia projects. In the 2000’s his work has been to explore the design possibilities at the intersection of three fields: 1) the natural history of language, its biology and its future, 2) applied language for management and decision making, and 3) modern media for language including internet culture, standards and applications. He is a Management Advisor to Evenview, which develops and places creative teams, and has developed a course in Managerial Decision Making at the College of Business at Georgia State University. He is active in the Atlanta technical community where he presents on Google Wave as a platform for innovation. Education: MSEE 1976, BSEE 1975, Georgia Institute of Technology. MBA 1979, Georgia State University.","firstName":"Rick","lastName":"Thomas","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Google Wave for Developers","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1102,"updatedDate":1411659466018,"audioLink":"","description":"The asynchronous nature of GWT development requires a new way of thinking, especially for long-time server-side Web developers. How to notify views of changes to the model? Communicate between views? Cache data from service calls? And how to avoid UI spaghetti code? In this talk, you'll get a close-up look at a real-world app using the Model View Presenter pattern as implemented by the gwt-presenter and gwt-dispatch frameworks. We'll cover the event bus, decoupling presenters and views, making secure service calls with the Command pattern, and how GWT+MVP supports caching and an Undo feature. Learn what MVP is all about and whether it's right for you.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-David Chandler-GWT with MVP A Case Study.pdf","speakers":[{"createdDate":null,"version":4,"id":1014,"updatedDate":null,"bio":"David Chandler works with the Google Developer Tools Team in Atlanta. An electrical engineer by training, Chandler got hooked on developing database Web applications in the days of NCSA Mosaic and has since written Web applications in a variety of languages, including C, perl, ksh, ColdFusion, Java, JSF, GWT, and now Dart. Prior to joining Google, Chandler worked on Internet banking applications with Intuit and launched a non-profit startup built with GWT and AppEngine. Chandler holds a patent on a method of organizing hierarchical data in a relational database and blogs about Java Web development at http://turbomanage.wordpress.com.","firstName":"David","lastName":"Chandler","twitterId":"drfibonacci","googlePlusId":"102717421433762219474","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"GWT MVP Case Study","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1111,"updatedDate":1411659465704,"audioLink":"","description":"Google AppEngine is a developer's dream: one-button deployment, no servers to configure, and ultimate scalabilty. To get these benefits, however, you must learn to design within AppEngine's constraints: no threads, no relational database, and a JRE whitelist, to name a few.\nThis presentation offers a peek inside a real-world GWT application deployed on AppEngine. We'll look at working with the AppEngine database (including version upgrade considerations), how to do\nbackground processing absent thread support, designing for quotas, and discuss one developer's overall experience launching a startup on AppEngine.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-David Chandler-The 90-Day Startup on Google AppEngine.pdf","speakers":[{"createdDate":null,"version":4,"id":1014,"updatedDate":null,"bio":"David Chandler works with the Google Developer Tools Team in Atlanta. An electrical engineer by training, Chandler got hooked on developing database Web applications in the days of NCSA Mosaic and has since written Web applications in a variety of languages, including C, perl, ksh, ColdFusion, Java, JSF, GWT, and now Dart. Prior to joining Google, Chandler worked on Internet banking applications with Intuit and launched a non-profit startup built with GWT and AppEngine. Chandler holds a patent on a method of organizing hierarchical data in a relational database and blogs about Java Web development at http://turbomanage.wordpress.com.","firstName":"David","lastName":"Chandler","twitterId":"drfibonacci","googlePlusId":"102717421433762219474","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"The 90-Day Startup with Google AppEngine: A Case Study","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1104,"updatedDate":1411659466014,"audioLink":"","description":"Top-to-bottom integration testing is a critical step in delivering quality web applications. HtmlUnit is an open source headless browser for the JVM which provides an efficient means of automating these integration tests. Unlike most other tools in this area, HtmlUnit simulates a browser rather than driving a \"real\" browser, and is capable of emulating the behavior of Firefox or IE for a very large number of web applications: from simple old-fashioned pre-AJAX applications all the way to complex Web 2.0 apps.\n\nHtmlUnit's approach provides obvious benefits in areas such as ease of deployment, performance, scalability, and AJAX testing, but also has some limitations. Project committer Daniel Gredler will provide a detailed overview of the library, explain how to get the most out of the HtmlUnit approach, and show why in many cases it is far more efficient than working with a \"real\" browser to ensure the quality of your web app.\n\nThe intended audience of the session are Java (or other JVM language) developers who need to write top-to-bottom integration tests for their web applications.\n\nAttendees will learn about:\n\n- The two approaches to web app integration testing: browser simulation vs browser driving\n- The cons of the browser simulation approach\n- The pros of the browser simulation approach\n- Key extension points provided by HtmlUnit\n- Wrappers which allow you to hedge your bets and switch between the two approaches","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Daniel Gredler-HtmlUnit.pdf","speakers":[{"createdDate":null,"version":1,"id":1017,"updatedDate":null,"bio":"Daniel Gredler is a development lead at DHL Global Mail, where he focuses on custom shipping solutions. He is a committer to the HtmlUnit and Apache Tapestry projects, and has contributed to a number of other open source projects. In his free time, Daniel enjoys reading, metal detecting, and writing conference bios about himself.","firstName":"Daniel","lastName":"Gredler","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"HtmlUnit: An Efficient Approach to Testing Web Applications","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1107,"updatedDate":1411659466006,"audioLink":"","description":"JSR-299: Contexts and Dependency Injection for Java EE is an elegant set of new services for Java that draws upon ideas from JBoss Seam and Google Guice. While many of the features provided (dependency injection, contextual lifecycle, configuration, interception, event notification) are familiar, the innovative use of meta-annotations is uniquely expressive and typesafe.\n\nSeam is a powerful open source development platform for building rich Internet applications in Java. Seam is built on a JSR-299: Contexts and Dependency Injection for Java EE core (provided by Weld in JBoss Application Server), which integrates with Java EE technologies like JavaServer Faces (JSF) and Enterprise Java Beans (EJB 3.0). Seam integrates technologies such as Java Persistence (JPA), Business Process Management (BPM), Rules (Drools), Wicket, PDF and Excel reporting, Security and email into a unified full-stack solution, complete with sophisticated tooling.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Dan Allen-cdi-weld-future-of-seam.pdf","speakers":[{"createdDate":null,"version":2,"id":1012,"updatedDate":1419196225558,"bio":"Dan is an open source advocate, community catalyst, developer, published author (Seam in Action) and internationally recognized speaker. He is the lead of the Asciidoctor project (asciidoctor.org), serves as the strategic advisor for Arquillian (arquillian.org) and helps promote the JVM as a polyglot Java Champion. \r\n\r\nAs one of the founders of OpenDevise, Dan works with software communities and businesses to help them discover and cultivate their open source way. (Is there any other way?)\r\n\r\nAfter a long conference day, you'll likely find Dan enjoying chatting about tech, docs and open source with fellow community members over a Trappist beer or Kentucky Bourbon.","firstName":"Dan","lastName":"Allen","twitterId":"mojavelinux","googlePlusId":"114112334290393746697","linkedInId":"mojavelinux","lanyrdId":"mojavelinux","githubId":"mojavelinux"}],"title":"JSR-299 (CDI), Weld and the future of Seam","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1109,"updatedDate":1411659465714,"audioLink":"","description":"Java is ambitious in a few ways, but mostly it has been developed as one very practical decision after another. Scala rounds off the rough edges of Java by injecting it with many ideas from other languages, and it adds a few new features such as pattern matching that simplify your code further. I will describe the language and show a variety of ways it makes your code shorter and more to the point.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Lex Spoon-Scala: Running on the JVM with Less Boilerplate.pdf","speakers":[{"createdDate":null,"version":1,"id":1010,"updatedDate":null,"bio":"Dr. Alexander Spoon has been involved in the development of a wide variety of programming language research projects, ranging from dynamic languages like Scheme and Squeak to statically typed languages like Scala. He currently works on the compiler of the Google Web Toolkit, which converts Java code to JavaScript for running in web browsers. He previously worked two years as a post-doc at EPFL on Scala. ","firstName":"Lex","lastName":"Spoon","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Scala: Running on the JVM with Less Boilerplate","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1088,"updatedDate":1411659465423,"audioLink":"","description":"RIAs are certainly changing the way we build software. User experience is now central to building great software. How does this impact our Agile methodologies? How do we implement Agile when working with designers? What testing and development tools exist to aid us in implementing Agile in RIAs? This session will use live coding and demos to show how Agile is being used to build Flex RIAs.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-James Ward-Agile_Flex.pdf","speakers":[{"createdDate":null,"version":4,"id":1000,"updatedDate":null,"bio":"James Ward (http://www.jamesward.com) works for Typesafe where he teaches developers the Typesafe Stack (Play Framework, Scala, and Akka). James frequently presents at conferences around the world such as JavaOne, Devoxx, and many other Java get-togethers. Along with Bruce Eckel, James co-authored First Steps in Flex. He has also published numerous screencasts, blogs, and technical articles. Starting with Pascal and Assembly in the 80′s, James found his passion for writing code. Beginning in the 90′s he began doing web development with HTML, Perl/CGI, then Java. After building a Flex and Java based customer service portal in 2004 for Pillar Data Systems he became a Technical Evangelist for Flex at Adobe. In 2011 James became a Principal Developer Evangelist at Salesforce.com where he taught developers how to deploy apps on the cloud with Heroku. James Tweets as @_JamesWard and posts code at http://github.com/jamesward.","firstName":"James","lastName":"Ward","twitterId":"_JamesWard","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"An Agile Toolchain for Flex RIAs","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1106,"updatedDate":1411659465755,"audioLink":"","description":"The Java EE 6 platform is an extreme makeover from the previous versions. It is developed as JSR 316 under the Java Community Process.\n\nThe Java EE 6 platform adds more power to the platform and yet make it more flexible so that it can be adopted to different flavors of an application. It breaks the \"one size fits all\" approach with Profiles and improves on the Java EE 5 developer productivity features. It enables extensibility by embracing open source libraries and frameworks such that they are treated as first class citizens of the platform.\n\nSeveral new specifications such as Java Server Faces 2.0, Servlet 3.0, Java Persistence API 2.0, and Context and Dependency Injection 1.0 are included in the platform. All these specifications are implemented in GlassFish v3 that provides a light-weight, modular, and extensible platform for your Web applications.\n\nThis session provides an overview of Java EE 6 and its Reference Implementation - GlassFish v3. Using multiple simple-to-understand samples it explains the value proposition provided by Java EE 6.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Arun Gupta-Java EE 6 and GlassFish v3.pdf","speakers":[{"createdDate":null,"version":1,"id":1025,"updatedDate":null,"bio":"Arun Gupta is a GlassFish Evangelist working at Sun Microsystems. He has over 13 years of experience in the software industry working in various technologies, Java(TM) platform, and several web-related technologies. In his current role, he works very closely to create and foster the community around GlassFish. He has participated in several standard bodies and worked amicably with members from other companies. He has been with the Java EE team since it’s inception and contributed to all Java EE releases. He is a prolific blogger at http://blogs.sun.com/arungupta. This blog has over 1000 blog entries with frequent visitors from all over the world reaching up to 25,000 hits/day.","firstName":"Arun","lastName":"Gupta","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Java EE 6 & GlassFish v3: Paving the Path for Future","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1096,"updatedDate":1411659465889,"audioLink":"","description":"There are numerous resources available that cover the topic of software development process and project management. There are numerous resources available that cover tools, frameworks, libraries, containers, application servers, languages, databases and so on. There are numerous resources available that cover software architecture. There are numerous resources that cover software quality assurance and testing. There are numerous resources that cover team structure, organization and work environment.\n\nThe truth is, all of these topics have an impact on whether we are ultimately successful in getting the job done. This talk aims to touch all of these topics by providing an honest retrospective into how we developed and bought a brand new product to market.\n\nWe will cover the trade-offs, the challenges, the mistakes, the process, the tools, the frameworks, the regrets, the work environment and the team organization. You will learn that there are many choices to be made during the course of a software development project. You will learn about the choices we made – and you will learn that just because the choices worked for us doesn’t necessarily mean they will work for you. The goal is for you to find this useful material – whether you are building a corporate IT system, or if you are building a new software product or service regardless of whether you are developer, a product manager, an architect, a test engineer or a project manager.","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1013,"updatedDate":1389131486395,"bio":"Jason is a software guy living in Atlanta, GA. He's been slinging code since the age of 12 and would dearly love to be slinging code until he finally pops his clogs. He's worked at startups, airlines, telcos and software companies big and small. He's currently Director of Engineering at Lancope - a fast growing network security company that helps enterprises protect what is important from advanced cyber threats. ","firstName":"Jason","lastName":"Chambers","twitterId":"jasondchambers","googlePlusId":"","linkedInId":"jasondchambers","lanyrdId":"","githubId":""}],"title":"From whiteboard to product launch","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1098,"updatedDate":1411659465683,"audioLink":"","description":"Grails is the ultimate Java rapid application development environment (RAD). Using the lightweight but powerful Groovy language sitting on top of the JVM, you can put together a complete application in a fraction of time as \"normal\" web-app development. This introductory session to Grails will cover the new Grails 1.2 release using lots of\ncode examples. We'll use The new Eclipse-Groovy/Grails plugin to create a complete app during the session. We'll also use some of the *hundreds* of plugins available for Grails. These plugins offer\neasy-to-use features such as rich internet, security, clustering, etc.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Pratik Patel-Get RAD with Grails.pdf","speakers":[{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"}],"title":"Get RAD with Grails","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1094,"updatedDate":1411659465691,"audioLink":"","description":"Java is a well established language, that has been around for more than a decade. Yet, programming on it has its challenges. There are concepts and\nfeatures that are tricky. When you run into those, the compiler is not there to help you. In this presentation we will look at various concepts that you will use in\ngeneral programming with Java. We will discuss the issues with those and how you can improve your code. We will look at concepts you can do better and\nthose you should outright avoid.","presentationLink":"http://www.devnexus.com/static/2010/slides/DevNexus2010-Venkat Subramaniam-Effective_Java.zip","speakers":[{"createdDate":null,"version":7,"id":1009,"updatedDate":1418596246756,"bio":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats@agiledeveloper.com or on twitter at @venkat_s.","firstName":"Venkat","lastName":"Subramaniam","twitterId":"venkat_s","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Effective Java","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1092,"updatedDate":1411659465644,"audioLink":"","description":"This session picks up where part I left off by adding an integration layer to the application.\nThis integration layer will allow the application to connect to other systems, as well as push messages to clients asynchronously.\nSecuring the web application will also be addressed, and you'll learn how to support multiple client types such as Flash (Flex) and .NET.\nAttendees will complete the session with a broad understanding of using Spring to solve enterprise integration problems.\n\nTopics covered:\nSpring Integration, Spring BlazeDS Integration (Flex), Ajax Polling/Comet, Object-To-XML Mapping (OXM), Common Enterprise Integration Patterns, best-of-breed development tools","presentationLink":"","speakers":[{"createdDate":null,"version":1,"id":1016,"updatedDate":null,"bio":"Keith Donald is a principal and founding partner at SpringSource, the company behind Spring and a division of VMware. At SpringSource, Keith is a full-time member of the Spring development team focusing on web application development productivity. He is also the architect behind SpringSource's state-of-the-art training curriculum, which has provided practical Spring training to over 10,000 students worldwide. Over his career, Keith, an experienced enterprise software developer and mentor, has built business applications for customers spanning a diverse set of industries including banking, network management, information assurance, education, retail, and healthcare. He is particularly skilled at translating business requirements into technical solutions.","firstName":"Keith","lastName":"Donald","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Developing Web Applications with Spring, Part II","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]}],"speakers":[{"createdDate":null,"version":1,"id":1018,"updatedDate":null,"bio":"Since starting at Georgia Tech in 1996, Chris Ramsdale has lived and worked in the Atlanta area for the past 13 years. Working in the mobile space with local companies such as Motorola, AppForge, and Air2Web, Chris has held positions as a Software Engineer, Tech Lead, and Product Manager. His current endeavor is working within Google's Developer Relations team to help educate and advocate Google Web Toolkit.","firstName":"Chris ","lastName":"Ramsdale","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1008,"updatedDate":null,"bio":"Rick Thomas, is an entrepreneur focused on the strategic design of cooperative work. His goal is \"better language\" from a fundamental perspective as well as in new media practice. In the 1980’s Mr. Thomas was a software engineer and manager on projects including avionics testing and manufacturing automation. His special interest in tools for project management led him to attend the ACM conference on Computer Supported Cooperative Work (CSCW) in 1986. In 1987 he was program chairman for the IEEE Conference on Engineering Management, which emphasized the CSCW theme. In the 1990’s Mr. Thomas applied these ideas by developing collaboration software for project and sales organizations, and later for interactive video language learning and other multimedia projects. In the 2000’s his work has been to explore the design possibilities at the intersection of three fields: 1) the natural history of language, its biology and its future, 2) applied language for management and decision making, and 3) modern media for language including internet culture, standards and applications. He is a Management Advisor to Evenview, which develops and places creative teams, and has developed a course in Managerial Decision Making at the College of Business at Georgia State University. He is active in the Atlanta technical community where he presents on Google Wave as a platform for innovation. Education: MSEE 1976, BSEE 1975, Georgia Institute of Technology. MBA 1979, Georgia State University.","firstName":"Rick","lastName":"Thomas","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":7,"id":1009,"updatedDate":1418596246756,"bio":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats@agiledeveloper.com or on twitter at @venkat_s.","firstName":"Venkat","lastName":"Subramaniam","twitterId":"venkat_s","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""},{"createdDate":null,"version":1,"id":1016,"updatedDate":null,"bio":"Keith Donald is a principal and founding partner at SpringSource, the company behind Spring and a division of VMware. At SpringSource, Keith is a full-time member of the Spring development team focusing on web application development productivity. He is also the architect behind SpringSource's state-of-the-art training curriculum, which has provided practical Spring training to over 10,000 students worldwide. Over his career, Keith, an experienced enterprise software developer and mentor, has built business applications for customers spanning a diverse set of industries including banking, network management, information assurance, education, retail, and healthcare. He is particularly skilled at translating business requirements into technical solutions.","firstName":"Keith","lastName":"Donald","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":5,"id":1022,"updatedDate":1419200564909,"bio":"Burk is a long-time programmer and software architect, with experience in multiple languages. He has presented technical topics at AJUG meetings, JavaOne, DevNexus, and the Atlanta IT Architect Regional Conference for several years. In 2010, he was voted a JavaOne Rock Star for his talk on User Experience Anti-Patterns titled \"No More Loser Experiences\". Burk wrote two articles for the O'Reilly book \"97 Things Every Software Architect Should Know\", and another two for \"97 Things Every Programmer Should Know\". He has also contributed to books like the \"SCJP for Java 6 Study Guide\", and \"Head First Software Development\", as a technical reviewer.","firstName":"Burk","lastName":"Hufnagel","twitterId":"@BurkHufnagel","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""},{"createdDate":null,"version":1,"id":1017,"updatedDate":null,"bio":"Daniel Gredler is a development lead at DHL Global Mail, where he focuses on custom shipping solutions. He is a committer to the HtmlUnit and Apache Tapestry projects, and has contributed to a number of other open source projects. In his free time, Daniel enjoys reading, metal detecting, and writing conference bios about himself.","firstName":"Daniel","lastName":"Gredler","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":2,"id":1023,"updatedDate":null,"bio":"Barry has played various roles in his 17 years in the software industry, including lone developer, team lead, director, and Agile coach and mentor. Barry is one of the few native Atlantans, currently specializing in coaching and mentoring for Agile software development in addition to doing contract software development. Over the years, he has developed on multiple platforms, focusing primarily on Microsoft technologies and then Java from 2003 onward. He views technology as a set of tools, and embraces the use of dynamic as well as statically-typed languages, procedural, object-oriented, and functional programming, each having their own strengths in a given problem domain.\r\n\r\nPrior to his career in software, Barry Hawkins spent 10 years designing, selling, and delivering turn-key industrial packaging and marking systems into manufacturing plants throughout the southeastern United States. He was responsible for the implementation, maintenance, and support of every system he sold, which was a formative experience that continues to influence his approach to consulting and coaching.","firstName":"Barry","lastName":"Hawkins","twitterId":"barryhawkins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1020,"updatedDate":null,"bio":"Edwin Marcial is a Senior Vice President and the Chief Technology Officer for the Intercontinental Exchange (ICE). Mr. Marcial has over 17 years of experience in the technology industry architecting and developing software systems. His experiences include 4 years working with Harris Energy Control Systems division where he was part of a team developing state-of-the-art distributed energy management systems. He joined Continental Power Exchange (CPEX) in 1996 and in 1998 his technical vision led to the design of an Internet based distributed commodity trading system that would evolve to become the ICE trading platform. In 2000, CPEX became the Intercontinental Exchange (ICE) and the ICE Trading System was launched. Today Mr. Marcial leads a team of very talented technologists as they continue to enhance the ICE’s core trading, clearing and data systems and build new applications for the advancement of the Intercontinental Exchange. In 2007, Mr. Marcial was named the Georgia Corporate CIO of the Year, and in 2009 he was named as one of InfoWorld’s top 25 CTOs. Mr. Marcial holds a Bachelor’s Degree in Computer Science from the University of Florida’s College of Engineering. ","firstName":"Edwin","lastName":"Marcial","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"},{"createdDate":null,"version":4,"id":1014,"updatedDate":null,"bio":"David Chandler works with the Google Developer Tools Team in Atlanta. An electrical engineer by training, Chandler got hooked on developing database Web applications in the days of NCSA Mosaic and has since written Web applications in a variety of languages, including C, perl, ksh, ColdFusion, Java, JSF, GWT, and now Dart. Prior to joining Google, Chandler worked on Internet banking applications with Intuit and launched a non-profit startup built with GWT and AppEngine. Chandler holds a patent on a method of organizing hierarchical data in a relational database and blogs about Java Web development at http://turbomanage.wordpress.com.","firstName":"David","lastName":"Chandler","twitterId":"drfibonacci","googlePlusId":"102717421433762219474","linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":2,"id":1012,"updatedDate":1419196225558,"bio":"Dan is an open source advocate, community catalyst, developer, published author (Seam in Action) and internationally recognized speaker. He is the lead of the Asciidoctor project (asciidoctor.org), serves as the strategic advisor for Arquillian (arquillian.org) and helps promote the JVM as a polyglot Java Champion. \r\n\r\nAs one of the founders of OpenDevise, Dan works with software communities and businesses to help them discover and cultivate their open source way. (Is there any other way?)\r\n\r\nAfter a long conference day, you'll likely find Dan enjoying chatting about tech, docs and open source with fellow community members over a Trappist beer or Kentucky Bourbon.","firstName":"Dan","lastName":"Allen","twitterId":"mojavelinux","googlePlusId":"114112334290393746697","linkedInId":"mojavelinux","lanyrdId":"mojavelinux","githubId":"mojavelinux"},{"createdDate":null,"version":2,"id":1013,"updatedDate":1389131486395,"bio":"Jason is a software guy living in Atlanta, GA. He's been slinging code since the age of 12 and would dearly love to be slinging code until he finally pops his clogs. He's worked at startups, airlines, telcos and software companies big and small. He's currently Director of Engineering at Lancope - a fast growing network security company that helps enterprises protect what is important from advanced cyber threats. ","firstName":"Jason","lastName":"Chambers","twitterId":"jasondchambers","googlePlusId":"","linkedInId":"jasondchambers","lanyrdId":"","githubId":""},{"createdDate":null,"version":2,"id":1015,"updatedDate":null,"bio":"Charlie Collins is the Director of Technology at MOVL; an experienced java, mobile, and web developer; a contributor to several open source projects; and coauthor of Android in Practice, Unlocking Android, and GWT in Practice.","firstName":"Charlie","lastName":"Collins","twitterId":"CharlieCollins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":4,"id":1000,"updatedDate":null,"bio":"James Ward (http://www.jamesward.com) works for Typesafe where he teaches developers the Typesafe Stack (Play Framework, Scala, and Akka). James frequently presents at conferences around the world such as JavaOne, Devoxx, and many other Java get-togethers. Along with Bruce Eckel, James co-authored First Steps in Flex. He has also published numerous screencasts, blogs, and technical articles. Starting with Pascal and Assembly in the 80′s, James found his passion for writing code. Beginning in the 90′s he began doing web development with HTML, Perl/CGI, then Java. After building a Flex and Java based customer service portal in 2004 for Pillar Data Systems he became a Technical Evangelist for Flex at Adobe. In 2011 James became a Principal Developer Evangelist at Salesforce.com where he taught developers how to deploy apps on the cloud with Heroku. James Tweets as @_JamesWard and posts code at http://github.com/jamesward.","firstName":"James","lastName":"Ward","twitterId":"_JamesWard","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1010,"updatedDate":null,"bio":"Dr. Alexander Spoon has been involved in the development of a wide variety of programming language research projects, ranging from dynamic languages like Scheme and Squeak to statically typed languages like Scala. He currently works on the compiler of the Google Web Toolkit, which converts Java code to JavaScript for running in web browsers. He previously worked two years as a post-doc at EPFL on Scala. ","firstName":"Lex","lastName":"Spoon","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1007,"updatedDate":null,"bio":"Jason van Zyl is the Founder and CTO of Sonatype, the leader in Java development infrastructure whose customers include Intuit, Cisco, Qualcomm, Vanguard and E*Trade. Jason has over 10 years of experience in open source and proprietary enterprise software development. An open source enthusiast, Jason is the founder of the Apache Maven project, and the original benefactor of the Nexus and M2Eclipse projects. Jason currently serves as Chair of the Apache Maven Project Management Committee. He has been involved with the Apache Software Foundation (ASF) for seven years, helped to found Codehaus, a well respected incubation facility for open source community projects, and is a frequent speaker at many major software conferences, including JavaOne, EclipseCon, EmergingTech, and ApacheCon.","firstName":"Jason","lastName":"van Zyl","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":2,"id":1005,"updatedDate":null,"bio":"Greg founded Ehcache in 2003. He regularly speaks at conferences, writes and codes. He has also founded and maintains the JPam and Spnego open source projects, which are security focused. Prior to joining Terracotta in 2009, Greg was Chief Architect at Wotif.com where he provided technical leadership as the company went from a single product startup to a billion dollar public company with multiple product lines. Before that Greg was a consultant for ThoughtWorks with engagements in the US and Australia in the travel, health care, geospatial, banking and insurance industries. Before doing programming, Greg managed IT. He was CIO at Virgin Blue, Tempo Services, Stamford Hotels and Resorts and Australian Resorts. He is a Chartered Accountant, and spent 7 years with KPMG in small business and insolvency. Greg holds a Bachelor of Commerce and a Masters in Information Technology.","firstName":"Greg","lastName":"Luck","twitterId":"gregrluck","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1011,"updatedDate":null,"bio":"Toby Reyelts is a software engineer at Google who specializes in the JVM. He is a co-creator of App Engine for Java and a member of the Google Web Toolkit team. He has also authored open-source projects, such as the popular Retroweaver. Toby is at his happiest when he can make things both simple and fast. ","firstName":"Toby","lastName":"Reyelts","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":4,"id":1024,"updatedDate":null,"bio":"Wesley Hales is a User Interface architect from Atlanta, GA. He has been involved in UI and User Experience roles for over a decade in both startup and enterprise environments. Wesley co-founded several enterprise frameworks during his 4.5 years at JBoss by Red Hat (including the JBoss Portlet Bridge and AeroGear projects) and also served as a co-founder of the recently acquired startup, InstaOps. He is now employed by Apigee as a software developer mainly focused on UI.\r\n\r\nOverall, Wesley enjoys creating world-class user interfaces and experiences that people fall in love with.\r\nYou can see him speak at the occasional conference, read his posts on [wesleyhales.com](http://wesleyhales.com), or follow him on twitter @wesleyhales.","firstName":"Wesley","lastName":"Hales","twitterId":"wesleyhales","googlePlusId":"114682255328371246824","linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":3,"id":1006,"updatedDate":1417210185566,"bio":"Neal Ford is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, magazine articles, video/DVD presentations, and author and/or editor of eight books spanning a variety of subjects and technologies, including the most recent Presentation Patterns and Functional Thinking. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 300 developer conferences worldwide, delivering more than 2000 presentations. Check out his web site at nealford.com. He welcomes feedback and can be reached at nford@thoughtworks.com.\r\n","firstName":"Neal","lastName":"Ford","twitterId":"neal4d","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""},{"createdDate":null,"version":1,"id":1025,"updatedDate":null,"bio":"Arun Gupta is a GlassFish Evangelist working at Sun Microsystems. He has over 13 years of experience in the software industry working in various technologies, Java(TM) platform, and several web-related technologies. In his current role, he works very closely to create and foster the community around GlassFish. He has participated in several standard bodies and worked amicably with members from other companies. He has been with the Java EE team since it’s inception and contributed to all Java EE releases. He is a prolific blogger at http://blogs.sun.com/arungupta. This blog has over 1000 blog entries with frequent visitors from all over the world reaching up to 25,000 hits/day.","firstName":"Arun","lastName":"Gupta","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"rooms":[],"sponsors":[]}}