{"presentationList":{"presentation":[{"createdDate":null,"version":1,"id":1076,"updatedDate":1411659465529,"audioLink":"","description":"The demand continues to grow for rich interactive content, applications, and services that run on a variety of screens such as mobile, desktop, browser, and television. With the release of JavaFX SDK 1.1 it is possible to incorporate innovative elements of rich client applications into existing Java software with minimum effort enabling consistent user experiences across multiple screens such as desktop, browser and mobile devices. Sun is bringing its JavaFX development framework to mobile devices. JavaFX includes a scene graph library and a unique scripting language that provides a declarative syntax for constructing sophisticated graphical user interfaces. Its graphics capabilities include support for animation, visual effects, gradients, and translucency. The latest release of the JavaFX SDK, version 1.1, offers full support for mobile JavaFX development and includes an emulator for testing mobile device compatibility.\n\nThis keynote provides a glimpse into cross-screen applications development using JavaFX libraries such as animation and media applications with cross-platform audio and video. Additionally, this session will illuminate the JavaFX SDK 1.1 that provides a suite of tools for web scripters, designers and application developers.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1064,"updatedDate":1417233323609,"bio":"Dr. Doris Chen\r\nhttp://blogs.msdn.com/b/dorischen/\r\nTwitter @doristchen\r\n\r\nDoris is a Senior Technology Evangelist at Microsoft for the Western region of the United States, specialized in web technologies (HTML5, jQuery, JavaScript, Ajax, and Java).  \r\nDoris has over 18 years of experience in the software industry working in several open source web tier technologies, Java platform, .NET and distributed computing technologies. She has developed and delivered over 400 keynotes, technical sessions, code camps worldwide, published widely at numerous international conferences and user groups including O’Reilly OSCON, Fluent, HTML5 Dev Conference, JSEverywhere, WebVisions, JavaOne, SD Forum, HTML5 and JavaScript meetups, and worldwide User Groups. Doris works very closely to create and foster the open source community around Java, NetBeans, Glassfish, and related technologies. Before joining Microsoft, Doris Chen was a Technology Evangelist at Sun Microsystems.\r\nDoris received her Ph.D. from the University of California at Los Angeles (UCLA) in computer engineering, specializing in medical informatics. ","firstName":"Doris","lastName":"Chen","twitterId":"@doristchen","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"JavaFX: The Platform for Rich Internet Applications","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1078,"updatedDate":1411659465548,"audioLink":"","description":"In the past 8 years, the Java EE platform has grown and matured, and is now able to cover a wide range of enterprise and web application development needs. It has fostered a vibrant community and marketplace for additional technologies, frameworks, and applications that work with the platform. Java EE 6 carries on the push for ease of development started in Java EE 5, by extending it to include the web tier, for example by including the new API for RESTful web services, JAX-RS. The major themes for Java EE 6 are to offer more flexibility at development and deployment time, and to make it simpler to build on the many third-party libraries created by the community. To that end we propose several goals for this release - extensibility, pruning, profiles and ease of development.\n\nIn this talk we'll provide an introduction to the Java Platform Enterprise Edition (Java EE) 6. First we'll focus on the high-level ideas that drove this release of the platform. Then we'll move into the detailed contents, highlighting the most innovative concepts, starting with profiles and moving down into the many exciting new features of the component JSRs.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1064,"updatedDate":1417233323609,"bio":"Dr. Doris Chen\r\nhttp://blogs.msdn.com/b/dorischen/\r\nTwitter @doristchen\r\n\r\nDoris is a Senior Technology Evangelist at Microsoft for the Western region of the United States, specialized in web technologies (HTML5, jQuery, JavaScript, Ajax, and Java).  \r\nDoris has over 18 years of experience in the software industry working in several open source web tier technologies, Java platform, .NET and distributed computing technologies. She has developed and delivered over 400 keynotes, technical sessions, code camps worldwide, published widely at numerous international conferences and user groups including O’Reilly OSCON, Fluent, HTML5 Dev Conference, JSEverywhere, WebVisions, JavaOne, SD Forum, HTML5 and JavaScript meetups, and worldwide User Groups. Doris works very closely to create and foster the open source community around Java, NetBeans, Glassfish, and related technologies. Before joining Microsoft, Doris Chen was a Technology Evangelist at Sun Microsystems.\r\nDoris received her Ph.D. from the University of California at Los Angeles (UCLA) in computer engineering, specializing in medical informatics. ","firstName":"Doris","lastName":"Chen","twitterId":"@doristchen","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Java EE 6 Overview","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1080,"updatedDate":1411659465579,"audioLink":"","description":"During this presentation, we'll walk through the highly automated process of creation of RIA using Eclipse plugins. The first plugin will generate a CRUD application having Adobe Flex talking to POJO on the server, which in turn communicates with a DBMS. Then, another plugin will generate an ANT build script for this application. The third plugin will add logging capabilities for Flex/Java rich Internet applications.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1070,"updatedDate":1389068263806,"bio":"Yakov Fain is Java Champion and a co-founder of two software companies: Farata Systems and SuranceBay. He authored several technical books and lots of articles on software development. He leads Princeton Java Users Group. Recently Yakov co-authored the book \"Enterprise Web Development\" (O'Reilly). Two of his books will be published this year: \"Java For Kids\" (No Starch Press) and the second edition of \"Java 24-Hour Trainer\" (Wrox).","firstName":"Yakov","lastName":"Fain","twitterId":"yfain","googlePlusId":"116033097136007429330","linkedInId":"yfain","lanyrdId":"","githubId":"yfain"}],"title":"Automatic generation of Flex/Java CRUD applications","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1081,"updatedDate":1411659465586,"audioLink":"","description":"When you were hired by your current employer, you may think it's because of your winning personality, your dazzling smile, or your encyclopedic knowledge of [insert technology here]. But it's not. You were hired for your ability to sit and concentrate for long periods of time to solve problems, then placed in an environment where it's utterly impossible to do that! Who decides that, despite overwhelming evidence that it's bad for productivity and people hate it, that you must sit in a cubicle? The furniture police! This keynote describes the frustrations of modern knowledge workers in their quest to actually get some work done, and solutions for how to gird yourself against all those distractions. I talk about environments, coding, acceleration, automation, and avoiding repetition as ways to defeat the mid-guided attempts to sap your ability to produce good work. And I give you ways to go on the lam from the furniture police and ammunition to fight back!","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1006,"updatedDate":1417210185566,"bio":"Neal Ford is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, magazine articles, video/DVD presentations, and author and/or editor of eight books spanning a variety of subjects and technologies, including the most recent Presentation Patterns and Functional Thinking. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 300 developer conferences worldwide, delivering more than 2000 presentations. Check out his web site at nealford.com. He welcomes feedback and can be reached at nford@thoughtworks.com.\r\n","firstName":"Neal","lastName":"Ford","twitterId":"neal4d","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"On the Lam from the Furniture Police","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1082,"updatedDate":1411659465591,"audioLink":"","description":"Most developers thing that Test-driven development (TDD) is about testing, but testing is only a small benefit from using TDD techniques. This session demonstrates how stringent TDD improves the structure of your code. I discuss TDD as a technique for vetting consumer calls, using mock objects to understand complex interactions between collaborators, and some discussions of improved code metrics yielded by TDD. This session shows that TDD is much more than testing: it fundamentally makes your code better at multiple levels.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1006,"updatedDate":1417210185566,"bio":"Neal Ford is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, magazine articles, video/DVD presentations, and author and/or editor of eight books spanning a variety of subjects and technologies, including the most recent Presentation Patterns and Functional Thinking. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 300 developer conferences worldwide, delivering more than 2000 presentations. Check out his web site at nealford.com. He welcomes feedback and can be reached at nford@thoughtworks.com.\r\n","firstName":"Neal","lastName":"Ford","twitterId":"neal4d","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Test-Driven Design","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1083,"updatedDate":1411659465602,"audioLink":"","description":"We're always under pressure to do more with less. More features with less developers. More product in less time. More work in fewer hours. There are several Agile techniques you can use to ensure you and your team and making the most of your days. We'll review several team optimization techniques and discuss their practical applications.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1074,"updatedDate":1388501050468,"bio":"Principal consultant and a member of the core team at Agile Artisans, Jared Richardson works with other software craftsmen to build excellent custom software. He sold his first software program in 1991 and has been immersed in software ever since. He balances his time between coaching Agile teams and creating great software. Jared has authored and coauthored a number of books, including the best selling Ship It! A Practical Guide to Successful Software Projects and Career 2.0: Take Control of Your Life. He is a frequent speaker at software conferences and a thought leader in agile. Jared lives with his wife and children in North Carolina where they recently, quite by accident, became backyard chicken farmers. He's on the web at AgileArtisans.com.","firstName":"Jared","lastName":"Richardson","twitterId":"jaredrichardson","googlePlusId":"","linkedInId":"jaredrr","lanyrdId":"","githubId":""}],"title":"Software Teams Tuneup: Using Agile to Optimize","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1085,"updatedDate":1411659465621,"audioLink":"","description":"As with many technologies, the basics are easy. The hard part comes when the developer needs to do sophisticated integration, development, and testing as part of an enterprise application. A large enterprise application requires the developer to think of issues that affect the development, scalability and robustness of the application. This presentation will cover the advanced topics described below.\n\nA large enterprise application often will have several sub-projects that each contain their own JPA persistence unit. This opens up a number of questions around how to organize the persistence units and how the code between sub-projects should interoperate. Developers will gain insight into these issues and will see a couple of solutions using live code examples.","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"}],"title":"Enterprise JPA & Spring 2.5 - Tips and Tricks for JEE5 Persistence","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1086,"updatedDate":1411659465626,"audioLink":"","description":"Dynamic languages running on the Java Virtual Machine are starting to gain traction for software development, specifically for large enterprise projects. This session explores obstacles to introducing dynamic languages into the enterprise, example applications that can ease the way, and issues surrounding integrating a dynamic language to Java projects. Using several code examples that demonstrate the power of using a dynamic language like Jruby or Groovy, attendees will gain insight into how dynamic languages are making in-roads to the enterprise. This session focuses on non-GUI related usages – whereas most people think of dynamic languages for Web development. The target audience for this session is enterprise developers and enterprise architects.\n\n    * How to incrementally introduce dynamic languages into an existing project\n    * Real world examples of using dynamic languages for better testing and writing utilities\n    * Understanding how to integrate a dynamic language into a Java-based project","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"}],"title":"Dynamic JVM Languages in the Enterprise","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1084,"updatedDate":1411659465614,"audioLink":"","description":"Along with databases for structured content, content repositories emerged to tailor to content management needs. The content repository has rich metaphors for modeling content metadata, relationships between data, and behaviors that contents needs have. It also adds higher level concepts like workflow, security mechanisms, ability to automatically transform between formats, and many other features. In this talk we will examine the advantages of using a content management repository for storing content and how it enables rapid development of certain types of applications. This core technology can be exposed through SOAP or RESTful Services to play a role in your SOA strategy. With several open standards emerging in this area (newest one, CMIS has the promise of becoming the SQL for Content Repositories), the content repository paradigm has emerged as a standard part of any SOA strategy. Alfresco, an open source enterprise content repository framework, will be used as an example of this paradigm. What you will learn:\n\n    * Take a look at Content Repository Abstraction\n    * Define Content-As-A-Service (CaaS) architecture\n    * Understand the reusable services that content repositories provide\n    * Look at emerging interoperability standards in this area","presentationLink":"","speakers":[{"createdDate":null,"version":1,"id":1067,"updatedDate":null,"bio":"Jean Barmash is the Director of Technical Services at Alfresco Software, the Open Source Enterprise Content Management Company. His responsibilities include architecture and hands-on development of content centric solutions, training, and working with open source and Alfresco partner community. Jean brings a wealth of experience in different areas of technology creation. Most recently, he worked as Sr. Consultant and Trainer at several Wall Street Firms. Well-versed in both .NET and Java, he is interested in the innovation going on in Web 2.0 and bringing it into the Enterprise. He is a frequent speaker on technology and architecture topics at user groups and industry conferences. ","firstName":"Jean","lastName":"Barmash","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Content Repository - Databases for Content","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1077,"updatedDate":1411659465536,"audioLink":"","description":"JavaFX Script is a compiled, declarative scripting language that runs on the desktop, in the web browser and on mobile devices. JavaFX includes a scene graph library and a unique scripting language that provides a declarative syntax for constructing sophisticated graphical user interfaces. Its graphics capabilities include support for animation, visual effects, gradients, and translucency. This jam-packed talk will detail JavaFX from cover to cover. This session will cover:\n\n    * An introduction to the JavaFX Script language\n    * A tour of the core APIs including graphics, animations, and media\n    * How to access RESTFUL Web Services\n    * Developing and deploying to different target profiles (desktop, web, mobile)\n    * Java Runtime Environment 6 Update 10+:this new version of the Java Runtime Environment (JRE) provides a redesigned Java browser plug-in that allows drag and drop of JavaFX applications from the browser to the desktop.\n    * Futures and roadmap for JavaFX\n\n***Come expecting to see lots of code*** After attending this session, attendees will walk away with a good understanding of JavaFX language and how to develop special effects in GUI and 2D Graphics and add special features as audio, video and animation into their applications.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1064,"updatedDate":1417233323609,"bio":"Dr. Doris Chen\r\nhttp://blogs.msdn.com/b/dorischen/\r\nTwitter @doristchen\r\n\r\nDoris is a Senior Technology Evangelist at Microsoft for the Western region of the United States, specialized in web technologies (HTML5, jQuery, JavaScript, Ajax, and Java).  \r\nDoris has over 18 years of experience in the software industry working in several open source web tier technologies, Java platform, .NET and distributed computing technologies. She has developed and delivered over 400 keynotes, technical sessions, code camps worldwide, published widely at numerous international conferences and user groups including O’Reilly OSCON, Fluent, HTML5 Dev Conference, JSEverywhere, WebVisions, JavaOne, SD Forum, HTML5 and JavaScript meetups, and worldwide User Groups. Doris works very closely to create and foster the open source community around Java, NetBeans, Glassfish, and related technologies. Before joining Microsoft, Doris Chen was a Technology Evangelist at Sun Microsystems.\r\nDoris received her Ph.D. from the University of California at Los Angeles (UCLA) in computer engineering, specializing in medical informatics. ","firstName":"Doris","lastName":"Chen","twitterId":"@doristchen","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Develop Rich Internet Applications (RIA) using JavaFX","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1079,"updatedDate":1411659465574,"audioLink":"","description":"We are entering an era of Rich Internet Applications (RIA) and enhancing the user experience of consumers of the services becomes an important part in designing and implementing distributed applications. But if you decide to develop rich clients, you'll be facing the dilemma of which way to go: remain with tried and true Java on the client or experiment with such newcomers as AJAX, Flex, Silverlight, or recently released JavaFX? While the Internet brings a lot of noise where \"it's cool\" is the most popular definition, this presentation is an overview of what's out there on the enterprise RIA market. We'll talk about the pros and cons of using various techniques and technologies for the development of the front end for complex distributed systems.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1070,"updatedDate":1389068263806,"bio":"Yakov Fain is Java Champion and a co-founder of two software companies: Farata Systems and SuranceBay. He authored several technical books and lots of articles on software development. He leads Princeton Java Users Group. Recently Yakov co-authored the book \"Enterprise Web Development\" (O'Reilly). Two of his books will be published this year: \"Java For Kids\" (No Starch Press) and the second edition of \"Java 24-Hour Trainer\" (Wrox).","firstName":"Yakov","lastName":"Fain","twitterId":"yfain","googlePlusId":"116033097136007429330","linkedInId":"yfain","lanyrdId":"","githubId":"yfain"}],"title":"Picking the right technology for the Rich Internet Applications","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]}],"numberOfPresentations":11},"event":{"createdDate":null,"version":1,"id":1026,"updatedDate":null,"eventKey":"devnexus2009","title":"DevNexus 2009","current":false,"presentations":[{"createdDate":null,"version":1,"id":1086,"updatedDate":1411659465626,"audioLink":"","description":"Dynamic languages running on the Java Virtual Machine are starting to gain traction for software development, specifically for large enterprise projects. This session explores obstacles to introducing dynamic languages into the enterprise, example applications that can ease the way, and issues surrounding integrating a dynamic language to Java projects. Using several code examples that demonstrate the power of using a dynamic language like Jruby or Groovy, attendees will gain insight into how dynamic languages are making in-roads to the enterprise. This session focuses on non-GUI related usages – whereas most people think of dynamic languages for Web development. The target audience for this session is enterprise developers and enterprise architects.\n\n    * How to incrementally introduce dynamic languages into an existing project\n    * Real world examples of using dynamic languages for better testing and writing utilities\n    * Understanding how to integrate a dynamic language into a Java-based project","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"}],"title":"Dynamic JVM Languages in the Enterprise","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1076,"updatedDate":1411659465529,"audioLink":"","description":"The demand continues to grow for rich interactive content, applications, and services that run on a variety of screens such as mobile, desktop, browser, and television. With the release of JavaFX SDK 1.1 it is possible to incorporate innovative elements of rich client applications into existing Java software with minimum effort enabling consistent user experiences across multiple screens such as desktop, browser and mobile devices. Sun is bringing its JavaFX development framework to mobile devices. JavaFX includes a scene graph library and a unique scripting language that provides a declarative syntax for constructing sophisticated graphical user interfaces. Its graphics capabilities include support for animation, visual effects, gradients, and translucency. The latest release of the JavaFX SDK, version 1.1, offers full support for mobile JavaFX development and includes an emulator for testing mobile device compatibility.\n\nThis keynote provides a glimpse into cross-screen applications development using JavaFX libraries such as animation and media applications with cross-platform audio and video. Additionally, this session will illuminate the JavaFX SDK 1.1 that provides a suite of tools for web scripters, designers and application developers.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1064,"updatedDate":1417233323609,"bio":"Dr. Doris Chen\r\nhttp://blogs.msdn.com/b/dorischen/\r\nTwitter @doristchen\r\n\r\nDoris is a Senior Technology Evangelist at Microsoft for the Western region of the United States, specialized in web technologies (HTML5, jQuery, JavaScript, Ajax, and Java).  \r\nDoris has over 18 years of experience in the software industry working in several open source web tier technologies, Java platform, .NET and distributed computing technologies. She has developed and delivered over 400 keynotes, technical sessions, code camps worldwide, published widely at numerous international conferences and user groups including O’Reilly OSCON, Fluent, HTML5 Dev Conference, JSEverywhere, WebVisions, JavaOne, SD Forum, HTML5 and JavaScript meetups, and worldwide User Groups. Doris works very closely to create and foster the open source community around Java, NetBeans, Glassfish, and related technologies. Before joining Microsoft, Doris Chen was a Technology Evangelist at Sun Microsystems.\r\nDoris received her Ph.D. from the University of California at Los Angeles (UCLA) in computer engineering, specializing in medical informatics. ","firstName":"Doris","lastName":"Chen","twitterId":"@doristchen","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"JavaFX: The Platform for Rich Internet Applications","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1077,"updatedDate":1411659465536,"audioLink":"","description":"JavaFX Script is a compiled, declarative scripting language that runs on the desktop, in the web browser and on mobile devices. JavaFX includes a scene graph library and a unique scripting language that provides a declarative syntax for constructing sophisticated graphical user interfaces. Its graphics capabilities include support for animation, visual effects, gradients, and translucency. This jam-packed talk will detail JavaFX from cover to cover. This session will cover:\n\n    * An introduction to the JavaFX Script language\n    * A tour of the core APIs including graphics, animations, and media\n    * How to access RESTFUL Web Services\n    * Developing and deploying to different target profiles (desktop, web, mobile)\n    * Java Runtime Environment 6 Update 10+:this new version of the Java Runtime Environment (JRE) provides a redesigned Java browser plug-in that allows drag and drop of JavaFX applications from the browser to the desktop.\n    * Futures and roadmap for JavaFX\n\n***Come expecting to see lots of code*** After attending this session, attendees will walk away with a good understanding of JavaFX language and how to develop special effects in GUI and 2D Graphics and add special features as audio, video and animation into their applications.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1064,"updatedDate":1417233323609,"bio":"Dr. Doris Chen\r\nhttp://blogs.msdn.com/b/dorischen/\r\nTwitter @doristchen\r\n\r\nDoris is a Senior Technology Evangelist at Microsoft for the Western region of the United States, specialized in web technologies (HTML5, jQuery, JavaScript, Ajax, and Java).  \r\nDoris has over 18 years of experience in the software industry working in several open source web tier technologies, Java platform, .NET and distributed computing technologies. She has developed and delivered over 400 keynotes, technical sessions, code camps worldwide, published widely at numerous international conferences and user groups including O’Reilly OSCON, Fluent, HTML5 Dev Conference, JSEverywhere, WebVisions, JavaOne, SD Forum, HTML5 and JavaScript meetups, and worldwide User Groups. Doris works very closely to create and foster the open source community around Java, NetBeans, Glassfish, and related technologies. Before joining Microsoft, Doris Chen was a Technology Evangelist at Sun Microsystems.\r\nDoris received her Ph.D. from the University of California at Los Angeles (UCLA) in computer engineering, specializing in medical informatics. ","firstName":"Doris","lastName":"Chen","twitterId":"@doristchen","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Develop Rich Internet Applications (RIA) using JavaFX","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1080,"updatedDate":1411659465579,"audioLink":"","description":"During this presentation, we'll walk through the highly automated process of creation of RIA using Eclipse plugins. The first plugin will generate a CRUD application having Adobe Flex talking to POJO on the server, which in turn communicates with a DBMS. Then, another plugin will generate an ANT build script for this application. The third plugin will add logging capabilities for Flex/Java rich Internet applications.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1070,"updatedDate":1389068263806,"bio":"Yakov Fain is Java Champion and a co-founder of two software companies: Farata Systems and SuranceBay. He authored several technical books and lots of articles on software development. He leads Princeton Java Users Group. Recently Yakov co-authored the book \"Enterprise Web Development\" (O'Reilly). Two of his books will be published this year: \"Java For Kids\" (No Starch Press) and the second edition of \"Java 24-Hour Trainer\" (Wrox).","firstName":"Yakov","lastName":"Fain","twitterId":"yfain","googlePlusId":"116033097136007429330","linkedInId":"yfain","lanyrdId":"","githubId":"yfain"}],"title":"Automatic generation of Flex/Java CRUD applications","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1082,"updatedDate":1411659465591,"audioLink":"","description":"Most developers thing that Test-driven development (TDD) is about testing, but testing is only a small benefit from using TDD techniques. This session demonstrates how stringent TDD improves the structure of your code. I discuss TDD as a technique for vetting consumer calls, using mock objects to understand complex interactions between collaborators, and some discussions of improved code metrics yielded by TDD. This session shows that TDD is much more than testing: it fundamentally makes your code better at multiple levels.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1006,"updatedDate":1417210185566,"bio":"Neal Ford is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, magazine articles, video/DVD presentations, and author and/or editor of eight books spanning a variety of subjects and technologies, including the most recent Presentation Patterns and Functional Thinking. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 300 developer conferences worldwide, delivering more than 2000 presentations. Check out his web site at nealford.com. He welcomes feedback and can be reached at nford@thoughtworks.com.\r\n","firstName":"Neal","lastName":"Ford","twitterId":"neal4d","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Test-Driven Design","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1083,"updatedDate":1411659465602,"audioLink":"","description":"We're always under pressure to do more with less. More features with less developers. More product in less time. More work in fewer hours. There are several Agile techniques you can use to ensure you and your team and making the most of your days. We'll review several team optimization techniques and discuss their practical applications.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1074,"updatedDate":1388501050468,"bio":"Principal consultant and a member of the core team at Agile Artisans, Jared Richardson works with other software craftsmen to build excellent custom software. He sold his first software program in 1991 and has been immersed in software ever since. He balances his time between coaching Agile teams and creating great software. Jared has authored and coauthored a number of books, including the best selling Ship It! A Practical Guide to Successful Software Projects and Career 2.0: Take Control of Your Life. He is a frequent speaker at software conferences and a thought leader in agile. Jared lives with his wife and children in North Carolina where they recently, quite by accident, became backyard chicken farmers. He's on the web at AgileArtisans.com.","firstName":"Jared","lastName":"Richardson","twitterId":"jaredrichardson","googlePlusId":"","linkedInId":"jaredrr","lanyrdId":"","githubId":""}],"title":"Software Teams Tuneup: Using Agile to Optimize","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1081,"updatedDate":1411659465586,"audioLink":"","description":"When you were hired by your current employer, you may think it's because of your winning personality, your dazzling smile, or your encyclopedic knowledge of [insert technology here]. But it's not. You were hired for your ability to sit and concentrate for long periods of time to solve problems, then placed in an environment where it's utterly impossible to do that! Who decides that, despite overwhelming evidence that it's bad for productivity and people hate it, that you must sit in a cubicle? The furniture police! This keynote describes the frustrations of modern knowledge workers in their quest to actually get some work done, and solutions for how to gird yourself against all those distractions. I talk about environments, coding, acceleration, automation, and avoiding repetition as ways to defeat the mid-guided attempts to sap your ability to produce good work. And I give you ways to go on the lam from the furniture police and ammunition to fight back!","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1006,"updatedDate":1417210185566,"bio":"Neal Ford is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, magazine articles, video/DVD presentations, and author and/or editor of eight books spanning a variety of subjects and technologies, including the most recent Presentation Patterns and Functional Thinking. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 300 developer conferences worldwide, delivering more than 2000 presentations. Check out his web site at nealford.com. He welcomes feedback and can be reached at nford@thoughtworks.com.\r\n","firstName":"Neal","lastName":"Ford","twitterId":"neal4d","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"On the Lam from the Furniture Police","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1085,"updatedDate":1411659465621,"audioLink":"","description":"As with many technologies, the basics are easy. The hard part comes when the developer needs to do sophisticated integration, development, and testing as part of an enterprise application. A large enterprise application requires the developer to think of issues that affect the development, scalability and robustness of the application. This presentation will cover the advanced topics described below.\n\nA large enterprise application often will have several sub-projects that each contain their own JPA persistence unit. This opens up a number of questions around how to organize the persistence units and how the code between sub-projects should interoperate. Developers will gain insight into these issues and will see a couple of solutions using live code examples.","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"}],"title":"Enterprise JPA & Spring 2.5 - Tips and Tricks for JEE5 Persistence","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1079,"updatedDate":1411659465574,"audioLink":"","description":"We are entering an era of Rich Internet Applications (RIA) and enhancing the user experience of consumers of the services becomes an important part in designing and implementing distributed applications. But if you decide to develop rich clients, you'll be facing the dilemma of which way to go: remain with tried and true Java on the client or experiment with such newcomers as AJAX, Flex, Silverlight, or recently released JavaFX? While the Internet brings a lot of noise where \"it's cool\" is the most popular definition, this presentation is an overview of what's out there on the enterprise RIA market. We'll talk about the pros and cons of using various techniques and technologies for the development of the front end for complex distributed systems.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1070,"updatedDate":1389068263806,"bio":"Yakov Fain is Java Champion and a co-founder of two software companies: Farata Systems and SuranceBay. He authored several technical books and lots of articles on software development. He leads Princeton Java Users Group. Recently Yakov co-authored the book \"Enterprise Web Development\" (O'Reilly). Two of his books will be published this year: \"Java For Kids\" (No Starch Press) and the second edition of \"Java 24-Hour Trainer\" (Wrox).","firstName":"Yakov","lastName":"Fain","twitterId":"yfain","googlePlusId":"116033097136007429330","linkedInId":"yfain","lanyrdId":"","githubId":"yfain"}],"title":"Picking the right technology for the Rich Internet Applications","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1078,"updatedDate":1411659465548,"audioLink":"","description":"In the past 8 years, the Java EE platform has grown and matured, and is now able to cover a wide range of enterprise and web application development needs. It has fostered a vibrant community and marketplace for additional technologies, frameworks, and applications that work with the platform. Java EE 6 carries on the push for ease of development started in Java EE 5, by extending it to include the web tier, for example by including the new API for RESTful web services, JAX-RS. The major themes for Java EE 6 are to offer more flexibility at development and deployment time, and to make it simpler to build on the many third-party libraries created by the community. To that end we propose several goals for this release - extensibility, pruning, profiles and ease of development.\n\nIn this talk we'll provide an introduction to the Java Platform Enterprise Edition (Java EE) 6. First we'll focus on the high-level ideas that drove this release of the platform. Then we'll move into the detailed contents, highlighting the most innovative concepts, starting with profiles and moving down into the many exciting new features of the component JSRs.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1064,"updatedDate":1417233323609,"bio":"Dr. Doris Chen\r\nhttp://blogs.msdn.com/b/dorischen/\r\nTwitter @doristchen\r\n\r\nDoris is a Senior Technology Evangelist at Microsoft for the Western region of the United States, specialized in web technologies (HTML5, jQuery, JavaScript, Ajax, and Java).  \r\nDoris has over 18 years of experience in the software industry working in several open source web tier technologies, Java platform, .NET and distributed computing technologies. She has developed and delivered over 400 keynotes, technical sessions, code camps worldwide, published widely at numerous international conferences and user groups including O’Reilly OSCON, Fluent, HTML5 Dev Conference, JSEverywhere, WebVisions, JavaOne, SD Forum, HTML5 and JavaScript meetups, and worldwide User Groups. Doris works very closely to create and foster the open source community around Java, NetBeans, Glassfish, and related technologies. Before joining Microsoft, Doris Chen was a Technology Evangelist at Sun Microsystems.\r\nDoris received her Ph.D. from the University of California at Los Angeles (UCLA) in computer engineering, specializing in medical informatics. ","firstName":"Doris","lastName":"Chen","twitterId":"@doristchen","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Java EE 6 Overview","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1084,"updatedDate":1411659465614,"audioLink":"","description":"Along with databases for structured content, content repositories emerged to tailor to content management needs. The content repository has rich metaphors for modeling content metadata, relationships between data, and behaviors that contents needs have. It also adds higher level concepts like workflow, security mechanisms, ability to automatically transform between formats, and many other features. In this talk we will examine the advantages of using a content management repository for storing content and how it enables rapid development of certain types of applications. This core technology can be exposed through SOAP or RESTful Services to play a role in your SOA strategy. With several open standards emerging in this area (newest one, CMIS has the promise of becoming the SQL for Content Repositories), the content repository paradigm has emerged as a standard part of any SOA strategy. Alfresco, an open source enterprise content repository framework, will be used as an example of this paradigm. What you will learn:\n\n    * Take a look at Content Repository Abstraction\n    * Define Content-As-A-Service (CaaS) architecture\n    * Understand the reusable services that content repositories provide\n    * Look at emerging interoperability standards in this area","presentationLink":"","speakers":[{"createdDate":null,"version":1,"id":1067,"updatedDate":null,"bio":"Jean Barmash is the Director of Technical Services at Alfresco Software, the Open Source Enterprise Content Management Company. His responsibilities include architecture and hands-on development of content centric solutions, training, and working with open source and Alfresco partner community. Jean brings a wealth of experience in different areas of technology creation. Most recently, he worked as Sr. Consultant and Trainer at several Wall Street Firms. Well-versed in both .NET and Java, he is interested in the innovation going on in Web 2.0 and bringing it into the Enterprise. He is a frequent speaker on technology and architecture topics at user groups and industry conferences. ","firstName":"Jean","lastName":"Barmash","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Content Repository - Databases for Content","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]}],"speakers":[{"createdDate":null,"version":1,"id":1075,"updatedDate":null,"bio":"Ari Zilka founded Terracotta in 2003, where he currently serves as the infrastructure software company's CTO. There he's been working to refine the software that makes it easy to scale a Java application to as many computers as needed, without the usual custom application code and databases used to share data in a cluster. Prior to Terracotta, Ari was the Chief Architect at Walmart.com, where he led the innovation and development of the company's new engineering initiatives. While there, he built and led a team of core engineers focused on performance management, and operations cost-saving measures. Outside of Walmant.com, Ari's work in software development and consulting has had him working with Gap.com, Nike.com, Harrod's of London, Siemen's, Intel, Compaq, and Barnes & Noble among others.\n\nIn June 2008, Ari and the Terracotta development team celebrated the release of the first commercially-available book about the technology, \"The Definitive Guide to Terracotta: Cluster the JVM for Spring, Hibernate and POJO Scalability\". The book was written for both developers and architects who want to learn the \"whats, wheres, whens, and whys\" of the Terracotta scaling engine.\n\nAri holds a B.S. in Electrical Engineering Computer Science as well as in Mechanical Engineering from University of California, Berkeley. ","firstName":"Ari","lastName":"Zilka","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1071,"updatedDate":null,"bio":"Jeremy Haile is VP of Product Development at WeTheCitizens, an Atlanta startup, and is responsible for leading the development of the Wildfire Social Mobilization Platform. Jeremy is an experienced leader and consultant, with expertise implementing agile software methodologies and leading teams to develop high-quality software. He has focused on Java web application development using open-source technologies since 2000. He graduated from Georgia Tech in Computer Science, and is an active member of the development and startup communities in Atlanta, a founding member of the JSecurity open-source project, and a certified ScrumMaster.","firstName":"Jeremy","lastName":"Haile","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1073,"updatedDate":null,"bio":"Bruce Johnson is Tech Lead of the Google Web Toolkit (GWT). He joined Google in 2005 as a founding member of Google's engineering office in Atlanta, Georgia. Prior to Google, Bruce was Director of Engineering at AppForge, specializing in cross-platform mobile development tools.","firstName":"Bruce","lastName":"Johnson","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":3,"id":1070,"updatedDate":1389068263806,"bio":"Yakov Fain is Java Champion and a co-founder of two software companies: Farata Systems and SuranceBay. He authored several technical books and lots of articles on software development. He leads Princeton Java Users Group. Recently Yakov co-authored the book \"Enterprise Web Development\" (O'Reilly). Two of his books will be published this year: \"Java For Kids\" (No Starch Press) and the second edition of \"Java 24-Hour Trainer\" (Wrox).","firstName":"Yakov","lastName":"Fain","twitterId":"yfain","googlePlusId":"116033097136007429330","linkedInId":"yfain","lanyrdId":"","githubId":"yfain"},{"createdDate":null,"version":1,"id":1072,"updatedDate":null,"bio":"Peter Higgins (aka dante) is a software engineer at SitePen, a prominent web development and consulting company based in Silicon Valley. Peter heads up SitePen's Dojo Support, a great option for companies needing technical advice, code fixes and answers from the experts. As the newly appointed Dojo Project Lead, Peter spends countless hours improving the Dojo Toolkit, writing great demos and tutorials, and helping new Dojo users become proficient with the toolkit, all key ingredients to building a thriving Dojo Community.","firstName":"Peter","lastName":"Higgins","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1016,"updatedDate":null,"bio":"Keith Donald is a principal and founding partner at SpringSource, the company behind Spring and a division of VMware. At SpringSource, Keith is a full-time member of the Spring development team focusing on web application development productivity. He is also the architect behind SpringSource's state-of-the-art training curriculum, which has provided practical Spring training to over 10,000 students worldwide. Over his career, Keith, an experienced enterprise software developer and mentor, has built business applications for customers spanning a diverse set of industries including banking, network management, information assurance, education, retail, and healthcare. He is particularly skilled at translating business requirements into technical solutions.","firstName":"Keith","lastName":"Donald","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1069,"updatedDate":null,"bio":"Bill is a Fellow at the JBoss division of Red Hat Inc. He is JBoss's representative on the JAX-RS specification and leads the JBoss RESTEasy project. Bill is co-author of O'Reilly's \"EJB 3.0\" and has numerous other online and in-print publications about REST, EJB, JAX-RS, and AOP.","firstName":"Bill","lastName":"Burke","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1068,"updatedDate":null,"bio":"After graduating from Supelec (French \"Grande Ecole\"), Emmanuel has spent a few years in the retail industry as developer and architect where he started to be involved in the ORM space. He joined the Hibernate team in 2003 and is now a lead developer at JBoss, a division of Red Hat. Emmanuel is the lead developer of Hibernate Annotations and Hibernate EntityManager, two key projects on top of Hibernate Core implementing the Java Persistence(tm) specification. He also leads Hibernate Search and Hibernate Validator. Emmanuel is a member of the JPA 2.0 expert group and the spec lead of JSR 303: Bean Validation. He is a regular speaker at various conferences and JUGs, including JavaOne, JBoss World and Devoxx and the co-author of Hibernate Search in Action published by Manning.","firstName":"Emmanuel","lastName":"Bernard","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1066,"updatedDate":null,"bio":"Bob McWhirter has been involved in open-source for over a decade, including founding the Codehaus and the Jaxen, Drools, and Groovy projects. He's taken a shine to Ruby in the past few years, and is currently trying to make it more enterprisey.","firstName":"Bob","lastName":"McWhirter","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"},{"createdDate":null,"version":1,"id":1067,"updatedDate":null,"bio":"Jean Barmash is the Director of Technical Services at Alfresco Software, the Open Source Enterprise Content Management Company. His responsibilities include architecture and hands-on development of content centric solutions, training, and working with open source and Alfresco partner community. Jean brings a wealth of experience in different areas of technology creation. Most recently, he worked as Sr. Consultant and Trainer at several Wall Street Firms. Well-versed in both .NET and Java, he is interested in the innovation going on in Web 2.0 and bringing it into the Enterprise. He is a frequent speaker on technology and architecture topics at user groups and industry conferences. ","firstName":"Jean","lastName":"Barmash","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":3,"id":1006,"updatedDate":1417210185566,"bio":"Neal Ford is Director, Software Architect, and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, magazine articles, video/DVD presentations, and author and/or editor of eight books spanning a variety of subjects and technologies, including the most recent Presentation Patterns and Functional Thinking. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 300 developer conferences worldwide, delivering more than 2000 presentations. Check out his web site at nealford.com. He welcomes feedback and can be reached at nford@thoughtworks.com.\r\n","firstName":"Neal","lastName":"Ford","twitterId":"neal4d","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""},{"createdDate":null,"version":3,"id":1074,"updatedDate":1388501050468,"bio":"Principal consultant and a member of the core team at Agile Artisans, Jared Richardson works with other software craftsmen to build excellent custom software. He sold his first software program in 1991 and has been immersed in software ever since. He balances his time between coaching Agile teams and creating great software. Jared has authored and coauthored a number of books, including the best selling Ship It! A Practical Guide to Successful Software Projects and Career 2.0: Take Control of Your Life. He is a frequent speaker at software conferences and a thought leader in agile. Jared lives with his wife and children in North Carolina where they recently, quite by accident, became backyard chicken farmers. He's on the web at AgileArtisans.com.","firstName":"Jared","lastName":"Richardson","twitterId":"jaredrichardson","googlePlusId":"","linkedInId":"jaredrr","lanyrdId":"","githubId":""},{"createdDate":null,"version":1,"id":1065,"updatedDate":null,"bio":"Charlie Hubbard is a 10+ year veteran of the software industry, blogger, open source project contributor and creator. His days are filled as a Senior Software Engineer at Nexidia working on a grid based approach for searching audio. In his free time he enjoys working with Ruby, Java, Flex, Javascript, and has been known to make a film every once in a while. Charlie and his wife live and work in Atlanta. ","firstName":"Charlie","lastName":"Hubbard","twitterId":null,"googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":3,"id":1064,"updatedDate":1417233323609,"bio":"Dr. Doris Chen\r\nhttp://blogs.msdn.com/b/dorischen/\r\nTwitter @doristchen\r\n\r\nDoris is a Senior Technology Evangelist at Microsoft for the Western region of the United States, specialized in web technologies (HTML5, jQuery, JavaScript, Ajax, and Java).  \r\nDoris has over 18 years of experience in the software industry working in several open source web tier technologies, Java platform, .NET and distributed computing technologies. She has developed and delivered over 400 keynotes, technical sessions, code camps worldwide, published widely at numerous international conferences and user groups including O’Reilly OSCON, Fluent, HTML5 Dev Conference, JSEverywhere, WebVisions, JavaOne, SD Forum, HTML5 and JavaScript meetups, and worldwide User Groups. Doris works very closely to create and foster the open source community around Java, NetBeans, Glassfish, and related technologies. Before joining Microsoft, Doris Chen was a Technology Evangelist at Sun Microsystems.\r\nDoris received her Ph.D. from the University of California at Los Angeles (UCLA) in computer engineering, specializing in medical informatics. ","firstName":"Doris","lastName":"Chen","twitterId":"@doristchen","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"rooms":[],"sponsors":[]}}