{"presentationList":{"presentation":[{"createdDate":null,"version":1,"id":1305,"updatedDate":1411659465554,"audioLink":"","description":"Are you ready to bring your web development skills to natively installed mobile applications on multiple platforms?   In this session get ready for a deep dive into HTML & JavaScript powered cross-platform applications using PhoneGap (Apache Callback), powered by enterprise Java backend systems.","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1304,"updatedDate":1419201586456,"bio":"Andrew Trice is a MobileFirst Developer Advocate with IBM. Andrew is an experienced software architect, team leader, accomplished speaker, and published author who possesses more than a decade of designing and implementing rich applications for the web, desktop, and mobile devices. Andrew has delivered customer solutions in realtime data systems, GIS, immersive experiences, rich media, and data visualization.","firstName":"Andrew","lastName":"Trice","twitterId":"andytrice","googlePlusId":"+AndrewTrice","linkedInId":"andrewtrice","lanyrdId":"","githubId":"triceam"}],"title":"Java-Powered Cross-Platform Mobile Applications with PhoneGap","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1343,"updatedDate":1411659465772,"audioLink":"","description":"It is easy to not see the forest for the trees with some architectural approaches and never realizing that the approach is the root cause for many problems faced. This talk focusses on the most common anti-patterns in architectural approach with real world examples and the real damage it does. Ram will discuss ideas that will help you spot them and mitigate them.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Ram Singaram - Architecture Anti-patterns.pdf","speakers":[{"createdDate":null,"version":2,"id":1342,"updatedDate":null,"bio":"Ram serves ThoughtWorks, Inc. as a Principal Consultant and currently heads up the Atlanta office. He was the head of Technology Consulting practice in North America. He plays the role of a Senior Architect and Technical Lead in the creation of large-scale distributed enterprise applications and the integration of disparate systems. Ram has served as a developer, technical lead and architect in high end solutions encompassing custom frameworks, systems integration and business to business solutions using various technologies. He has worked with large corporations and has mentored clients and team members on the best use of technology and Agile techniques. He speaks at conferences and at clients on various topics and also helps in technology assessments and pursuits. He has had over 19 years of experience with over 6 years in ThoughtWorks and has worked in the US, Canada, UK, Thailand and India. He is passionate about motorcycles and riding.\r\n\r\nYou can follow him on twitter at  http://twitter.com/ramsingaram","firstName":"Ram","lastName":"Singaram","twitterId":"ramsingaram","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Architecture Anti-patterns","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1295,"updatedDate":1411659466046,"audioLink":"","description":"The world is a graph - and Neo4J can help you to interact with it. In this presentation we'll look at the strengths and weaknesses of graph databases and the kinds of use cases that they fit for. We'll then briefly look at graph based queries and how to get the best of both world using the cross store persistence capabilities of Spring Data.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Peter Bell - Neo4J - High Performance NoSQL Graph Database.pdf","speakers":[{"createdDate":null,"version":3,"id":1294,"updatedDate":1390408236167,"bio":"Peter is a contract member of the GitHub training team, the co-founder and CTO of Speak Geek, helping business people to hire and manage developers more effectively, the co-founder of CTO school and a regular presenter on a range of technologies - from chef to Neo4j.\r\n\r\nHe has presented at a range of conferences including DLD conference, ooPSLA, DevNexus, QCon NY, QCon SF, RubyNation, SpringOne2GX, Code Generation, Practical Product Lines, the British Computer Society Software Practices Advancement conference, GraphConnect, cf.Objective(), CF United, Scotch on the Rocks, WebDU, WebManiacs, UberConf, the Rich Web Experience and the No Fluff Just Stuff Enterprise Java tour. He has been published in IEEE Software, Dr. Dobbs, IBM developerWorks, Information Week, Methods & Tools, Mashed Code, the Open Source Journal, NFJS the Magazine and GroovyMag.","firstName":"Peter","lastName":"Bell","twitterId":"peterbell","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Neo4J - High Performance NoSQL Graph Database","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1341,"updatedDate":1411659466050,"audioLink":"","description":"A hands on introduction to the one non-JVM framework you need to know.\r\n\r\nIf you need to scale large numbers of relatively lightweight requests, node.js is a technology you need to understand. We'll look at the use cases, the strengths and weaknesses, how to get started with node.js and how to test and deploy your node.js applications effectively.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Peter Bell - Getting started with nodejs.pdf","speakers":[{"createdDate":null,"version":3,"id":1294,"updatedDate":1390408236167,"bio":"Peter is a contract member of the GitHub training team, the co-founder and CTO of Speak Geek, helping business people to hire and manage developers more effectively, the co-founder of CTO school and a regular presenter on a range of technologies - from chef to Neo4j.\r\n\r\nHe has presented at a range of conferences including DLD conference, ooPSLA, DevNexus, QCon NY, QCon SF, RubyNation, SpringOne2GX, Code Generation, Practical Product Lines, the British Computer Society Software Practices Advancement conference, GraphConnect, cf.Objective(), CF United, Scotch on the Rocks, WebDU, WebManiacs, UberConf, the Rich Web Experience and the No Fluff Just Stuff Enterprise Java tour. He has been published in IEEE Software, Dr. Dobbs, IBM developerWorks, Information Week, Methods & Tools, Mashed Code, the Open Source Journal, NFJS the Magazine and GroovyMag.","firstName":"Peter","lastName":"Bell","twitterId":"peterbell","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Getting started with node.js","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1287,"updatedDate":1411659466054,"audioLink":"","description":"Dart is a new structured programming language designed for the Web. In this talk, we’ll look at the motivation for Dart, language syntax and features, the Dart Editor, using the Dart JS compiler, and the Dart development cycle with frog server and Dartium. We’ll also look at improvements to the DOM, several sample apps built with Dart, and see how easy it is to use Dart with HTML5+CSS to create rich client applications that scale.","presentationLink":"http://www.dartlang.org/slides/2011/12/ajug/#1","speakers":[{"createdDate":null,"version":4,"id":1014,"updatedDate":null,"bio":"David Chandler works with the Google Developer Tools Team in Atlanta. An electrical engineer by training, Chandler got hooked on developing database Web applications in the days of NCSA Mosaic and has since written Web applications in a variety of languages, including C, perl, ksh, ColdFusion, Java, JSF, GWT, and now Dart. Prior to joining Google, Chandler worked on Internet banking applications with Intuit and launched a non-profit startup built with GWT and AppEngine. Chandler holds a patent on a method of organizing hierarchical data in a relational database and blogs about Java Web development at http://turbomanage.wordpress.com.","firstName":"David","lastName":"Chandler","twitterId":"drfibonacci","googlePlusId":"102717421433762219474","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Building Maintainable Web Apps with HTML5 and Dart","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1324,"updatedDate":1411659466058,"audioLink":"","description":"One easy way to add Groovy to existing Java systems is through testing. Writing tests in Groovy is easier than Java, without worrying about deploying Groovy in production. Groovy provides several capabilities to simplify testing, from GroovyTestCase and its subclasses to built-in mocks and stubs to the popular Spock framework. This talk will review the available options and demonstrate how to use them on combined Groovy and Java applications.","presentationLink":"","speakers":[{"createdDate":null,"version":5,"id":1323,"updatedDate":1420264607612,"bio":"Ken Kousen is President of Kousen IT, Inc, through which he does software development and technical training in all areas related to Java, especially open source topics like Android, Spring, Hibernate, Groovy, and Grails. He is the author of the book \"Making Java Groovy\" from Manning (http://manning.com/kousen/) and the book \"Gradle for Android\", upcoming from O'Reilly.","firstName":"Ken","lastName":"Kousen","twitterId":"kenkousen","googlePlusId":"+KennethKousen","linkedInId":"kenkousen","lanyrdId":"","githubId":"kousen"}],"title":"Testing Groovy and Java Systems","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1299,"updatedDate":1411659466061,"audioLink":"","description":"An introduction to working with PhoneGap. The main focus will be on Android development, but iOS will be discussed as well. I'll walk folks through the process of installing the necessary bits and how to create a PhoneGap project in Eclipse. I'll demonstrate PhoneGap running on real devices.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Raymond Camden - Introduction to PhoneGap Mobile Development.zip","speakers":[{"createdDate":null,"version":1,"id":1297,"updatedDate":null,"bio":"Raymond Camden is a senior developer evangelist for Adobe. His work focuses on web standards, mobile development and ColdFusion. He's a published author and presents at conferences and user groups on a variety of topics. Raymond can be reached at his blog (http://www.raymondcamden.com/), @cfjedimaster on Twitter, or via email at raymondcamden@gmail.com.","firstName":"Raymond","lastName":"Camden","twitterId":"cfjedimaster","googlePlusId":"115106614688778962135","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Introduction to PhoneGap Mobile Development","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1298,"updatedDate":1411659466065,"audioLink":"","description":"An introductory look at the jQuery Mobile framework. The focus will be on using the framework on web sites, but I'll demonstrate using jQM within a Phonegap-wrapped application as well.","presentationLink":"","speakers":[{"createdDate":null,"version":1,"id":1297,"updatedDate":null,"bio":"Raymond Camden is a senior developer evangelist for Adobe. His work focuses on web standards, mobile development and ColdFusion. He's a published author and presents at conferences and user groups on a variety of topics. Raymond can be reached at his blog (http://www.raymondcamden.com/), @cfjedimaster on Twitter, or via email at raymondcamden@gmail.com.","firstName":"Raymond","lastName":"Camden","twitterId":"cfjedimaster","googlePlusId":"115106614688778962135","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Creating Mobile Friendly Sites with jQuery Mobile","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1307,"updatedDate":1411659466086,"audioLink":"","description":"Developers are facing a new era of development with HTML5 for both mobile and desktop environments. It was once laughable to put mobile focused development ahead of the desktop, but those days are over. Whether you’re focused only on mobile, desktop, or both, there are a few critical questions which must be answered:\r\n\r\n* Which platforms and browsers should I support?\r\n* Which HTML5 related specifications are available on those platforms?\r\n* How do I integrate existing enterprise services?\r\n* How do I test my app?\r\n\r\nWesley will attempt to answer these questions with the latest market data and live demos. Attendees will learn what it takes to build a scalable, enterprise, HTML5 based application for both desktop and mobile environments.\r\n\r\n**The slides are not available.**","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1024,"updatedDate":null,"bio":"Wesley Hales is a User Interface architect from Atlanta, GA. He has been involved in UI and User Experience roles for over a decade in both startup and enterprise environments. Wesley co-founded several enterprise frameworks during his 4.5 years at JBoss by Red Hat (including the JBoss Portlet Bridge and AeroGear projects) and also served as a co-founder of the recently acquired startup, InstaOps. He is now employed by Apigee as a software developer mainly focused on UI.\r\n\r\nOverall, Wesley enjoys creating world-class user interfaces and experiences that people fall in love with.\r\nYou can see him speak at the occasional conference, read his posts on [wesleyhales.com](http://wesleyhales.com), or follow him on twitter @wesleyhales.","firstName":"Wesley","lastName":"Hales","twitterId":"wesleyhales","googlePlusId":"114682255328371246824","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"The Fundamentals of Enterprise HTML5 Development","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1308,"updatedDate":1411659466090,"audioLink":"","description":"I have talked to a lot of people about Ehcache over the years. What people find most valuable, and what stays with them, is the underlying caching theory - you can see the light bulb go on.\r\n\r\nIn this talk we will start with a performance problem and lead you through solving it with caching, discovering a long the way the problems of distributed caching and their solution. This will equip you with the tools to analyse a performance situation and to see whether a cache will help and what type of cache to apply.\r\n\r\nTopics include:\r\n\r\n* Why caching works\r\n* Standalone cache performance and effectiveness\r\n* Tiered Cache Design\r\n* N * Problem\r\n* Cache Cluster topologies\r\n* Cache Coherency Problem\r\n* CAP and PACELC constraints\r\n* Overcoming Java's limitations with BigMemory\r\n* Useful Cache Patterns","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Greg Luck - All About Caching.pdf","speakers":[{"createdDate":null,"version":2,"id":1005,"updatedDate":null,"bio":"Greg founded Ehcache in 2003. He regularly speaks at conferences, writes and codes. He has also founded and maintains the JPam and Spnego open source projects, which are security focused. Prior to joining Terracotta in 2009, Greg was Chief Architect at Wotif.com where he provided technical leadership as the company went from a single product startup to a billion dollar public company with multiple product lines. Before that Greg was a consultant for ThoughtWorks with engagements in the US and Australia in the travel, health care, geospatial, banking and insurance industries. Before doing programming, Greg managed IT. He was CIO at Virgin Blue, Tempo Services, Stamford Hotels and Resorts and Australian Resorts. He is a Chartered Accountant, and spent 7 years with KPMG in small business and insolvency. Greg holds a Bachelor of Commerce and a Masters in Information Technology.","firstName":"Greg","lastName":"Luck","twitterId":"gregrluck","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"All about Caching.","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1311,"updatedDate":1411659466094,"audioLink":"","description":"The Java SE platform has experienced a tremendous amount of positive evolution and adoption thanks to ongoing community participation. In this session, you'll learn about new features in the latest Java SE 7 release including Project Coin, Invoice Dynamic, Fork/Join Framework, and NIO.2. You will also learn about plans for major feature changes in Java SE 8 such as Project Lambda and Project Jigsaw. Lastly, an overview of the OpenJDK Community will be provided including community processes and structure, benefits for participants and the entire Java Ecosystem, and finally referencing exemplary model participants as examples and summarizing their driving forces for participation. This session will be relevant to both technical audiences wanting to learn more about Java SE and the OpenJDK community structure.","presentationLink":"","speakers":[{"createdDate":null,"version":1,"id":1310,"updatedDate":null,"bio":"Don brings worldwide enterprise software experience, ranging from small \"dot-com\" through Fortune 500 companies. Donald speaks regularly about Java, open source, community development, business models, business integration and software development politics at conferences and events worldwide including Java One, Oracle World, Sun Tech Days, Evans Developer Relations Conference, OOPSLA, JAOO, Server Side Symposium, Colorado Software Summit and others. Prior to returning to Oracle, Donald was Director of Ecosystem Development for the Eclipse Foundation, an independent not-for-profit foundation supporting the Eclipse open source community.","firstName":"Donald","lastName":"Smith","twitterId":"DonaldOJDK","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"The Java SE Platform: Rebuilding Momentum","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1316,"updatedDate":1411659466098,"audioLink":"","description":"This is not a talk about speed coding, or writing thousands of lines of crappy code in a weekend.  This is a talk for software craftsman who test drive clean code, but who also have a nagging feeling:  “Man, I know I could be doing this faster.”  We’re going to discuss everything from touch typing, to keyboard shortcuts, to faster pair programming techniques, to hardware, to build automation, to staying in the zone, to caffeine consumption, to ergonomics, to music and headphone selection, refactoring, language and framework selection, tech debt management, rapid prototyping, whiteboard design sessions, back of napkin mockups, guerilla tactics for getting in front of requirements and staying there, and what to do when you’re 30 lines down a stack trace and someone wants to tell you about something funny their kid did over the weekend.","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1117,"updatedDate":1419716357006,"bio":"As I enter my 18th year of developing software, several recurring trends and forces have become obvious to me.  My day job as a technical lead affords me time in the evening to write articles and prepare talks around these trends and forces, all of which interest me greatly.  To date these talks include \"[The ROI of Refactoring](http://www.slideshare.net/NeilGreen1/the-roi-of-refactoring-lego-vs-playdoh)\", \"[Nothing Matters More Than Coding Fast](http://devnexus.com/static/2012/audio/105%20-%20Neil%20Green%20-%20Nothing%20matters%20more%20than%20coding%20fast.mp3)\", and most recently \"[Writing Custom DSLs](https://www.youtube.com/watch?v=lm4jEcnWeKI)\" - which was a sneaky way to speak about these trends and forces in the form of technical talk.  \r\n","firstName":"Neil","lastName":"Green","twitterId":"neilfeyn","googlePlusId":"","linkedInId":"neilgreen","lanyrdId":"","githubId":"ngreen77"}],"title":"Nothing matters more than coding fast","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1301,"updatedDate":1411659466101,"audioLink":"","description":"Frequently deploying to production puts bigger pressure than before on DevOps to make sure the good, qualified application is provisioned with no mistakes.This session will explore some common pitfalls with traditional Continuous-Integration that increase risk, introduce manual input and human error, and generally make DevOps cringe before hitting the “deploy” button.\r\n\r\nWe will then demonstrate automation techniques that overcome these issues using popular tools, like Maven, Gradle, your CI server, custom scripts and a Binary Repository.\r\nWhether you are building software for the cloud or in-house, this presentation will show you how to have completely automated production builds that release applications which are fully traceable, managed and ready to be provisioned with no fear!","presentationLink":"","speakers":[{"createdDate":null,"version":5,"id":1300,"updatedDate":1420493650714,"bio":"Fred Simon is best known as the Co-founder and Chief Architect of JFrog - the Artifactory Binary Repository creators, JavaOne 2011 and 2013 Duke Choice Awards  winner.\r\n\r\nBefore founding JFrog in 2008, Fred founded AlphaCSP, the Java consulting firm in 1998 where he was the company's global CTO, leading 5 branches worldwide and served as the visionary voice of the company.\r\n\r\nFred’s development experience goes back to 1992 and covers Java technologies evolution from day one as a programmer, Architect and Consultant.\r\n\r\nAs one of JFrog leaders, Fred encourages strong collaboration with leading open-source  projects such as SpringSource, Grails and Gradle  by providing them with the Artifactory Cloud platform, and fuels the Continuous-Integration ecosystem with open-source plugins for leading tools such as Jenkins, TeamCity & Bamboo. \r\n\r\nWhen not on those Fred hacks around  new features for the core Java language, Java port of the popular sky rendering Stellarium project and other neat stuff.\r\n\r\nFred blogs at [JFrog blog[(http://www.jfrog.com/blog/) & http://freddy33.blogspot.com and tweets as @freddy33.\r\n[His speaking history on Lanyrd](http://lanyrd.com/profile/freddy33/sessions/)\r\n","firstName":"Frederic","lastName":"Simon","twitterId":"freddy33","googlePlusId":"+FredericSimon","linkedInId":"freddy33","lanyrdId":"freddy33","githubId":"freddy33"}],"title":"Build Trust in Your Build to Deployment Flow!","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1332,"updatedDate":1411659466105,"audioLink":"","description":"The presentation covers the Guava library developed by Google (http://code.google.com/p/guava-libraries/). Guava provides collection extensions to the Java Collection API and, along with this, a cornucopia of time-saving utilities that bring Java as close as possible to some of the more functional and dynamic language competitors like Scala, Ruby, and Clojure. The presentation focuses on the following topics: how to make Predicates and Functions; how to use new collection constructs that make life easier, including MultiMap, BiMaps, and MultiSets; how to set up and use Guava preconditions; and how to create truly immutable collections, and more. All of this is done with Java.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1331,"updatedDate":1418596125825,"bio":"Daniel Hinojosa has been a self-employed developer, teacher and speaker for private business, education, and government since 1999. Daniel also actively teaches programming for the University of New Mexico Continuing Education.\r\n\r\nDaniel is a Pomodoro Technique practitioner and is co-founder of the Albuquerque Java User’s Group in Albuquerque, New Mexico. When he’s not supporting other local Java developers, Daniel spends most of his waking hours developing in and around the Java ecosystem, encompassing multiple languages and frameworks. He is author for the upcoming book ‘Testing in Scala’ and is the latest member of the No Fluff Just Stuff tour.","firstName":"Daniel","lastName":"Hinojosa","twitterId":"dhinojosa","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Making Java Bearable with Guava","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1318,"updatedDate":1411659466121,"audioLink":"","description":"Want to go deep on a popular NoSQL database? Cassandra is a scalable, highly available, column-oriented data store in use at Facebook, Twitter, Reddit, Rackspace, and other web-scale operations. It offers a compelling combination of a rich data model, a robust deployment track record, and a sound architecture, making it a good choice of NoSQL databases to study first.\r\n\r\nIn this session, we'll talk about Cassandra's data model, look at its query idioms, talk about how to deploy it, and look at use cases in which it is an appropriate data storage solution. We'll study its origins in the Amazon Dynamo project and Google's BigTable, and learn how its architecture helps us achieve the gold standard of scalability: horizontal scalability on commodity hardware. You'll leave prepared to begin experimenting with Cassandra immediately and planning its adoption in your next project.\r\n\r\n**Per request, the presentation slides won't  be made available**.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1283,"updatedDate":null,"bio":"Tim is a full-stack generalist and passionate teacher who loves coding, presenting, and working with people. He believes the best developer is one who is well-informed of specifics and can also make deep connections between software development and the broader world. He has recently been exploring non-relational data stores, build systems, and how software architecture should resemble an ant colony.\r\n\r\nHis firm, the [August Technology Group](http://augusttechgroup.com), helps clients with product development, technology consulting, and technology upgrade projects on the JVM. The August Group's technology preferences reflect the generalist sensibilities of its founder, and its development practices are always lightweight, self-improving, and humanizing by design.\r\n\r\nTim is a speaker internationally and on the [No Fluff Just Stuff](http://nofluffjuststuff.com) tour in the United States, and is co-president of the [Denver Open Source User Group](http://denveropensource.org), author of the open-source [Groovy Liquibase DSL](http://github.com/tlberglund/groovy-liquibase), co-author of the [DZone Clojure RefCard](http://refcardz.dzone.com/refcardz/functional-programming-clojure), co-presenter of the best-selling [O'Reilly Git Master Class](http://bit.ly/ogitvid), co-author of [Building and Testing with Gradle](http://www.amazon.com/dp/144930463X), and a member of the [O'Reilly Expert Network](http://oreilly.com/pub/expert/timberglund).\r\n\r\nHe lives in Littleton, CO with the wife of his youth and their three children. ","firstName":"Tim","lastName":"Berglund","twitterId":"tlberglund","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Radical NoSQL Scalability with Cassandra","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1326,"updatedDate":1411659466129,"audioLink":"","description":"Groovy has several ways to make web development easier. Groovlets are part of the language, are easy to use and deploy, and are the basis of larger frameworks like Gaelyk. Groovy also supports the new style of web development with micro-frameworks. One in particular is Ratpack, based on the Sinatra project in the Ruby world. Finally, there is Grails, the elegant combination of Groovy DSLs with Spring and Hibernate. This talk will demonstrate them all and discuss where each is useful and appropriate.","presentationLink":"","speakers":[{"createdDate":null,"version":5,"id":1323,"updatedDate":1420264607612,"bio":"Ken Kousen is President of Kousen IT, Inc, through which he does software development and technical training in all areas related to Java, especially open source topics like Android, Spring, Hibernate, Groovy, and Grails. He is the author of the book \"Making Java Groovy\" from Manning (http://manning.com/kousen/) and the book \"Gradle for Android\", upcoming from O'Reilly.","firstName":"Ken","lastName":"Kousen","twitterId":"kenkousen","googlePlusId":"+KennethKousen","linkedInId":"kenkousen","lanyrdId":"","githubId":"kousen"}],"title":"The Groovy Web: groovlets, Micro-frameworks, and Grails","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1313,"updatedDate":1411659466145,"audioLink":"","description":"Heroku is a Polyglot Cloud Application Platform that makes it easy to deploy Java, Play! and Scala apps on the cloud.  Deployment is as simple as doing a \"git push\". This session will teach you how to deploy and scale Java, Play! and Scala apps on Heroku.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - James Ward - Introduction to Heroku.pdf","speakers":[{"createdDate":null,"version":4,"id":1000,"updatedDate":null,"bio":"James Ward (http://www.jamesward.com) works for Typesafe where he teaches developers the Typesafe Stack (Play Framework, Scala, and Akka). James frequently presents at conferences around the world such as JavaOne, Devoxx, and many other Java get-togethers. Along with Bruce Eckel, James co-authored First Steps in Flex. He has also published numerous screencasts, blogs, and technical articles. Starting with Pascal and Assembly in the 80′s, James found his passion for writing code. Beginning in the 90′s he began doing web development with HTML, Perl/CGI, then Java. After building a Flex and Java based customer service portal in 2004 for Pillar Data Systems he became a Technical Evangelist for Flex at Adobe. In 2011 James became a Principal Developer Evangelist at Salesforce.com where he taught developers how to deploy apps on the cloud with Heroku. James Tweets as @_JamesWard and posts code at http://github.com/jamesward.","firstName":"James","lastName":"Ward","twitterId":"_JamesWard","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Introduction to Heroku","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1314,"updatedDate":1411659466158,"audioLink":"","description":"The Play Framework takes the pain out of Java and Scala web app development. This session will use live coding and demos to walk you through getting started with Play! 1.2.x and the latest Play 2 prerelease. You will also learn how to build a browser client with HTML5 & JavaScript, create JSON services, connect to back-end databases and deploy to the cloud.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - James Ward - Intro to Play Framework.pdf","speakers":[{"createdDate":null,"version":4,"id":1000,"updatedDate":null,"bio":"James Ward (http://www.jamesward.com) works for Typesafe where he teaches developers the Typesafe Stack (Play Framework, Scala, and Akka). James frequently presents at conferences around the world such as JavaOne, Devoxx, and many other Java get-togethers. Along with Bruce Eckel, James co-authored First Steps in Flex. He has also published numerous screencasts, blogs, and technical articles. Starting with Pascal and Assembly in the 80′s, James found his passion for writing code. Beginning in the 90′s he began doing web development with HTML, Perl/CGI, then Java. After building a Flex and Java based customer service portal in 2004 for Pillar Data Systems he became a Technical Evangelist for Flex at Adobe. In 2011 James became a Principal Developer Evangelist at Salesforce.com where he taught developers how to deploy apps on the cloud with Heroku. James Tweets as @_JamesWard and posts code at http://github.com/jamesward.","firstName":"James","lastName":"Ward","twitterId":"_JamesWard","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Intro to Play Framework - Making Java & Scala Web App Development Fun","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1328,"updatedDate":1411659466168,"audioLink":"","description":"The success of the Java language and platform depends on community support and participation. Java is developed through the Java Community Process, which is open to all members of the Java community. Recent changes to the process, introduced in JSR 348, make it even easier for developers to observe and to participate in the work of the JCP.\r\n\r\nEven before these changes Java User Groups had begun to participate in the work of the JCP. Now that two JUGs (SouJava and the London Java Community) are represented on the JCP's Executive Committee we are beginning to explore ways in which the energy, enthusiasm, and expertise of the JUG community can be harnessed to further advance the Java platforms.\r\n\r\nMost developers understand the value of participating in open-source projects. This session will explain the benefits of participating in the JCP. We will explain how the JCP is is organized and how Java standards are developed. We will discuss the current state of the Java platforms, explain how the JCP is helping to evolve them, provide practical advice on how you can participate through your local Java User Group, and explain why participation is good for your career. \r\n\r\nBring your questions, your suggestions, and your concerns. We want to hear from you - the foundation of the Java community - and to explore new ideas for community participation.","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1282,"updatedDate":null,"bio":"Patrick Curran is Chair of the Java Community Process organization. In this role he oversees the activities of the JCP's Program Management Office including evolving the process and the organization, managing its membership, guiding specification leads and experts through the process, chairing Executive Committee meetings, and managing the [JCP.org web site](http://jcp.org/).\r\n\r\nPatrick has worked in the software industry for more than 25 years, and at Sun and then Oracle for 20 years. He has a long-standing record in conformance testing, and before joining the JCP he led the Java Conformance Engineering team in Sun's Client Software Group. He was also chair of Sun's Conformance Council, which was responsible for defining Sun's policies and strategies around Java conformance and compatibility.\r\n\r\nPatrick has participated actively in several consortia and communities including the [W3C](http://www.w3.org/) (as a member of the Quality Assurance Working Group and co-chair of the Quality Assurance Interest Group), and [OASIS](http://www.oasis-open.org/) (as co-chair of the Test Assertions Guidelines Technical Committee). Patrick's blog is [here](http://blogs.sun.com/pcurran/).","firstName":"Patrick","lastName":"Curran","twitterId":"","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Java User Groups and the Java Community Process: a winning combination","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1340,"updatedDate":1411659466172,"audioLink":"","description":"So you think you've picked up enough JavaScript to be dangerous, but feel like the whole prototypical language thing is still a mystery. In this session, we'll go from basic JavaScript to advanced JavaScript. We'll discuss and code modular JavaScript with CommonJS. We'll look into the details of a prototype language and discuss things like parasitic inheritance. We'll also look at JavaScript libraries that will help you get the most out of JavaScript - not jQuery, but a library like UnderscoreJS and SugarJS.\r\n\r\nThis is a fast paced session meant to bring you up to speed with the latest and greatest JavaScript techniques and tools. Whether you're building client side JavaScript with HTML5 or Appcelerator Titanium, or server-side JavaScript with node.js, you'll come away with knowledge and patterns for how the pro's use JavaScript for building real apps.","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"}],"title":"Advanced JavaScript for Java Devs","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1330,"updatedDate":1411659466176,"audioLink":"","description":"This session will provide an introductory overview of Android's architecture and the layout of an Android project. When building Android apps, you may want to take advantage of a third party library, like Spring Android. You can do this through the use of various Maven plugins and tools for enabling dependency management in your Android project. We will walk through how to set up and configure an Android project using Maven. Many applications consume data from various web services, and we will discuss how the Spring Android project can help. \r\n\r\nSpring Android provides an abstraction for consuming RESTful services and marshaling the requests and responses to JSON or XML. Lastly, Spring Android supports the use of Spring Social on Android, and we will discuss how Spring Social can help you connect your apps to OAuth protected services like Facebook and Twitter.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1127,"updatedDate":1418572160608,"bio":"Roy Clarkson is a software engineer at Pivotal where he works on Spring's open source projects. Roy is the Spring for Android project lead and is also an organizer of the Atlanta Spring User Group. As a long time resident of Atlanta, he studied computer science at Georgia Tech before beginning his career as a software engineer. He has worked as a professional software developer for many years, with a variety of languages and technologies. He has spent the last few years focusing on mobile application development, including iPhone, Android, and mobile web. Prior to that, he focused most of his time on web development. Roy has spoken at several conferences and user groups about Spring and mobile technologies.","firstName":"Roy","lastName":"Clarkson","twitterId":"royclarkson","googlePlusId":"","linkedInId":"","lanyrdId":"royclarkson","githubId":"royclarkson"}],"title":"Native Android Development with Spring Android","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1348,"updatedDate":1411659466183,"audioLink":"","description":"This talk will introduce Native Client, covering the nuances of porting your existing C++ game. We'll talk about the application specific problems, how to deal with the Pepper Thread, along with platform APIs like FileIO, rendering and Audio. In addition we'll cover common issues with the Chrome Web store, distribution, and monetization. Finally, we'll be talking about exciting news and roadmaps for native client moving forward. If you're interested in NaCl, or want to learn more, this is the talk for you!","presentationLink":"","speakers":[{"createdDate":null,"version":0,"id":1346,"updatedDate":null,"bio":"Joel Webber is a co-creator of the Google Web Toolkit, and focuses on bringing the web to the cutting edge of interactive application development. When not hacking WebKit, wrestling compiler bugs, and dealing with browser quirks, he spends his spare time building games and graphics libraries. Prior to joining Google, he worked in mobile development and the game industry.","firstName":"Joel","lastName":"Webber","twitterId":"jgw","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Porting Your Game to the Web using NaCl","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1347,"updatedDate":1411659466187,"audioLink":"","description":"This session will introduce you to the cross-platform game library we created in the process of porting Rovio's \"Angry Birds\" to the browser, which we've called \"PlayN\". You'll learn how to use this library to write games in Java that run on modern web browsers, as well as on Flash and as Android and iOS apps. We'll also discuss some of the challenges of building games that target the web, from arithmetic and rendering performance, to rendering and audio bugs, hiding network lag, and avoiding garbage collection pauses.","presentationLink":"","speakers":[{"createdDate":null,"version":0,"id":1346,"updatedDate":null,"bio":"Joel Webber is a co-creator of the Google Web Toolkit, and focuses on bringing the web to the cutting edge of interactive application development. When not hacking WebKit, wrestling compiler bugs, and dealing with browser quirks, he spends his spare time building games and graphics libraries. Prior to joining Google, he worked in mobile development and the game industry.","firstName":"Joel","lastName":"Webber","twitterId":"jgw","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Introduction to the PlayN Cross-Platform Game Library","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1338,"updatedDate":1411659466194,"audioLink":"","description":"Spring 3.1 is here, and it offers a LOT! The question is - what does it offer for you? Josh Long will introduce Spring 3.1 in this fast paced tour of all the new features, including profiles, Hibernate 4 support, XML free web applications, numerous updates to the code-centric component model, the environment abstraction, a caching abstraction, an improved REST API, and much more. Josh introduces numerous new features in terms of an application that he'll introduce along the way.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Josh Long - A walking tour of Spring 3_1.pdf","speakers":[{"createdDate":null,"version":4,"id":1284,"updatedDate":1417211686772,"bio":"Josh Long is the Spring Developer Advocate. Josh is the lead author on Apress’ Spring Recipes, 2nd Edition, the O'Reilly \"Pro Spring Roo\" book, the Pearson \"Livelessons for Spring\" and a committer on several Spring projects and the Activiti BPMN framework. When he’s not hacking on code, he can be found at the local Java User Group or at the local coffee shop. Josh likes solutions that push the boundaries of the technologies that enable them. Josh's interests include big-data, mobile, REST, NoSQL and integration. He blogs on the [Spring blog](http://spring.io/team/jlong) and [on his personal blog](http://joshlong.com).\r\n","firstName":"Josh","lastName":"Long","twitterId":"starbuxman","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"A walking tour of Spring 3.1","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1355,"updatedDate":1411659466198,"audioLink":"","description":"The Gradle build tool is one of the most successful projects in the Groovy ecosystem because it addresses a difficult problem -- every major build is a custom build. Gradle builds are written in Groovy, so the full power of the language is available if you need it. Gradle supports Maven project structure, repositories, and processes without being bound by its limitations. This talk will cover the basics of Gradle both through simple projects and by examining the build files for other open source projects. With major systems like Grails, Hibernate, and even the Spring Framework moving to Gradle, this is a technology worth taking the time to understand.\r\n","presentationLink":"","speakers":[{"createdDate":null,"version":5,"id":1323,"updatedDate":1420264607612,"bio":"Ken Kousen is President of Kousen IT, Inc, through which he does software development and technical training in all areas related to Java, especially open source topics like Android, Spring, Hibernate, Groovy, and Grails. He is the author of the book \"Making Java Groovy\" from Manning (http://manning.com/kousen/) and the book \"Gradle for Android\", upcoming from O'Reilly.","firstName":"Ken","lastName":"Kousen","twitterId":"kenkousen","googlePlusId":"+KennethKousen","linkedInId":"kenkousen","lanyrdId":"","githubId":"kousen"}],"title":"The Gradle Will Rock","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1350,"updatedDate":1411659466202,"audioLink":"","description":"JBoss by Red Hat contributes to numerous OSS projects and the overall open source ecosystem is constantly producing new tools, frameworks, engines and techniques. If you are \"building your stack\" for your next project, trying to navigate the vast OSS world can be a bewildering and complex undertaking. In this session, we will highlight some key technologies that have a tremendous impact on the typical enterprise application. Most importantly we will provide guidance into how JBoss is making your custom application development more productive.\r\n\r\nSome of the technologies to be seen via live demonstrations:\r\n\r\n* Eclipse+JBoss Tools = JBDS\r\n* Maven usage with JBoss\r\n* HTML5/Mobile solutions\r\n* Errai for Google Web Toolkit (GWT)\r\n* RichFaces - JavaServer Faces (JSF)\r\n* jBPM\r\n\r\nVideo recording of this session available at: \r\n\r\nhttp://vimeo.com/39948488\r\n","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Burr Sutter - JBossGalaxy_Published.pdf","speakers":[{"createdDate":null,"version":4,"id":1349,"updatedDate":1420263676473,"bio":"Burr Sutter is responsible for Red Hat JBoss middleware developer tooling and frameworks and is  specifically focused on technologies such as Java EE, Spring, PaaS, HTML5 and Apache Cordova.  Burr's passion is learning, teaching and demonstrating developer facing technologies. \r\nHe has previously been the President of the Atlanta Java Users Group, founder of the DevNexus conference, founder of the Atlanta chapter of the IASA and an Oracle Java Champion. ","firstName":"Burr","lastName":"Sutter","twitterId":"burrsutter","googlePlusId":"+BurrSutter","linkedInId":"burrsutter","lanyrdId":"","githubId":"burrsutter"}],"title":"The Hitchhiker's Guide to the JBoss Galaxy","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1358,"updatedDate":1411659466205,"audioLink":"","description":"Titanium is an open-source development tool for producing cross-platform mobile applications by Appcelerator. Using Titanium, you develop your mobile application using Javascript coded against the Titanium API's. Titanium Developer, a management GUI for your mobile apps, invokes their compiler and builder to take your Javascript and build a native application for iOS and Android.\r\n\r\nThis session will walk you through the details of building great apps for the Android and iOS platforms. We'll talk about Titanium development, its ecosystem, and architecture. We'll spend time looking at lots of code - we'll build an app, in fact, while we discuss and explore the framework. We'll also spend some time discussing best practices, what to expect when developing against it, and the limits of this type of development.","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"}],"title":"Easy Mobile Development: Appcelerator Titanium Introduction","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1364,"updatedDate":1411659466209,"audioLink":"","description":"\"Big Data\" has all the marketing and buzzword glamour of \"Cloud\" or \"Social\" nowadays. But there are serious tools out there to handle serious amounts of data. As with any task, you should use the right tool for the job at hand. This talk will navigate the vast and growing Hadoop Ecosystem as well as some new entrants to the emerging realtime stream processing market. From ingest to batch processing to querying, from scaling to extending to visualizing, there are a lot of systems that could make their way into your application's stack. We will visit the more promising of these systems via case studies and real-world examples.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1125,"updatedDate":null,"bio":"Brad Anderson has been wrangling data for 20 years, more recently building and using non-relational data stores. He works as a solution architect, assisting clients in their use of MapR's technology-leading Hadoop distribution. Previously, Brad has worked on a large-scale video-on-demand platform, smart grid analytics, a real-time audience participation platform, helped Cloudant build their hosted NoSQL offering based on CouchDB, and organized the NoSQL East 2009 conference in Atlanta.","firstName":"Brad","lastName":"Anderson","twitterId":"boorad","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Large Scale Data Analysis Tools","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1357,"updatedDate":1411659466220,"audioLink":"","description":"This session will introduce you to building Android applications for the Google TV platform. You’ll learn what “Smart TV” is, or should be; what the landscape for multi-screen, multi-device development looks like; where Google TV fits and why it matters; how to build basic applications for Google TV; and some valuable tips about design and development practices for the big screen.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Charlie Collins - Building Apps for Google TV.pdf","speakers":[{"createdDate":null,"version":2,"id":1015,"updatedDate":null,"bio":"Charlie Collins is the Director of Technology at MOVL; an experienced java, mobile, and web developer; a contributor to several open source projects; and coauthor of Android in Practice, Unlocking Android, and GWT in Practice.","firstName":"Charlie","lastName":"Collins","twitterId":"CharlieCollins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Google TV Basics and Boundaries","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1361,"updatedDate":1411659466224,"audioLink":"","description":"For a minor release, Spring Integration 2.1 delivers some major features. Channel Adapters are now available for AMQP-based messaging via RabbitMQ. Message Store implementations are now available for a number of NoSQL data stores, including GemFire, MongoDB, and Redis. Other noteworthy additions include JSR-223 scripting support, stored procedure adapters, and a new Content Enricher component. Attend this session to learn about these new features, and don't worry if you know nothing about Spring Integration yet, we'll begin with a quick introduction.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Mark Fisher - Whats new in Spring Integration 2_1.pdf","speakers":[{"createdDate":null,"version":3,"id":1149,"updatedDate":null,"bio":"Mark is the founder of the [Spring Integration](http://www.springintegration.org/) project. Currently at VMware, he continues to lead the Spring Integration team while exploring the intersection of big data and messaging. He has been a committer on a number of Spring projects, including the [Spring Framework](http://www.springsource.org/spring-framework) itself and [Spring AMQP](http://www.springsource.org/spring-amqp), which he co-founded. Mark speaks regularly at conferences and user groups about messaging, data, integration, and cloud computing.","firstName":"Mark","lastName":"Fisher","twitterId":"m_f_","googlePlusId":"","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"What's new in Spring Integration 2.1","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1363,"updatedDate":1411659466228,"audioLink":"","description":"A talk on general best practices in Scala, taken from real world experience and examples in the book Scala In Depth.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1334,"updatedDate":1389373961466,"bio":"Josh Suereth is a Senior Software Engineer at Typesafe and the author of \"Scala In Depth\". He has been a Scala enthusiast ever since he came to know this beautiful language in 2007. He started his professional career as a software developer in 2004 using programming languages like C++, Perl and Java. In 2009 he began writing the book \"Scala In Depth\" which provides practical support for using Scala in every day applications. Josh regularly shares his expertise in articles and talks.","firstName":"Josh","lastName":"Suereth","twitterId":"jsuereth","googlePlusId":"116090704407622565882","linkedInId":"joshuasuereth","lanyrdId":"","githubId":""}],"title":"Effective Scala","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1362,"updatedDate":1411659466232,"audioLink":"","description":"This talk covers the basics of Scala syntax and why it's a language that all developers should get to know.  This talk covers the underlying philosophy behind the language as well as the core features that make it wonderful to use.  This is an introductory talk and no prior knowledge of Scala is assumed.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1334,"updatedDate":1389373961466,"bio":"Josh Suereth is a Senior Software Engineer at Typesafe and the author of \"Scala In Depth\". He has been a Scala enthusiast ever since he came to know this beautiful language in 2007. He started his professional career as a software developer in 2004 using programming languages like C++, Perl and Java. In 2009 he began writing the book \"Scala In Depth\" which provides practical support for using Scala in every day applications. Josh regularly shares his expertise in articles and talks.","firstName":"Josh","lastName":"Suereth","twitterId":"jsuereth","googlePlusId":"116090704407622565882","linkedInId":"joshuasuereth","lanyrdId":"","githubId":""}],"title":"Why you want to learn Scala","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1374,"updatedDate":1411659466236,"audioLink":"","description":"Join us for a technical how-to session on how to develop cloud ready iPhone and Android apps for the cloud. Let's skip having to learn three different languages and jumpstart the development process using what you already know. We'll utilize Appcelerator's Titanium IDE to create a native mobile application targeting multiple mobile platforms. Best of all we'll be running everything on on JBoss AS 7.1 with a MongoDB back-end. Nothing complicated, nothing convoluted. Just straight ahead mobile development goodness with Titanium, MongoDB, JBoss and OpenShift. What's OpenShift? It's Red Hat's free, auto-scaling platform-as-a-service for Java, Ruby, Perl, PHP and Python apps. Get started for free by signing up at [openshift.com](http://openshift.com/) with promo code: DEVNEXUS. Special bonus if you love beer, this session is for you!","presentationLink":"","speakers":[{"createdDate":null,"version":0,"id":1373,"updatedDate":null,"bio":"Mark Atwood is a Developer Evangelist for Red Hat OpenShift. He has been a long-time contributor to open source. His technology interests include Cloud Computing and NoSQL. He is the patch queue manager for MySQL Drizzle. He was the Senior Technology Advisor for Network.com at Sun Microsystems. He makes his home in Seattle USA.","firstName":"Mark","lastName":"Atwood","twitterId":"fallenpegasus","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Mobilize JBoss AS 7.1 - How to Develop Mobile Apps for the Cloud w/ OpenShift","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1380,"updatedDate":1411659466240,"audioLink":"","description":"Apple's iPhone SDK has been the largest disruption to software development since the Web, sparking the creation in a few short years of the largest medium for consumer engagement in the world, eclipsing the Web, movies, and even television. While some prophesy that in the coming years mobile apps will be replaced by the web, in today's reality a number of high profile start-ups are bypassing the web entirely to reach their audience exclusively via apps. Join Ben as he discusses the role of the web in the mobile present and explore developer issues as we head into the post-PC era.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Ben Galbraith - Web vs Apps.pdf","speakers":[{"createdDate":null,"version":3,"id":1054,"updatedDate":null,"bio":"Ben Galbraith, together with his long-time friend Dion Almaer, forms one-half of the dynamic \"Ben and Dion\" duo that founded Ajaxian.com, headed Developer Tools at Mozilla, ran Developer Relations at Palm and is now running mobile architecture and engineering at Walmart.com after being acquired along with their start-up team in early 2011. Ben's been writing code since he was six and starting businesses since he was ten; he's written books, given hundreds of award-winning presentations world-wide, produced a few technical conferences, sold three companies, and has held CEO, CIO, CTO, and Software Architect positions in the medical, publishing, media, consumer electronics, advertising, software and internet industries. He lives in Palo Alto with his wife and six children.\r\n","firstName":"Ben","lastName":"Galbraith","twitterId":"bgalbs","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Web vs. Apps","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1378,"updatedDate":1411659466243,"audioLink":"","description":"The cloud movement is no longer just buzz and hype. Organizations are increasingly planning cloud-based deployments. For greenfield development, the path is relatively clear, but what about existing apps? The monolithic multi-tier architecture so common for enterprise apps is not the best fit for the cloud. For one thing, the presentation layer is typically moving to the client side. With cloud-based messaging and NoSQL datastore options, the data access and integration layers might require renovation as well. Meanwhile the significant investment that a business would most like to salvage is in the service layer sandwiched in the middle. In this session, we'll explore this space while migrating a hypothetical application to run in the cloud. The starting point will be a fairly standard multi-tier Spring MVC application, and the end result will be a collection of services running in the cloud. We'll discuss REST, JSON, NoSQL, messaging, polyglot development, and modular architectures designed to run in a dynamic always-on environment.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Mark Fisher - Migrating Enterprise Apps to the Cloud.pdf","speakers":[{"createdDate":null,"version":3,"id":1149,"updatedDate":null,"bio":"Mark is the founder of the [Spring Integration](http://www.springintegration.org/) project. Currently at VMware, he continues to lead the Spring Integration team while exploring the intersection of big data and messaging. He has been a committer on a number of Spring projects, including the [Spring Framework](http://www.springsource.org/spring-framework) itself and [Spring AMQP](http://www.springsource.org/spring-amqp), which he co-founded. Mark speaks regularly at conferences and user groups about messaging, data, integration, and cloud computing.","firstName":"Mark","lastName":"Fisher","twitterId":"m_f_","googlePlusId":"","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Migrating Enterprise Apps to the Cloud: from monolith to modular","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":4,"id":1288,"updatedDate":1411659466247,"audioLink":"","description":"Google AppEngine lets you build and host scalable Web applications written in Python or Java on Google’s infrastructure. In this talk, we'll look at new features in the last year, including the high-replication datastore (HRD), Cloud SQL, the new query planner, and cross-group transactions. In addition, we'll look at a recipe for load testing and many tips to make your apps more responsive and minimize cost.\r\n \r\nGuest speaker Mike Lawrence from [theice.com](http://www.theice.com) will also demo an app (http://wordpong.com) created and hosted on Google App Engine and discuss his experience with the App Engine Datastore.","presentationLink":"http://www.slideshare.net/turbomanage/google-app-engine-update-2012","speakers":[{"createdDate":null,"version":4,"id":1014,"updatedDate":null,"bio":"David Chandler works with the Google Developer Tools Team in Atlanta. An electrical engineer by training, Chandler got hooked on developing database Web applications in the days of NCSA Mosaic and has since written Web applications in a variety of languages, including C, perl, ksh, ColdFusion, Java, JSF, GWT, and now Dart. Prior to joining Google, Chandler worked on Internet banking applications with Intuit and launched a non-profit startup built with GWT and AppEngine. Chandler holds a patent on a method of organizing hierarchical data in a relational database and blogs about Java Web development at http://turbomanage.wordpress.com.","firstName":"David","lastName":"Chandler","twitterId":"drfibonacci","googlePlusId":"102717421433762219474","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Launching scalable apps with Google App Engine","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1377,"updatedDate":1411659466254,"audioLink":"","description":"Is it the modular design and infinitely extensible architecture? Is it the elegant administration? Perhaps it's compliance with the universal language of standards? Maybe the ease of testing your applications? We'll search the answer together in a journey that will take you from testing the water to the deep dive, and in which you'll learn the secrets behind the unparalleled speed, incredibly small foot print, and exciting usability features of the next generation application server from JBoss.","presentationLink":"http://www.slideshare.net/marius_bogoevici/what-makes-jboss-tick","speakers":[{"createdDate":null,"version":2,"id":1375,"updatedDate":1417297174002,"bio":"Marius Bogoevici is a software engineer with Pivotal, working on Spring XD, and contributor emeritus to Spring Integration. Marius has an experience of more than 17 years of architecting and developing enterprise applications. A staunch open-source software proponent, in his previous tenures at Red Hat and SpringSource, he actively took part in the development of various of open-source Java projects such as Spring Integration, Weld (CDI RI), and well as JBoss AS. Marius is also co-author of “Spring Integration in Action” (Manning, 2012).","firstName":"Marius","lastName":"Bogoevici","twitterId":"@mariusbogoevici","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"What makes JBoss AS 7 tick?","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1320,"updatedDate":1411659466262,"audioLink":"","description":"Perhaps you've already heard of some of the new features like flash attributes, code-based configuration, partial validation with Hibernate Validator 4.2, and many others. This talk aims to be your comprehensive source of all that you can take advantage of in this release. We'll use code snippets, provide pointers, and highlight the things you need to know without spending too much time on individual topics. At the end we'll discuss what's in store for Spring MVC 3.2.","presentationLink":"https://github.com/rstoyanchev/spring-mvc-31-walkthrough","speakers":[{"createdDate":null,"version":6,"id":1285,"updatedDate":1420264261788,"bio":"Rossen is a committer on the Spring Framework team with a strong focus on web development including Spring MVC and WebSocket messaging. Previously Rossen consulted and trained Spring teams for several years. He has been involved with Java and web development in various industries and domains since the mid 90s.\r\n","firstName":"Rossen","lastName":"Stoyanchev","twitterId":"rstoya05","googlePlusId":"116853920244172849367","linkedInId":"","lanyrdId":"rstoyanchev","githubId":"rstoyanchev"}],"title":"Spring MVC 3.1 Walkthrough","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1321,"updatedDate":1411659466266,"audioLink":"","description":"This presentation is for seasoned Spring MVC developers and for those curious to make the most of the release. Rather than faithfully covering every change, we'll take a deeper look at the new @MVC infrastructure classes, what has motivated the changes and what possibilities they have created. We'll discuss pros and cons of the MVC Java config and the MVC namespace and we'll see how to make advanced customizations with each. We'll show examples of testing annotated controllers with the new spring-mvc-test project available on github, and more. Last but not least we'll allow time for questions and discuss what's planned for Spring MVC 3.2.","presentationLink":"https://github.com/rstoyanchev/spring-mvc-31-indepth","speakers":[{"createdDate":null,"version":6,"id":1285,"updatedDate":1420264261788,"bio":"Rossen is a committer on the Spring Framework team with a strong focus on web development including Spring MVC and WebSocket messaging. Previously Rossen consulted and trained Spring teams for several years. He has been involved with Java and web development in various industries and domains since the mid 90s.\r\n","firstName":"Rossen","lastName":"Stoyanchev","twitterId":"rstoya05","googlePlusId":"116853920244172849367","linkedInId":"","lanyrdId":"rstoyanchev","githubId":"rstoyanchev"}],"title":"An In-depth Look At Spring MVC 3.1","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1360,"updatedDate":1411659466269,"audioLink":"","description":"Many development shops have made the leap from RCS, Perforce, ClearCase, PVCS, CVS, BitKeeper or SourceSafe to the modern Subversion (SVN) version control system. But why not take the next massive stride in productivity and get on board with Git, a distributed version control system (DVCS). Jump ahead of the masses staying on Subversion, and increase your team's productivity, debugging effectiveness, flexibility in cutting releases, and repository redundancy at $0 cost. Understand how distributed version control systems are game-changers and pick up the lingo that will become standard in the next few years.\r\n\r\nIn this talk, we discuss the team changes that liberate you from the central server, but still conform to the corporate expectation that there's a central master repository. You'll get a cheat sheet for Git, and a trail-map from someone who's actually experienced the Subversion to Git transition.\r\n\r\n**Per request, the presentation slides won't  be made available**.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1283,"updatedDate":null,"bio":"Tim is a full-stack generalist and passionate teacher who loves coding, presenting, and working with people. He believes the best developer is one who is well-informed of specifics and can also make deep connections between software development and the broader world. He has recently been exploring non-relational data stores, build systems, and how software architecture should resemble an ant colony.\r\n\r\nHis firm, the [August Technology Group](http://augusttechgroup.com), helps clients with product development, technology consulting, and technology upgrade projects on the JVM. The August Group's technology preferences reflect the generalist sensibilities of its founder, and its development practices are always lightweight, self-improving, and humanizing by design.\r\n\r\nTim is a speaker internationally and on the [No Fluff Just Stuff](http://nofluffjuststuff.com) tour in the United States, and is co-president of the [Denver Open Source User Group](http://denveropensource.org), author of the open-source [Groovy Liquibase DSL](http://github.com/tlberglund/groovy-liquibase), co-author of the [DZone Clojure RefCard](http://refcardz.dzone.com/refcardz/functional-programming-clojure), co-presenter of the best-selling [O'Reilly Git Master Class](http://bit.ly/ogitvid), co-author of [Building and Testing with Gradle](http://www.amazon.com/dp/144930463X), and a member of the [O'Reilly Expert Network](http://oreilly.com/pub/expert/timberglund).\r\n\r\nHe lives in Littleton, CO with the wife of his youth and their three children. ","firstName":"Tim","lastName":"Berglund","twitterId":"tlberglund","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Git Going with Distributed Version Control","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1303,"updatedDate":1411659466273,"audioLink":"","description":"You've heard about the extensibility of Java EE 6, and heard about CDI (Contexts and Dependency Injection). You may have also looked at Seam 3 or MyFaces CODI. You've seen enough to pique your curiosity. This session will sate that curiosity and give you enough information to build great extensions for your application and business.\r\n\r\nIn this session, Jason Porter, Senior Software Engineer at Red Hat and Apache DeltaSpike contributor, will cover creating extensions in Java EE 6 and show how using Apache DeltaSpike will ease some of the work.\r\n\r\n*The presentation sources are available at:*\r\n\r\nhttps://github.com/LightGuard/devnexus_2012_presentation","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1302,"updatedDate":1417211919523,"bio":"Jason is a software engineer currently working in the Java Enterprise Edition Space, Arquillian, Forge, web site and other developer experience projects within Red Hat. His specialties include JBoss AS, Seam, CDI, JSF, Java EE, and Gradle. He has worked with PHP, Ruby, Groovy, XSLT, SASS the rest of the web language arena (HTML, CSS, JS, etc). His current position as Senior Software Engineer at Red Hat has him work primarily on the JBoss website, however, he also contributes to JBoss Forge, Arquillian, Apache DeltaSpike, Awestruct and others as time allows. He's very interested in the developer experience and helping to improve it at all aspects.","firstName":"Jason","lastName":"Porter","twitterId":"lightguardjp","googlePlusId":"110049315339873366294","linkedInId":"jasonporter","lanyrdId":"lightguardjp","githubId":"LightGuard"}],"title":"Building CDI extensions using DeltaSpike","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1290,"updatedDate":1411659466069,"audioLink":"","description":"RESTful web services have become the preferred approach to synchronously integrating heterogeneous systems. The architectural style’s success is due in large part to its simplicity. Furthermore, REST is based on a small set of widely accepted standards, such as HTTP and XML and requires far fewer development steps, toolkits and execution engines than conventional SOAP web services.\r\n\r\nThis session covers the core concepts of REST and then walks through how to design and implement RESTful web services using three leading RESTful web service framewokrs, RESTlet, Spring MVC and NetKernel.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Jeremy Deane - RESTful Imaginarium.pdf","speakers":[{"createdDate":null,"version":2,"id":1289,"updatedDate":null,"bio":"[Jeremy Deane](http://www.jeremydeane.net) has over 17 years of software engineering experience in leadership positions. His expertise includes Enterprise Integration Architecture, Web Application Architecture, and Software Process Improvement. In addition, he is an accomplished speaker and technical author.","firstName":"Jeremy","lastName":"Deane","twitterId":"jtdeane","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"RESTful Imaginarium","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1291,"updatedDate":1411659466082,"audioLink":"","description":"In this session Greg Luck, founder of Ehcache and spec lead for JSR107 will walk you through this important new caching standard, which will form part of Java EE 7. You will learn:\r\n\r\n* Getting started\r\n* What caching is and when to apply it. \r\n* Abstract your caching implementation with javax.cache \r\n* Core API features \r\n* Optional features and how they are handled by implementers and users\r\n* Use the new caching annotations\r\n* Concurrency and consistency\r\n* Use the API before Java EE 7 is released within the Java SE, Java EE 6, and Spring environments \r\n* Demo using the Ehcache 3.0 implementation","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Greg Luck - JSR107.pdf","speakers":[{"createdDate":null,"version":2,"id":1005,"updatedDate":null,"bio":"Greg founded Ehcache in 2003. He regularly speaks at conferences, writes and codes. He has also founded and maintains the JPam and Spnego open source projects, which are security focused. Prior to joining Terracotta in 2009, Greg was Chief Architect at Wotif.com where he provided technical leadership as the company went from a single product startup to a billion dollar public company with multiple product lines. Before that Greg was a consultant for ThoughtWorks with engagements in the US and Australia in the travel, health care, geospatial, banking and insurance industries. Before doing programming, Greg managed IT. He was CIO at Virgin Blue, Tempo Services, Stamford Hotels and Resorts and Australian Resorts. He is a Chartered Accountant, and spent 7 years with KPMG in small business and insolvency. Greg holds a Bachelor of Commerce and a Masters in Information Technology.","firstName":"Greg","lastName":"Luck","twitterId":"gregrluck","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"JSR107: The new Java Caching Standard","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1317,"updatedDate":1411659466125,"audioLink":"","description":"Alternative databases continue to establish their role in the technology stack of the future—and for many, the technology stack of the present. Making mature engineering decisions about when to adopt new products is not easy, and requires that we learn about them both from an abstract perspective and from a very concrete one as well. If you are going to recommend a NoSQL database for a new project, you're going to have to look at code.\r\n\r\nIn this talk, we'll examine three important contenders in the NoSQL space: Cassandra, MongoDB, and Neo4J. We'll review their data models, scaling paradigms, and query idioms. Most importantly, we'll work through the exercise of modeling a real-world problem with each database, and look at the code and queries we'd use to implement real product features. Come to this session for a thorough and thoroughly practical smackdown between three important NoSQL products.\r\n\r\n**Per request, the presentation slides won't  be made available**.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1283,"updatedDate":null,"bio":"Tim is a full-stack generalist and passionate teacher who loves coding, presenting, and working with people. He believes the best developer is one who is well-informed of specifics and can also make deep connections between software development and the broader world. He has recently been exploring non-relational data stores, build systems, and how software architecture should resemble an ant colony.\r\n\r\nHis firm, the [August Technology Group](http://augusttechgroup.com), helps clients with product development, technology consulting, and technology upgrade projects on the JVM. The August Group's technology preferences reflect the generalist sensibilities of its founder, and its development practices are always lightweight, self-improving, and humanizing by design.\r\n\r\nTim is a speaker internationally and on the [No Fluff Just Stuff](http://nofluffjuststuff.com) tour in the United States, and is co-president of the [Denver Open Source User Group](http://denveropensource.org), author of the open-source [Groovy Liquibase DSL](http://github.com/tlberglund/groovy-liquibase), co-author of the [DZone Clojure RefCard](http://refcardz.dzone.com/refcardz/functional-programming-clojure), co-presenter of the best-selling [O'Reilly Git Master Class](http://bit.ly/ogitvid), co-author of [Building and Testing with Gradle](http://www.amazon.com/dp/144930463X), and a member of the [O'Reilly Expert Network](http://oreilly.com/pub/expert/timberglund).\r\n\r\nHe lives in Littleton, CO with the wife of his youth and their three children. ","firstName":"Tim","lastName":"Berglund","twitterId":"tlberglund","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"NoSQL Smackdown 2012","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1333,"updatedDate":1411659466180,"audioLink":"","description":"JodaTime is Java Date/Time and Calendering done right. There are many problems with the original Date/Time API that came prepackaged in the early Java days. There are even more problems with the subsequent Calendar API.\r\n\r\nOne of the obvious issues is that Calendar is mutable and can unintentionally be changed. Another issue is that constructing Calendars in Java involves setting certain fields at certain times during coding, but not always getting the expected result. Joda Time repairs those issues and offers a robust and immutable date, time, and duration API. In Joda Time and a Brief History of the World, I provide a quick rundown of calendaring throughout the centuries, describe UTC, compare UTC to GMT, discuss how time is calculated, and then dive into Joda Time in every popular JVM language. The end result provides the audience with compelling proof that Joda Time should always be their Date Time API of choice.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1331,"updatedDate":1418596125825,"bio":"Daniel Hinojosa has been a self-employed developer, teacher and speaker for private business, education, and government since 1999. Daniel also actively teaches programming for the University of New Mexico Continuing Education.\r\n\r\nDaniel is a Pomodoro Technique practitioner and is co-founder of the Albuquerque Java User’s Group in Albuquerque, New Mexico. When he’s not supporting other local Java developers, Daniel spends most of his waking hours developing in and around the Java ecosystem, encompassing multiple languages and frameworks. He is author for the upcoming book ‘Testing in Scala’ and is the latest member of the No Fluff Just Stuff tour.","firstName":"Daniel","lastName":"Hinojosa","twitterId":"dhinojosa","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Joda Time and a Brief History of the World","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1354,"updatedDate":1411659466191,"audioLink":"","description":"Using Factories of various abstractions, facades, and other patterns are not the only way to decouple dependencies and isolate code. A more idiomatic approach is events.  All applications revolve around message passing. Passing bits to info within and outside of objects is the biggest job in any application. Message passing is typically accomplished using function and method calls. I send you a bit of information, you churn on it and send me something back and round and round we go.\r\n\r\nTight coupling happens because the code needs to have a live instantiation of another object so it can send it a message and maybe get a reply. These locally instantiated objects cause problems for coupling, modularity, and testability.\r\n\r\nThere is another way to pass messages to objects besides function calls: events. Javascript has excellent built-in native support for eventing thanks to the DOM.\r\n\r\nEmitting events instead of making function calls obviously works best with global objects like utilizing AOP like logging, debugging, and code statistics that have no return values. However events can be used more deeply throughout a web application and we will see how events can play a much more centralized role in any web application.","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1351,"updatedDate":null,"bio":"I have been writing and testing code for over 20 years. From humble as a Computer Science/Philosophy double major at UC San Diego, to working at both startups (IPivot) and large corporations (Qualcomm, Intel, Redback Networks, Juniper Networks, and currently Yahoo!), I have always been dedicated to code quality. Currently as a Senior Principal Front End Engineer on the Yahoo Mail team, I help spearhead testing and quality for the latest rewrite of Yahoo Mail. I have spoken at several internal and\r\nexternal conferences (Yahoo TechPulse 2010 and 2011, Yahoo's Front End Summit, and at YUIConf 2011) about Testable Javascript and am the author of the Open Source Javascript Unit Test Environment ([https://github.com/zzo/JUTE](https://github.com/zzo/JUTE)) and EventHub ([https://github.com/zzo/EventHub](https://github.com/zzo/EventHub)).","firstName":"Mark Ethan","lastName":"Trostler","twitterId":"zzoass","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Event-Driven Architectures","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1329,"updatedDate":1411659466140,"audioLink":"","description":"If you are developing software and getting paid for it, software process is part of your life. Even the absence of a defined process is a process of sorts. For over forty years the world of software development has been churning through forms of process, with each successor disclaiming the validity of its forebears to the cheers of those liberated from the oppressive chains of process past.\r\n\r\nBut if the latest acclaimed process is the answer, why do so many groups slough off what seemed to be working well a scant few years ago in favor of yet another choice? Furthermore, the time between process changes gets shorter and shorter. Waterfall reigned for ages, then RUP, then Scrum and XP, and now Lean/Kanban, each enjoying successively shorter seasons of favor as the de facto choice.\r\n\r\nProcess is but a framework to facilitate the collaboration of a group of people to produce a desired outcome. It is not a substitute for culture, technical excellence, discipline, and product strategy.\r\n\r\nIn this keynote, Barry emphasizes the need to continue thinking critically about the processes and practices we embrace, accounting for the context in which they exist, and the importance of reflection and refinement at both the organizational and personal levels.","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1023,"updatedDate":null,"bio":"Barry has played various roles in his 17 years in the software industry, including lone developer, team lead, director, and Agile coach and mentor. Barry is one of the few native Atlantans, currently specializing in coaching and mentoring for Agile software development in addition to doing contract software development. Over the years, he has developed on multiple platforms, focusing primarily on Microsoft technologies and then Java from 2003 onward. He views technology as a set of tools, and embraces the use of dynamic as well as statically-typed languages, procedural, object-oriented, and functional programming, each having their own strengths in a given problem domain.\r\n\r\nPrior to his career in software, Barry Hawkins spent 10 years designing, selling, and delivering turn-key industrial packaging and marking systems into manufacturing plants throughout the southeastern United States. He was responsible for the implementation, maintenance, and support of every system he sold, which was a formative experience that continues to influence his approach to consulting and coaching.","firstName":"Barry","lastName":"Hawkins","twitterId":"barryhawkins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"How We Got Here, And What To Do About It","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1369,"updatedDate":1411659466213,"audioLink":"","description":"Before the web, software developers implemented what we now refer to as desktop applications, using powerful graphics APIs that gave them the ability to program pretty much anything they could imagine. Then along came browsers with virtually no standard graphics support at all. Enter boring web applications, and dull work for developers.\r\n\r\nBut now, with HTML5 Canvas, developers have a powerful graphics API that lets them develop mind-blowing applications. Now you can implement desktop-like applications that run in a browser. In this session, you?ll see how.\r\n\r\nThis talk is a demo-fueled, fast-paced introduction to HTML5 Canvas. You?ll get an overview of the Canvas API, and see how you can use it to draw, manipulate images, and implement sprite-based animation. You will get a feel for what you can do with this powerful API, and you?ll get a basic understanding of how to harness that power.\r\n","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1368,"updatedDate":null,"bio":"A long-time best-selling author, instructor, and speaker, David is the author of Core HTML5 Canvas, published by Prentice-Hall in 2012 and four best-selling Java books including one of the best-selling Java books of all time, Graphic Java, and the best-selling books on both Java component frameworks: Swing and JavaServer Faces (JSF). David also writes regularly for IBM's developerworks online where his articles on JSF and HTML5 have collectively drawn nearly one million page views. \r\n\r\nDavid has spoken at hundreds of conferences around the world, including DevNexus, OSCON, Strange Loop, JavaOne, Devoxx, JAOO. David spoke on the highly regarded No Fluff Just Stuff tour for more than six years. He is a three-time JavaOne Rock Star, a designation awarded to the top rated speakers from the JavaOne conference.\r\n\r\nIn 2011 David founded the HTML5 Denver Meetup, which has become one of the most successful meetup groups in the Rockies with over 800 members.\r\n","firstName":"David","lastName":"Geary","twitterId":"davidgeary","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Mind-blowing apps with HTML5 Canvas","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1356,"updatedDate":1411659466217,"audioLink":"","description":"In early 2001, \"Agile\" was coined as the umbrella term for Scrum, XP, ASD, Crystal, and a few other methodologies. In 2003, Mary and Tom Poppendieck published the book \"Lean Software Development: An Agile Toolkit\", and the term Lean Software Development became known among a subset of the larger Agile community.\r\n\r\nFor years, one could assume that any development group trying to improve its approach to software was applying some form of Agile Software Development methodology. In the last couple of years, Lean Software Development has seen a surge in popularity. Some groups adopting Lean perceive it as an alternative to Agile processes like Scrum, and express a sense of elitism and superiority, having \"moved beyond Agile\".\r\n\r\nWhile Agile Software Development and Lean Software Development originate from different sources, they are actually closely related and share a great deal of overlap. In this talk attendees will discover where each came from, and just how much of Agile and Lean are shared in the space between.\r\n\r\n**This presentation did not take place and consequently the presentation slides are not available**","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1023,"updatedDate":null,"bio":"Barry has played various roles in his 17 years in the software industry, including lone developer, team lead, director, and Agile coach and mentor. Barry is one of the few native Atlantans, currently specializing in coaching and mentoring for Agile software development in addition to doing contract software development. Over the years, he has developed on multiple platforms, focusing primarily on Microsoft technologies and then Java from 2003 onward. He views technology as a set of tools, and embraces the use of dynamic as well as statically-typed languages, procedural, object-oriented, and functional programming, each having their own strengths in a given problem domain.\r\n\r\nPrior to his career in software, Barry Hawkins spent 10 years designing, selling, and delivering turn-key industrial packaging and marking systems into manufacturing plants throughout the southeastern United States. He was responsible for the implementation, maintenance, and support of every system he sold, which was a formative experience that continues to influence his approach to consulting and coaching.","firstName":"Barry","lastName":"Hawkins","twitterId":"barryhawkins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Agile, Lean, and the Space Between","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1372,"updatedDate":1411659466250,"audioLink":"","description":"Android 4.0 is a new world for Android, and for many developers who did not track with the changes to Honeycomb, represents a new UI metaphor. In this session we will look at the new UI metaphor and the APIs to work with it, including the ActionBar and Fragments, which allow you to recompose your UI for multiple screen profiles. We will also review the new Android human interface guide to see how these should be used.\r\n\r\nAdditionally, we will look at other new APIs that can be used to enhance the functionality of your application, including interactive Notifications, Drag and Drop, NFC and WiFi Direct.","presentationLink":"http://www.slideshare.net/kebernet/whats-new-in-android","speakers":[{"createdDate":null,"version":1,"id":1370,"updatedDate":null,"bio":"Robert Cooper is a developer based in Atlanta where he develops telemedicine apps at Reach Heath. He is the author of GWT in Practice and a contributor to a number of open source projects including Shortyz Crosswords for Android.","firstName":"Robert","lastName":"Cooper","twitterId":"kebernet","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"What's new in Android","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1337,"updatedDate":1411659466258,"audioLink":"","description":"This talk will describe the Cloud Foundry Open PaaS (Platform as a Service), with its open source, multi-framework, multi-service, multi-cloud model, and will explain in depth how to use Cloud Foundry services effectively from Java/Spring applications. Cloud Foundry allows developers to provision apps in Java/Spring, Ruby/Rails, Ruby/Sinatra, Javascript/Node, and leverage services like MySQL, MongoDB, Reddis, Postgres and RabbitMQ. It can be used as a public PaaS on CloudFoundry.com and other service providers (ActiveState, AppFog), to create your own private cloud, or on your laptop using the Micro Cloud Foundry VM. Attendees will be introduced to the tools available for Spring application developers using Cloud Foundry: STS (Spring Tool Suite) Cloud Foundry Plugin, the Cloud Foundry Maven plugin or the vmc command line. Attendees will be introduced to how Cloud Foundry exposes service information to applications, and the various options Spring app developers have to leverage these services: \r\n\r\n* using the auto-reconfiguration mechanism that allows using services without any modifications to the app\r\n* using the \"cloud\" namespace to have an explicit control over consuming services\r\n* combining the profile support in Spring 3.1 with the \"cloud\" namespace to create applications that allow explicit control over services, while allowing applications to run locally or in Cloud Foundry without any change.\r\n\r\nThe talk will include demos of the Spring app development lifecycle with Cloud Foundry: local development with STS, local deployment to Micro Cloud Foundry for testing, deployment to [CloudFoundry.com](http://www.cloudfoundry.com/).","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Josh Long - Spring and Cloud Foundry.pdf","speakers":[{"createdDate":null,"version":4,"id":1284,"updatedDate":1417211686772,"bio":"Josh Long is the Spring Developer Advocate. Josh is the lead author on Apress’ Spring Recipes, 2nd Edition, the O'Reilly \"Pro Spring Roo\" book, the Pearson \"Livelessons for Spring\" and a committer on several Spring projects and the Activiti BPMN framework. When he’s not hacking on code, he can be found at the local Java User Group or at the local coffee shop. Josh likes solutions that push the boundaries of the technologies that enable them. Josh's interests include big-data, mobile, REST, NoSQL and integration. He blogs on the [Spring blog](http://spring.io/team/jlong) and [on his personal blog](http://joshlong.com).\r\n","firstName":"Josh","lastName":"Long","twitterId":"starbuxman","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Spring and Cloud Foundry, a Marriage Made in Heaven","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]}],"numberOfPresentations":51},"event":{"createdDate":null,"version":1,"id":1169,"updatedDate":null,"eventKey":"devnexus2012","title":"DevNexus 2012","current":false,"presentations":[{"createdDate":null,"version":3,"id":1372,"updatedDate":1411659466250,"audioLink":"","description":"Android 4.0 is a new world for Android, and for many developers who did not track with the changes to Honeycomb, represents a new UI metaphor. In this session we will look at the new UI metaphor and the APIs to work with it, including the ActionBar and Fragments, which allow you to recompose your UI for multiple screen profiles. We will also review the new Android human interface guide to see how these should be used.\r\n\r\nAdditionally, we will look at other new APIs that can be used to enhance the functionality of your application, including interactive Notifications, Drag and Drop, NFC and WiFi Direct.","presentationLink":"http://www.slideshare.net/kebernet/whats-new-in-android","speakers":[{"createdDate":null,"version":1,"id":1370,"updatedDate":null,"bio":"Robert Cooper is a developer based in Atlanta where he develops telemedicine apps at Reach Heath. He is the author of GWT in Practice and a contributor to a number of open source projects including Shortyz Crosswords for Android.","firstName":"Robert","lastName":"Cooper","twitterId":"kebernet","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"What's new in Android","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1354,"updatedDate":1411659466191,"audioLink":"","description":"Using Factories of various abstractions, facades, and other patterns are not the only way to decouple dependencies and isolate code. A more idiomatic approach is events.  All applications revolve around message passing. Passing bits to info within and outside of objects is the biggest job in any application. Message passing is typically accomplished using function and method calls. I send you a bit of information, you churn on it and send me something back and round and round we go.\r\n\r\nTight coupling happens because the code needs to have a live instantiation of another object so it can send it a message and maybe get a reply. These locally instantiated objects cause problems for coupling, modularity, and testability.\r\n\r\nThere is another way to pass messages to objects besides function calls: events. Javascript has excellent built-in native support for eventing thanks to the DOM.\r\n\r\nEmitting events instead of making function calls obviously works best with global objects like utilizing AOP like logging, debugging, and code statistics that have no return values. However events can be used more deeply throughout a web application and we will see how events can play a much more centralized role in any web application.","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1351,"updatedDate":null,"bio":"I have been writing and testing code for over 20 years. From humble as a Computer Science/Philosophy double major at UC San Diego, to working at both startups (IPivot) and large corporations (Qualcomm, Intel, Redback Networks, Juniper Networks, and currently Yahoo!), I have always been dedicated to code quality. Currently as a Senior Principal Front End Engineer on the Yahoo Mail team, I help spearhead testing and quality for the latest rewrite of Yahoo Mail. I have spoken at several internal and\r\nexternal conferences (Yahoo TechPulse 2010 and 2011, Yahoo's Front End Summit, and at YUIConf 2011) about Testable Javascript and am the author of the Open Source Javascript Unit Test Environment ([https://github.com/zzo/JUTE](https://github.com/zzo/JUTE)) and EventHub ([https://github.com/zzo/EventHub](https://github.com/zzo/EventHub)).","firstName":"Mark Ethan","lastName":"Trostler","twitterId":"zzoass","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Event-Driven Architectures","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1350,"updatedDate":1411659466202,"audioLink":"","description":"JBoss by Red Hat contributes to numerous OSS projects and the overall open source ecosystem is constantly producing new tools, frameworks, engines and techniques. If you are \"building your stack\" for your next project, trying to navigate the vast OSS world can be a bewildering and complex undertaking. In this session, we will highlight some key technologies that have a tremendous impact on the typical enterprise application. Most importantly we will provide guidance into how JBoss is making your custom application development more productive.\r\n\r\nSome of the technologies to be seen via live demonstrations:\r\n\r\n* Eclipse+JBoss Tools = JBDS\r\n* Maven usage with JBoss\r\n* HTML5/Mobile solutions\r\n* Errai for Google Web Toolkit (GWT)\r\n* RichFaces - JavaServer Faces (JSF)\r\n* jBPM\r\n\r\nVideo recording of this session available at: \r\n\r\nhttp://vimeo.com/39948488\r\n","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Burr Sutter - JBossGalaxy_Published.pdf","speakers":[{"createdDate":null,"version":4,"id":1349,"updatedDate":1420263676473,"bio":"Burr Sutter is responsible for Red Hat JBoss middleware developer tooling and frameworks and is  specifically focused on technologies such as Java EE, Spring, PaaS, HTML5 and Apache Cordova.  Burr's passion is learning, teaching and demonstrating developer facing technologies. \r\nHe has previously been the President of the Atlanta Java Users Group, founder of the DevNexus conference, founder of the Atlanta chapter of the IASA and an Oracle Java Champion. ","firstName":"Burr","lastName":"Sutter","twitterId":"burrsutter","googlePlusId":"+BurrSutter","linkedInId":"burrsutter","lanyrdId":"","githubId":"burrsutter"}],"title":"The Hitchhiker's Guide to the JBoss Galaxy","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1341,"updatedDate":1411659466050,"audioLink":"","description":"A hands on introduction to the one non-JVM framework you need to know.\r\n\r\nIf you need to scale large numbers of relatively lightweight requests, node.js is a technology you need to understand. We'll look at the use cases, the strengths and weaknesses, how to get started with node.js and how to test and deploy your node.js applications effectively.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Peter Bell - Getting started with nodejs.pdf","speakers":[{"createdDate":null,"version":3,"id":1294,"updatedDate":1390408236167,"bio":"Peter is a contract member of the GitHub training team, the co-founder and CTO of Speak Geek, helping business people to hire and manage developers more effectively, the co-founder of CTO school and a regular presenter on a range of technologies - from chef to Neo4j.\r\n\r\nHe has presented at a range of conferences including DLD conference, ooPSLA, DevNexus, QCon NY, QCon SF, RubyNation, SpringOne2GX, Code Generation, Practical Product Lines, the British Computer Society Software Practices Advancement conference, GraphConnect, cf.Objective(), CF United, Scotch on the Rocks, WebDU, WebManiacs, UberConf, the Rich Web Experience and the No Fluff Just Stuff Enterprise Java tour. He has been published in IEEE Software, Dr. Dobbs, IBM developerWorks, Information Week, Methods & Tools, Mashed Code, the Open Source Journal, NFJS the Magazine and GroovyMag.","firstName":"Peter","lastName":"Bell","twitterId":"peterbell","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Getting started with node.js","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1320,"updatedDate":1411659466262,"audioLink":"","description":"Perhaps you've already heard of some of the new features like flash attributes, code-based configuration, partial validation with Hibernate Validator 4.2, and many others. This talk aims to be your comprehensive source of all that you can take advantage of in this release. We'll use code snippets, provide pointers, and highlight the things you need to know without spending too much time on individual topics. At the end we'll discuss what's in store for Spring MVC 3.2.","presentationLink":"https://github.com/rstoyanchev/spring-mvc-31-walkthrough","speakers":[{"createdDate":null,"version":6,"id":1285,"updatedDate":1420264261788,"bio":"Rossen is a committer on the Spring Framework team with a strong focus on web development including Spring MVC and WebSocket messaging. Previously Rossen consulted and trained Spring teams for several years. He has been involved with Java and web development in various industries and domains since the mid 90s.\r\n","firstName":"Rossen","lastName":"Stoyanchev","twitterId":"rstoya05","googlePlusId":"116853920244172849367","linkedInId":"","lanyrdId":"rstoyanchev","githubId":"rstoyanchev"}],"title":"Spring MVC 3.1 Walkthrough","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1332,"updatedDate":1411659466105,"audioLink":"","description":"The presentation covers the Guava library developed by Google (http://code.google.com/p/guava-libraries/). Guava provides collection extensions to the Java Collection API and, along with this, a cornucopia of time-saving utilities that bring Java as close as possible to some of the more functional and dynamic language competitors like Scala, Ruby, and Clojure. The presentation focuses on the following topics: how to make Predicates and Functions; how to use new collection constructs that make life easier, including MultiMap, BiMaps, and MultiSets; how to set up and use Guava preconditions; and how to create truly immutable collections, and more. All of this is done with Java.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1331,"updatedDate":1418596125825,"bio":"Daniel Hinojosa has been a self-employed developer, teacher and speaker for private business, education, and government since 1999. Daniel also actively teaches programming for the University of New Mexico Continuing Education.\r\n\r\nDaniel is a Pomodoro Technique practitioner and is co-founder of the Albuquerque Java User’s Group in Albuquerque, New Mexico. When he’s not supporting other local Java developers, Daniel spends most of his waking hours developing in and around the Java ecosystem, encompassing multiple languages and frameworks. He is author for the upcoming book ‘Testing in Scala’ and is the latest member of the No Fluff Just Stuff tour.","firstName":"Daniel","lastName":"Hinojosa","twitterId":"dhinojosa","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Making Java Bearable with Guava","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1355,"updatedDate":1411659466198,"audioLink":"","description":"The Gradle build tool is one of the most successful projects in the Groovy ecosystem because it addresses a difficult problem -- every major build is a custom build. Gradle builds are written in Groovy, so the full power of the language is available if you need it. Gradle supports Maven project structure, repositories, and processes without being bound by its limitations. This talk will cover the basics of Gradle both through simple projects and by examining the build files for other open source projects. With major systems like Grails, Hibernate, and even the Spring Framework moving to Gradle, this is a technology worth taking the time to understand.\r\n","presentationLink":"","speakers":[{"createdDate":null,"version":5,"id":1323,"updatedDate":1420264607612,"bio":"Ken Kousen is President of Kousen IT, Inc, through which he does software development and technical training in all areas related to Java, especially open source topics like Android, Spring, Hibernate, Groovy, and Grails. He is the author of the book \"Making Java Groovy\" from Manning (http://manning.com/kousen/) and the book \"Gradle for Android\", upcoming from O'Reilly.","firstName":"Ken","lastName":"Kousen","twitterId":"kenkousen","googlePlusId":"+KennethKousen","linkedInId":"kenkousen","lanyrdId":"","githubId":"kousen"}],"title":"The Gradle Will Rock","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1307,"updatedDate":1411659466086,"audioLink":"","description":"Developers are facing a new era of development with HTML5 for both mobile and desktop environments. It was once laughable to put mobile focused development ahead of the desktop, but those days are over. Whether you’re focused only on mobile, desktop, or both, there are a few critical questions which must be answered:\r\n\r\n* Which platforms and browsers should I support?\r\n* Which HTML5 related specifications are available on those platforms?\r\n* How do I integrate existing enterprise services?\r\n* How do I test my app?\r\n\r\nWesley will attempt to answer these questions with the latest market data and live demos. Attendees will learn what it takes to build a scalable, enterprise, HTML5 based application for both desktop and mobile environments.\r\n\r\n**The slides are not available.**","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1024,"updatedDate":null,"bio":"Wesley Hales is a User Interface architect from Atlanta, GA. He has been involved in UI and User Experience roles for over a decade in both startup and enterprise environments. Wesley co-founded several enterprise frameworks during his 4.5 years at JBoss by Red Hat (including the JBoss Portlet Bridge and AeroGear projects) and also served as a co-founder of the recently acquired startup, InstaOps. He is now employed by Apigee as a software developer mainly focused on UI.\r\n\r\nOverall, Wesley enjoys creating world-class user interfaces and experiences that people fall in love with.\r\nYou can see him speak at the occasional conference, read his posts on [wesleyhales.com](http://wesleyhales.com), or follow him on twitter @wesleyhales.","firstName":"Wesley","lastName":"Hales","twitterId":"wesleyhales","googlePlusId":"114682255328371246824","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"The Fundamentals of Enterprise HTML5 Development","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1328,"updatedDate":1411659466168,"audioLink":"","description":"The success of the Java language and platform depends on community support and participation. Java is developed through the Java Community Process, which is open to all members of the Java community. Recent changes to the process, introduced in JSR 348, make it even easier for developers to observe and to participate in the work of the JCP.\r\n\r\nEven before these changes Java User Groups had begun to participate in the work of the JCP. Now that two JUGs (SouJava and the London Java Community) are represented on the JCP's Executive Committee we are beginning to explore ways in which the energy, enthusiasm, and expertise of the JUG community can be harnessed to further advance the Java platforms.\r\n\r\nMost developers understand the value of participating in open-source projects. This session will explain the benefits of participating in the JCP. We will explain how the JCP is is organized and how Java standards are developed. We will discuss the current state of the Java platforms, explain how the JCP is helping to evolve them, provide practical advice on how you can participate through your local Java User Group, and explain why participation is good for your career. \r\n\r\nBring your questions, your suggestions, and your concerns. We want to hear from you - the foundation of the Java community - and to explore new ideas for community participation.","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1282,"updatedDate":null,"bio":"Patrick Curran is Chair of the Java Community Process organization. In this role he oversees the activities of the JCP's Program Management Office including evolving the process and the organization, managing its membership, guiding specification leads and experts through the process, chairing Executive Committee meetings, and managing the [JCP.org web site](http://jcp.org/).\r\n\r\nPatrick has worked in the software industry for more than 25 years, and at Sun and then Oracle for 20 years. He has a long-standing record in conformance testing, and before joining the JCP he led the Java Conformance Engineering team in Sun's Client Software Group. He was also chair of Sun's Conformance Council, which was responsible for defining Sun's policies and strategies around Java conformance and compatibility.\r\n\r\nPatrick has participated actively in several consortia and communities including the [W3C](http://www.w3.org/) (as a member of the Quality Assurance Working Group and co-chair of the Quality Assurance Interest Group), and [OASIS](http://www.oasis-open.org/) (as co-chair of the Test Assertions Guidelines Technical Committee). Patrick's blog is [here](http://blogs.sun.com/pcurran/).","firstName":"Patrick","lastName":"Curran","twitterId":"","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Java User Groups and the Java Community Process: a winning combination","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1324,"updatedDate":1411659466058,"audioLink":"","description":"One easy way to add Groovy to existing Java systems is through testing. Writing tests in Groovy is easier than Java, without worrying about deploying Groovy in production. Groovy provides several capabilities to simplify testing, from GroovyTestCase and its subclasses to built-in mocks and stubs to the popular Spock framework. This talk will review the available options and demonstrate how to use them on combined Groovy and Java applications.","presentationLink":"","speakers":[{"createdDate":null,"version":5,"id":1323,"updatedDate":1420264607612,"bio":"Ken Kousen is President of Kousen IT, Inc, through which he does software development and technical training in all areas related to Java, especially open source topics like Android, Spring, Hibernate, Groovy, and Grails. He is the author of the book \"Making Java Groovy\" from Manning (http://manning.com/kousen/) and the book \"Gradle for Android\", upcoming from O'Reilly.","firstName":"Ken","lastName":"Kousen","twitterId":"kenkousen","googlePlusId":"+KennethKousen","linkedInId":"kenkousen","lanyrdId":"","githubId":"kousen"}],"title":"Testing Groovy and Java Systems","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1311,"updatedDate":1411659466094,"audioLink":"","description":"The Java SE platform has experienced a tremendous amount of positive evolution and adoption thanks to ongoing community participation. In this session, you'll learn about new features in the latest Java SE 7 release including Project Coin, Invoice Dynamic, Fork/Join Framework, and NIO.2. You will also learn about plans for major feature changes in Java SE 8 such as Project Lambda and Project Jigsaw. Lastly, an overview of the OpenJDK Community will be provided including community processes and structure, benefits for participants and the entire Java Ecosystem, and finally referencing exemplary model participants as examples and summarizing their driving forces for participation. This session will be relevant to both technical audiences wanting to learn more about Java SE and the OpenJDK community structure.","presentationLink":"","speakers":[{"createdDate":null,"version":1,"id":1310,"updatedDate":null,"bio":"Don brings worldwide enterprise software experience, ranging from small \"dot-com\" through Fortune 500 companies. Donald speaks regularly about Java, open source, community development, business models, business integration and software development politics at conferences and events worldwide including Java One, Oracle World, Sun Tech Days, Evans Developer Relations Conference, OOPSLA, JAOO, Server Side Symposium, Colorado Software Summit and others. Prior to returning to Oracle, Donald was Director of Ecosystem Development for the Eclipse Foundation, an independent not-for-profit foundation supporting the Eclipse open source community.","firstName":"Donald","lastName":"Smith","twitterId":"DonaldOJDK","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"The Java SE Platform: Rebuilding Momentum","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1316,"updatedDate":1411659466098,"audioLink":"","description":"This is not a talk about speed coding, or writing thousands of lines of crappy code in a weekend.  This is a talk for software craftsman who test drive clean code, but who also have a nagging feeling:  “Man, I know I could be doing this faster.”  We’re going to discuss everything from touch typing, to keyboard shortcuts, to faster pair programming techniques, to hardware, to build automation, to staying in the zone, to caffeine consumption, to ergonomics, to music and headphone selection, refactoring, language and framework selection, tech debt management, rapid prototyping, whiteboard design sessions, back of napkin mockups, guerilla tactics for getting in front of requirements and staying there, and what to do when you’re 30 lines down a stack trace and someone wants to tell you about something funny their kid did over the weekend.","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1117,"updatedDate":1419716357006,"bio":"As I enter my 18th year of developing software, several recurring trends and forces have become obvious to me.  My day job as a technical lead affords me time in the evening to write articles and prepare talks around these trends and forces, all of which interest me greatly.  To date these talks include \"[The ROI of Refactoring](http://www.slideshare.net/NeilGreen1/the-roi-of-refactoring-lego-vs-playdoh)\", \"[Nothing Matters More Than Coding Fast](http://devnexus.com/static/2012/audio/105%20-%20Neil%20Green%20-%20Nothing%20matters%20more%20than%20coding%20fast.mp3)\", and most recently \"[Writing Custom DSLs](https://www.youtube.com/watch?v=lm4jEcnWeKI)\" - which was a sneaky way to speak about these trends and forces in the form of technical talk.  \r\n","firstName":"Neil","lastName":"Green","twitterId":"neilfeyn","googlePlusId":"","linkedInId":"neilgreen","lanyrdId":"","githubId":"ngreen77"}],"title":"Nothing matters more than coding fast","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1363,"updatedDate":1411659466228,"audioLink":"","description":"A talk on general best practices in Scala, taken from real world experience and examples in the book Scala In Depth.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1334,"updatedDate":1389373961466,"bio":"Josh Suereth is a Senior Software Engineer at Typesafe and the author of \"Scala In Depth\". He has been a Scala enthusiast ever since he came to know this beautiful language in 2007. He started his professional career as a software developer in 2004 using programming languages like C++, Perl and Java. In 2009 he began writing the book \"Scala In Depth\" which provides practical support for using Scala in every day applications. Josh regularly shares his expertise in articles and talks.","firstName":"Josh","lastName":"Suereth","twitterId":"jsuereth","googlePlusId":"116090704407622565882","linkedInId":"joshuasuereth","lanyrdId":"","githubId":""}],"title":"Effective Scala","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1291,"updatedDate":1411659466082,"audioLink":"","description":"In this session Greg Luck, founder of Ehcache and spec lead for JSR107 will walk you through this important new caching standard, which will form part of Java EE 7. You will learn:\r\n\r\n* Getting started\r\n* What caching is and when to apply it. \r\n* Abstract your caching implementation with javax.cache \r\n* Core API features \r\n* Optional features and how they are handled by implementers and users\r\n* Use the new caching annotations\r\n* Concurrency and consistency\r\n* Use the API before Java EE 7 is released within the Java SE, Java EE 6, and Spring environments \r\n* Demo using the Ehcache 3.0 implementation","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Greg Luck - JSR107.pdf","speakers":[{"createdDate":null,"version":2,"id":1005,"updatedDate":null,"bio":"Greg founded Ehcache in 2003. He regularly speaks at conferences, writes and codes. He has also founded and maintains the JPam and Spnego open source projects, which are security focused. Prior to joining Terracotta in 2009, Greg was Chief Architect at Wotif.com where he provided technical leadership as the company went from a single product startup to a billion dollar public company with multiple product lines. Before that Greg was a consultant for ThoughtWorks with engagements in the US and Australia in the travel, health care, geospatial, banking and insurance industries. Before doing programming, Greg managed IT. He was CIO at Virgin Blue, Tempo Services, Stamford Hotels and Resorts and Australian Resorts. He is a Chartered Accountant, and spent 7 years with KPMG in small business and insolvency. Greg holds a Bachelor of Commerce and a Masters in Information Technology.","firstName":"Greg","lastName":"Luck","twitterId":"gregrluck","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"JSR107: The new Java Caching Standard","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1303,"updatedDate":1411659466273,"audioLink":"","description":"You've heard about the extensibility of Java EE 6, and heard about CDI (Contexts and Dependency Injection). You may have also looked at Seam 3 or MyFaces CODI. You've seen enough to pique your curiosity. This session will sate that curiosity and give you enough information to build great extensions for your application and business.\r\n\r\nIn this session, Jason Porter, Senior Software Engineer at Red Hat and Apache DeltaSpike contributor, will cover creating extensions in Java EE 6 and show how using Apache DeltaSpike will ease some of the work.\r\n\r\n*The presentation sources are available at:*\r\n\r\nhttps://github.com/LightGuard/devnexus_2012_presentation","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1302,"updatedDate":1417211919523,"bio":"Jason is a software engineer currently working in the Java Enterprise Edition Space, Arquillian, Forge, web site and other developer experience projects within Red Hat. His specialties include JBoss AS, Seam, CDI, JSF, Java EE, and Gradle. He has worked with PHP, Ruby, Groovy, XSLT, SASS the rest of the web language arena (HTML, CSS, JS, etc). His current position as Senior Software Engineer at Red Hat has him work primarily on the JBoss website, however, he also contributes to JBoss Forge, Arquillian, Apache DeltaSpike, Awestruct and others as time allows. He's very interested in the developer experience and helping to improve it at all aspects.","firstName":"Jason","lastName":"Porter","twitterId":"lightguardjp","googlePlusId":"110049315339873366294","linkedInId":"jasonporter","lanyrdId":"lightguardjp","githubId":"LightGuard"}],"title":"Building CDI extensions using DeltaSpike","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1299,"updatedDate":1411659466061,"audioLink":"","description":"An introduction to working with PhoneGap. The main focus will be on Android development, but iOS will be discussed as well. I'll walk folks through the process of installing the necessary bits and how to create a PhoneGap project in Eclipse. I'll demonstrate PhoneGap running on real devices.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Raymond Camden - Introduction to PhoneGap Mobile Development.zip","speakers":[{"createdDate":null,"version":1,"id":1297,"updatedDate":null,"bio":"Raymond Camden is a senior developer evangelist for Adobe. His work focuses on web standards, mobile development and ColdFusion. He's a published author and presents at conferences and user groups on a variety of topics. Raymond can be reached at his blog (http://www.raymondcamden.com/), @cfjedimaster on Twitter, or via email at raymondcamden@gmail.com.","firstName":"Raymond","lastName":"Camden","twitterId":"cfjedimaster","googlePlusId":"115106614688778962135","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Introduction to PhoneGap Mobile Development","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1380,"updatedDate":1411659466240,"audioLink":"","description":"Apple's iPhone SDK has been the largest disruption to software development since the Web, sparking the creation in a few short years of the largest medium for consumer engagement in the world, eclipsing the Web, movies, and even television. While some prophesy that in the coming years mobile apps will be replaced by the web, in today's reality a number of high profile start-ups are bypassing the web entirely to reach their audience exclusively via apps. Join Ben as he discusses the role of the web in the mobile present and explore developer issues as we head into the post-PC era.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Ben Galbraith - Web vs Apps.pdf","speakers":[{"createdDate":null,"version":3,"id":1054,"updatedDate":null,"bio":"Ben Galbraith, together with his long-time friend Dion Almaer, forms one-half of the dynamic \"Ben and Dion\" duo that founded Ajaxian.com, headed Developer Tools at Mozilla, ran Developer Relations at Palm and is now running mobile architecture and engineering at Walmart.com after being acquired along with their start-up team in early 2011. Ben's been writing code since he was six and starting businesses since he was ten; he's written books, given hundreds of award-winning presentations world-wide, produced a few technical conferences, sold three companies, and has held CEO, CIO, CTO, and Software Architect positions in the medical, publishing, media, consumer electronics, advertising, software and internet industries. He lives in Palo Alto with his wife and six children.\r\n","firstName":"Ben","lastName":"Galbraith","twitterId":"bgalbs","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Web vs. Apps","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1295,"updatedDate":1411659466046,"audioLink":"","description":"The world is a graph - and Neo4J can help you to interact with it. In this presentation we'll look at the strengths and weaknesses of graph databases and the kinds of use cases that they fit for. We'll then briefly look at graph based queries and how to get the best of both world using the cross store persistence capabilities of Spring Data.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Peter Bell - Neo4J - High Performance NoSQL Graph Database.pdf","speakers":[{"createdDate":null,"version":3,"id":1294,"updatedDate":1390408236167,"bio":"Peter is a contract member of the GitHub training team, the co-founder and CTO of Speak Geek, helping business people to hire and manage developers more effectively, the co-founder of CTO school and a regular presenter on a range of technologies - from chef to Neo4j.\r\n\r\nHe has presented at a range of conferences including DLD conference, ooPSLA, DevNexus, QCon NY, QCon SF, RubyNation, SpringOne2GX, Code Generation, Practical Product Lines, the British Computer Society Software Practices Advancement conference, GraphConnect, cf.Objective(), CF United, Scotch on the Rocks, WebDU, WebManiacs, UberConf, the Rich Web Experience and the No Fluff Just Stuff Enterprise Java tour. He has been published in IEEE Software, Dr. Dobbs, IBM developerWorks, Information Week, Methods & Tools, Mashed Code, the Open Source Journal, NFJS the Magazine and GroovyMag.","firstName":"Peter","lastName":"Bell","twitterId":"peterbell","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Neo4J - High Performance NoSQL Graph Database","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1340,"updatedDate":1411659466172,"audioLink":"","description":"So you think you've picked up enough JavaScript to be dangerous, but feel like the whole prototypical language thing is still a mystery. In this session, we'll go from basic JavaScript to advanced JavaScript. We'll discuss and code modular JavaScript with CommonJS. We'll look into the details of a prototype language and discuss things like parasitic inheritance. We'll also look at JavaScript libraries that will help you get the most out of JavaScript - not jQuery, but a library like UnderscoreJS and SugarJS.\r\n\r\nThis is a fast paced session meant to bring you up to speed with the latest and greatest JavaScript techniques and tools. Whether you're building client side JavaScript with HTML5 or Appcelerator Titanium, or server-side JavaScript with node.js, you'll come away with knowledge and patterns for how the pro's use JavaScript for building real apps.","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"}],"title":"Advanced JavaScript for Java Devs","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1321,"updatedDate":1411659466266,"audioLink":"","description":"This presentation is for seasoned Spring MVC developers and for those curious to make the most of the release. Rather than faithfully covering every change, we'll take a deeper look at the new @MVC infrastructure classes, what has motivated the changes and what possibilities they have created. We'll discuss pros and cons of the MVC Java config and the MVC namespace and we'll see how to make advanced customizations with each. We'll show examples of testing annotated controllers with the new spring-mvc-test project available on github, and more. Last but not least we'll allow time for questions and discuss what's planned for Spring MVC 3.2.","presentationLink":"https://github.com/rstoyanchev/spring-mvc-31-indepth","speakers":[{"createdDate":null,"version":6,"id":1285,"updatedDate":1420264261788,"bio":"Rossen is a committer on the Spring Framework team with a strong focus on web development including Spring MVC and WebSocket messaging. Previously Rossen consulted and trained Spring teams for several years. He has been involved with Java and web development in various industries and domains since the mid 90s.\r\n","firstName":"Rossen","lastName":"Stoyanchev","twitterId":"rstoya05","googlePlusId":"116853920244172849367","linkedInId":"","lanyrdId":"rstoyanchev","githubId":"rstoyanchev"}],"title":"An In-depth Look At Spring MVC 3.1","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1333,"updatedDate":1411659466180,"audioLink":"","description":"JodaTime is Java Date/Time and Calendering done right. There are many problems with the original Date/Time API that came prepackaged in the early Java days. There are even more problems with the subsequent Calendar API.\r\n\r\nOne of the obvious issues is that Calendar is mutable and can unintentionally be changed. Another issue is that constructing Calendars in Java involves setting certain fields at certain times during coding, but not always getting the expected result. Joda Time repairs those issues and offers a robust and immutable date, time, and duration API. In Joda Time and a Brief History of the World, I provide a quick rundown of calendaring throughout the centuries, describe UTC, compare UTC to GMT, discuss how time is calculated, and then dive into Joda Time in every popular JVM language. The end result provides the audience with compelling proof that Joda Time should always be their Date Time API of choice.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1331,"updatedDate":1418596125825,"bio":"Daniel Hinojosa has been a self-employed developer, teacher and speaker for private business, education, and government since 1999. Daniel also actively teaches programming for the University of New Mexico Continuing Education.\r\n\r\nDaniel is a Pomodoro Technique practitioner and is co-founder of the Albuquerque Java User’s Group in Albuquerque, New Mexico. When he’s not supporting other local Java developers, Daniel spends most of his waking hours developing in and around the Java ecosystem, encompassing multiple languages and frameworks. He is author for the upcoming book ‘Testing in Scala’ and is the latest member of the No Fluff Just Stuff tour.","firstName":"Daniel","lastName":"Hinojosa","twitterId":"dhinojosa","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Joda Time and a Brief History of the World","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1308,"updatedDate":1411659466090,"audioLink":"","description":"I have talked to a lot of people about Ehcache over the years. What people find most valuable, and what stays with them, is the underlying caching theory - you can see the light bulb go on.\r\n\r\nIn this talk we will start with a performance problem and lead you through solving it with caching, discovering a long the way the problems of distributed caching and their solution. This will equip you with the tools to analyse a performance situation and to see whether a cache will help and what type of cache to apply.\r\n\r\nTopics include:\r\n\r\n* Why caching works\r\n* Standalone cache performance and effectiveness\r\n* Tiered Cache Design\r\n* N * Problem\r\n* Cache Cluster topologies\r\n* Cache Coherency Problem\r\n* CAP and PACELC constraints\r\n* Overcoming Java's limitations with BigMemory\r\n* Useful Cache Patterns","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Greg Luck - All About Caching.pdf","speakers":[{"createdDate":null,"version":2,"id":1005,"updatedDate":null,"bio":"Greg founded Ehcache in 2003. He regularly speaks at conferences, writes and codes. He has also founded and maintains the JPam and Spnego open source projects, which are security focused. Prior to joining Terracotta in 2009, Greg was Chief Architect at Wotif.com where he provided technical leadership as the company went from a single product startup to a billion dollar public company with multiple product lines. Before that Greg was a consultant for ThoughtWorks with engagements in the US and Australia in the travel, health care, geospatial, banking and insurance industries. Before doing programming, Greg managed IT. He was CIO at Virgin Blue, Tempo Services, Stamford Hotels and Resorts and Australian Resorts. He is a Chartered Accountant, and spent 7 years with KPMG in small business and insolvency. Greg holds a Bachelor of Commerce and a Masters in Information Technology.","firstName":"Greg","lastName":"Luck","twitterId":"gregrluck","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"All about Caching.","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1329,"updatedDate":1411659466140,"audioLink":"","description":"If you are developing software and getting paid for it, software process is part of your life. Even the absence of a defined process is a process of sorts. For over forty years the world of software development has been churning through forms of process, with each successor disclaiming the validity of its forebears to the cheers of those liberated from the oppressive chains of process past.\r\n\r\nBut if the latest acclaimed process is the answer, why do so many groups slough off what seemed to be working well a scant few years ago in favor of yet another choice? Furthermore, the time between process changes gets shorter and shorter. Waterfall reigned for ages, then RUP, then Scrum and XP, and now Lean/Kanban, each enjoying successively shorter seasons of favor as the de facto choice.\r\n\r\nProcess is but a framework to facilitate the collaboration of a group of people to produce a desired outcome. It is not a substitute for culture, technical excellence, discipline, and product strategy.\r\n\r\nIn this keynote, Barry emphasizes the need to continue thinking critically about the processes and practices we embrace, accounting for the context in which they exist, and the importance of reflection and refinement at both the organizational and personal levels.","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1023,"updatedDate":null,"bio":"Barry has played various roles in his 17 years in the software industry, including lone developer, team lead, director, and Agile coach and mentor. Barry is one of the few native Atlantans, currently specializing in coaching and mentoring for Agile software development in addition to doing contract software development. Over the years, he has developed on multiple platforms, focusing primarily on Microsoft technologies and then Java from 2003 onward. He views technology as a set of tools, and embraces the use of dynamic as well as statically-typed languages, procedural, object-oriented, and functional programming, each having their own strengths in a given problem domain.\r\n\r\nPrior to his career in software, Barry Hawkins spent 10 years designing, selling, and delivering turn-key industrial packaging and marking systems into manufacturing plants throughout the southeastern United States. He was responsible for the implementation, maintenance, and support of every system he sold, which was a formative experience that continues to influence his approach to consulting and coaching.","firstName":"Barry","lastName":"Hawkins","twitterId":"barryhawkins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"How We Got Here, And What To Do About It","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1356,"updatedDate":1411659466217,"audioLink":"","description":"In early 2001, \"Agile\" was coined as the umbrella term for Scrum, XP, ASD, Crystal, and a few other methodologies. In 2003, Mary and Tom Poppendieck published the book \"Lean Software Development: An Agile Toolkit\", and the term Lean Software Development became known among a subset of the larger Agile community.\r\n\r\nFor years, one could assume that any development group trying to improve its approach to software was applying some form of Agile Software Development methodology. In the last couple of years, Lean Software Development has seen a surge in popularity. Some groups adopting Lean perceive it as an alternative to Agile processes like Scrum, and express a sense of elitism and superiority, having \"moved beyond Agile\".\r\n\r\nWhile Agile Software Development and Lean Software Development originate from different sources, they are actually closely related and share a great deal of overlap. In this talk attendees will discover where each came from, and just how much of Agile and Lean are shared in the space between.\r\n\r\n**This presentation did not take place and consequently the presentation slides are not available**","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1023,"updatedDate":null,"bio":"Barry has played various roles in his 17 years in the software industry, including lone developer, team lead, director, and Agile coach and mentor. Barry is one of the few native Atlantans, currently specializing in coaching and mentoring for Agile software development in addition to doing contract software development. Over the years, he has developed on multiple platforms, focusing primarily on Microsoft technologies and then Java from 2003 onward. He views technology as a set of tools, and embraces the use of dynamic as well as statically-typed languages, procedural, object-oriented, and functional programming, each having their own strengths in a given problem domain.\r\n\r\nPrior to his career in software, Barry Hawkins spent 10 years designing, selling, and delivering turn-key industrial packaging and marking systems into manufacturing plants throughout the southeastern United States. He was responsible for the implementation, maintenance, and support of every system he sold, which was a formative experience that continues to influence his approach to consulting and coaching.","firstName":"Barry","lastName":"Hawkins","twitterId":"barryhawkins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Agile, Lean, and the Space Between","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1360,"updatedDate":1411659466269,"audioLink":"","description":"Many development shops have made the leap from RCS, Perforce, ClearCase, PVCS, CVS, BitKeeper or SourceSafe to the modern Subversion (SVN) version control system. But why not take the next massive stride in productivity and get on board with Git, a distributed version control system (DVCS). Jump ahead of the masses staying on Subversion, and increase your team's productivity, debugging effectiveness, flexibility in cutting releases, and repository redundancy at $0 cost. Understand how distributed version control systems are game-changers and pick up the lingo that will become standard in the next few years.\r\n\r\nIn this talk, we discuss the team changes that liberate you from the central server, but still conform to the corporate expectation that there's a central master repository. You'll get a cheat sheet for Git, and a trail-map from someone who's actually experienced the Subversion to Git transition.\r\n\r\n**Per request, the presentation slides won't  be made available**.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1283,"updatedDate":null,"bio":"Tim is a full-stack generalist and passionate teacher who loves coding, presenting, and working with people. He believes the best developer is one who is well-informed of specifics and can also make deep connections between software development and the broader world. He has recently been exploring non-relational data stores, build systems, and how software architecture should resemble an ant colony.\r\n\r\nHis firm, the [August Technology Group](http://augusttechgroup.com), helps clients with product development, technology consulting, and technology upgrade projects on the JVM. The August Group's technology preferences reflect the generalist sensibilities of its founder, and its development practices are always lightweight, self-improving, and humanizing by design.\r\n\r\nTim is a speaker internationally and on the [No Fluff Just Stuff](http://nofluffjuststuff.com) tour in the United States, and is co-president of the [Denver Open Source User Group](http://denveropensource.org), author of the open-source [Groovy Liquibase DSL](http://github.com/tlberglund/groovy-liquibase), co-author of the [DZone Clojure RefCard](http://refcardz.dzone.com/refcardz/functional-programming-clojure), co-presenter of the best-selling [O'Reilly Git Master Class](http://bit.ly/ogitvid), co-author of [Building and Testing with Gradle](http://www.amazon.com/dp/144930463X), and a member of the [O'Reilly Expert Network](http://oreilly.com/pub/expert/timberglund).\r\n\r\nHe lives in Littleton, CO with the wife of his youth and their three children. ","firstName":"Tim","lastName":"Berglund","twitterId":"tlberglund","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Git Going with Distributed Version Control","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1317,"updatedDate":1411659466125,"audioLink":"","description":"Alternative databases continue to establish their role in the technology stack of the future—and for many, the technology stack of the present. Making mature engineering decisions about when to adopt new products is not easy, and requires that we learn about them both from an abstract perspective and from a very concrete one as well. If you are going to recommend a NoSQL database for a new project, you're going to have to look at code.\r\n\r\nIn this talk, we'll examine three important contenders in the NoSQL space: Cassandra, MongoDB, and Neo4J. We'll review their data models, scaling paradigms, and query idioms. Most importantly, we'll work through the exercise of modeling a real-world problem with each database, and look at the code and queries we'd use to implement real product features. Come to this session for a thorough and thoroughly practical smackdown between three important NoSQL products.\r\n\r\n**Per request, the presentation slides won't  be made available**.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1283,"updatedDate":null,"bio":"Tim is a full-stack generalist and passionate teacher who loves coding, presenting, and working with people. He believes the best developer is one who is well-informed of specifics and can also make deep connections between software development and the broader world. He has recently been exploring non-relational data stores, build systems, and how software architecture should resemble an ant colony.\r\n\r\nHis firm, the [August Technology Group](http://augusttechgroup.com), helps clients with product development, technology consulting, and technology upgrade projects on the JVM. The August Group's technology preferences reflect the generalist sensibilities of its founder, and its development practices are always lightweight, self-improving, and humanizing by design.\r\n\r\nTim is a speaker internationally and on the [No Fluff Just Stuff](http://nofluffjuststuff.com) tour in the United States, and is co-president of the [Denver Open Source User Group](http://denveropensource.org), author of the open-source [Groovy Liquibase DSL](http://github.com/tlberglund/groovy-liquibase), co-author of the [DZone Clojure RefCard](http://refcardz.dzone.com/refcardz/functional-programming-clojure), co-presenter of the best-selling [O'Reilly Git Master Class](http://bit.ly/ogitvid), co-author of [Building and Testing with Gradle](http://www.amazon.com/dp/144930463X), and a member of the [O'Reilly Expert Network](http://oreilly.com/pub/expert/timberglund).\r\n\r\nHe lives in Littleton, CO with the wife of his youth and their three children. ","firstName":"Tim","lastName":"Berglund","twitterId":"tlberglund","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"NoSQL Smackdown 2012","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1337,"updatedDate":1411659466258,"audioLink":"","description":"This talk will describe the Cloud Foundry Open PaaS (Platform as a Service), with its open source, multi-framework, multi-service, multi-cloud model, and will explain in depth how to use Cloud Foundry services effectively from Java/Spring applications. Cloud Foundry allows developers to provision apps in Java/Spring, Ruby/Rails, Ruby/Sinatra, Javascript/Node, and leverage services like MySQL, MongoDB, Reddis, Postgres and RabbitMQ. It can be used as a public PaaS on CloudFoundry.com and other service providers (ActiveState, AppFog), to create your own private cloud, or on your laptop using the Micro Cloud Foundry VM. Attendees will be introduced to the tools available for Spring application developers using Cloud Foundry: STS (Spring Tool Suite) Cloud Foundry Plugin, the Cloud Foundry Maven plugin or the vmc command line. Attendees will be introduced to how Cloud Foundry exposes service information to applications, and the various options Spring app developers have to leverage these services: \r\n\r\n* using the auto-reconfiguration mechanism that allows using services without any modifications to the app\r\n* using the \"cloud\" namespace to have an explicit control over consuming services\r\n* combining the profile support in Spring 3.1 with the \"cloud\" namespace to create applications that allow explicit control over services, while allowing applications to run locally or in Cloud Foundry without any change.\r\n\r\nThe talk will include demos of the Spring app development lifecycle with Cloud Foundry: local development with STS, local deployment to Micro Cloud Foundry for testing, deployment to [CloudFoundry.com](http://www.cloudfoundry.com/).","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Josh Long - Spring and Cloud Foundry.pdf","speakers":[{"createdDate":null,"version":4,"id":1284,"updatedDate":1417211686772,"bio":"Josh Long is the Spring Developer Advocate. Josh is the lead author on Apress’ Spring Recipes, 2nd Edition, the O'Reilly \"Pro Spring Roo\" book, the Pearson \"Livelessons for Spring\" and a committer on several Spring projects and the Activiti BPMN framework. When he’s not hacking on code, he can be found at the local Java User Group or at the local coffee shop. Josh likes solutions that push the boundaries of the technologies that enable them. Josh's interests include big-data, mobile, REST, NoSQL and integration. He blogs on the [Spring blog](http://spring.io/team/jlong) and [on his personal blog](http://joshlong.com).\r\n","firstName":"Josh","lastName":"Long","twitterId":"starbuxman","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Spring and Cloud Foundry, a Marriage Made in Heaven","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1364,"updatedDate":1411659466209,"audioLink":"","description":"\"Big Data\" has all the marketing and buzzword glamour of \"Cloud\" or \"Social\" nowadays. But there are serious tools out there to handle serious amounts of data. As with any task, you should use the right tool for the job at hand. This talk will navigate the vast and growing Hadoop Ecosystem as well as some new entrants to the emerging realtime stream processing market. From ingest to batch processing to querying, from scaling to extending to visualizing, there are a lot of systems that could make their way into your application's stack. We will visit the more promising of these systems via case studies and real-world examples.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1125,"updatedDate":null,"bio":"Brad Anderson has been wrangling data for 20 years, more recently building and using non-relational data stores. He works as a solution architect, assisting clients in their use of MapR's technology-leading Hadoop distribution. Previously, Brad has worked on a large-scale video-on-demand platform, smart grid analytics, a real-time audience participation platform, helped Cloudant build their hosted NoSQL offering based on CouchDB, and organized the NoSQL East 2009 conference in Atlanta.","firstName":"Brad","lastName":"Anderson","twitterId":"boorad","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Large Scale Data Analysis Tools","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1348,"updatedDate":1411659466183,"audioLink":"","description":"This talk will introduce Native Client, covering the nuances of porting your existing C++ game. We'll talk about the application specific problems, how to deal with the Pepper Thread, along with platform APIs like FileIO, rendering and Audio. In addition we'll cover common issues with the Chrome Web store, distribution, and monetization. Finally, we'll be talking about exciting news and roadmaps for native client moving forward. If you're interested in NaCl, or want to learn more, this is the talk for you!","presentationLink":"","speakers":[{"createdDate":null,"version":0,"id":1346,"updatedDate":null,"bio":"Joel Webber is a co-creator of the Google Web Toolkit, and focuses on bringing the web to the cutting edge of interactive application development. When not hacking WebKit, wrestling compiler bugs, and dealing with browser quirks, he spends his spare time building games and graphics libraries. Prior to joining Google, he worked in mobile development and the game industry.","firstName":"Joel","lastName":"Webber","twitterId":"jgw","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Porting Your Game to the Web using NaCl","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1374,"updatedDate":1411659466236,"audioLink":"","description":"Join us for a technical how-to session on how to develop cloud ready iPhone and Android apps for the cloud. Let's skip having to learn three different languages and jumpstart the development process using what you already know. We'll utilize Appcelerator's Titanium IDE to create a native mobile application targeting multiple mobile platforms. Best of all we'll be running everything on on JBoss AS 7.1 with a MongoDB back-end. Nothing complicated, nothing convoluted. Just straight ahead mobile development goodness with Titanium, MongoDB, JBoss and OpenShift. What's OpenShift? It's Red Hat's free, auto-scaling platform-as-a-service for Java, Ruby, Perl, PHP and Python apps. Get started for free by signing up at [openshift.com](http://openshift.com/) with promo code: DEVNEXUS. Special bonus if you love beer, this session is for you!","presentationLink":"","speakers":[{"createdDate":null,"version":0,"id":1373,"updatedDate":null,"bio":"Mark Atwood is a Developer Evangelist for Red Hat OpenShift. He has been a long-time contributor to open source. His technology interests include Cloud Computing and NoSQL. He is the patch queue manager for MySQL Drizzle. He was the Senior Technology Advisor for Network.com at Sun Microsystems. He makes his home in Seattle USA.","firstName":"Mark","lastName":"Atwood","twitterId":"fallenpegasus","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Mobilize JBoss AS 7.1 - How to Develop Mobile Apps for the Cloud w/ OpenShift","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1343,"updatedDate":1411659465772,"audioLink":"","description":"It is easy to not see the forest for the trees with some architectural approaches and never realizing that the approach is the root cause for many problems faced. This talk focusses on the most common anti-patterns in architectural approach with real world examples and the real damage it does. Ram will discuss ideas that will help you spot them and mitigate them.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Ram Singaram - Architecture Anti-patterns.pdf","speakers":[{"createdDate":null,"version":2,"id":1342,"updatedDate":null,"bio":"Ram serves ThoughtWorks, Inc. as a Principal Consultant and currently heads up the Atlanta office. He was the head of Technology Consulting practice in North America. He plays the role of a Senior Architect and Technical Lead in the creation of large-scale distributed enterprise applications and the integration of disparate systems. Ram has served as a developer, technical lead and architect in high end solutions encompassing custom frameworks, systems integration and business to business solutions using various technologies. He has worked with large corporations and has mentored clients and team members on the best use of technology and Agile techniques. He speaks at conferences and at clients on various topics and also helps in technology assessments and pursuits. He has had over 19 years of experience with over 6 years in ThoughtWorks and has worked in the US, Canada, UK, Thailand and India. He is passionate about motorcycles and riding.\r\n\r\nYou can follow him on twitter at  http://twitter.com/ramsingaram","firstName":"Ram","lastName":"Singaram","twitterId":"ramsingaram","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Architecture Anti-patterns","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1313,"updatedDate":1411659466145,"audioLink":"","description":"Heroku is a Polyglot Cloud Application Platform that makes it easy to deploy Java, Play! and Scala apps on the cloud.  Deployment is as simple as doing a \"git push\". This session will teach you how to deploy and scale Java, Play! and Scala apps on Heroku.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - James Ward - Introduction to Heroku.pdf","speakers":[{"createdDate":null,"version":4,"id":1000,"updatedDate":null,"bio":"James Ward (http://www.jamesward.com) works for Typesafe where he teaches developers the Typesafe Stack (Play Framework, Scala, and Akka). James frequently presents at conferences around the world such as JavaOne, Devoxx, and many other Java get-togethers. Along with Bruce Eckel, James co-authored First Steps in Flex. He has also published numerous screencasts, blogs, and technical articles. Starting with Pascal and Assembly in the 80′s, James found his passion for writing code. Beginning in the 90′s he began doing web development with HTML, Perl/CGI, then Java. After building a Flex and Java based customer service portal in 2004 for Pillar Data Systems he became a Technical Evangelist for Flex at Adobe. In 2011 James became a Principal Developer Evangelist at Salesforce.com where he taught developers how to deploy apps on the cloud with Heroku. James Tweets as @_JamesWard and posts code at http://github.com/jamesward.","firstName":"James","lastName":"Ward","twitterId":"_JamesWard","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Introduction to Heroku","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1378,"updatedDate":1411659466243,"audioLink":"","description":"The cloud movement is no longer just buzz and hype. Organizations are increasingly planning cloud-based deployments. For greenfield development, the path is relatively clear, but what about existing apps? The monolithic multi-tier architecture so common for enterprise apps is not the best fit for the cloud. For one thing, the presentation layer is typically moving to the client side. With cloud-based messaging and NoSQL datastore options, the data access and integration layers might require renovation as well. Meanwhile the significant investment that a business would most like to salvage is in the service layer sandwiched in the middle. In this session, we'll explore this space while migrating a hypothetical application to run in the cloud. The starting point will be a fairly standard multi-tier Spring MVC application, and the end result will be a collection of services running in the cloud. We'll discuss REST, JSON, NoSQL, messaging, polyglot development, and modular architectures designed to run in a dynamic always-on environment.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Mark Fisher - Migrating Enterprise Apps to the Cloud.pdf","speakers":[{"createdDate":null,"version":3,"id":1149,"updatedDate":null,"bio":"Mark is the founder of the [Spring Integration](http://www.springintegration.org/) project. Currently at VMware, he continues to lead the Spring Integration team while exploring the intersection of big data and messaging. He has been a committer on a number of Spring projects, including the [Spring Framework](http://www.springsource.org/spring-framework) itself and [Spring AMQP](http://www.springsource.org/spring-amqp), which he co-founded. Mark speaks regularly at conferences and user groups about messaging, data, integration, and cloud computing.","firstName":"Mark","lastName":"Fisher","twitterId":"m_f_","googlePlusId":"","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Migrating Enterprise Apps to the Cloud: from monolith to modular","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1330,"updatedDate":1411659466176,"audioLink":"","description":"This session will provide an introductory overview of Android's architecture and the layout of an Android project. When building Android apps, you may want to take advantage of a third party library, like Spring Android. You can do this through the use of various Maven plugins and tools for enabling dependency management in your Android project. We will walk through how to set up and configure an Android project using Maven. Many applications consume data from various web services, and we will discuss how the Spring Android project can help. \r\n\r\nSpring Android provides an abstraction for consuming RESTful services and marshaling the requests and responses to JSON or XML. Lastly, Spring Android supports the use of Spring Social on Android, and we will discuss how Spring Social can help you connect your apps to OAuth protected services like Facebook and Twitter.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1127,"updatedDate":1418572160608,"bio":"Roy Clarkson is a software engineer at Pivotal where he works on Spring's open source projects. Roy is the Spring for Android project lead and is also an organizer of the Atlanta Spring User Group. As a long time resident of Atlanta, he studied computer science at Georgia Tech before beginning his career as a software engineer. He has worked as a professional software developer for many years, with a variety of languages and technologies. He has spent the last few years focusing on mobile application development, including iPhone, Android, and mobile web. Prior to that, he focused most of his time on web development. Roy has spoken at several conferences and user groups about Spring and mobile technologies.","firstName":"Roy","lastName":"Clarkson","twitterId":"royclarkson","googlePlusId":"","linkedInId":"","lanyrdId":"royclarkson","githubId":"royclarkson"}],"title":"Native Android Development with Spring Android","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1290,"updatedDate":1411659466069,"audioLink":"","description":"RESTful web services have become the preferred approach to synchronously integrating heterogeneous systems. The architectural style’s success is due in large part to its simplicity. Furthermore, REST is based on a small set of widely accepted standards, such as HTTP and XML and requires far fewer development steps, toolkits and execution engines than conventional SOAP web services.\r\n\r\nThis session covers the core concepts of REST and then walks through how to design and implement RESTful web services using three leading RESTful web service framewokrs, RESTlet, Spring MVC and NetKernel.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Jeremy Deane - RESTful Imaginarium.pdf","speakers":[{"createdDate":null,"version":2,"id":1289,"updatedDate":null,"bio":"[Jeremy Deane](http://www.jeremydeane.net) has over 17 years of software engineering experience in leadership positions. His expertise includes Enterprise Integration Architecture, Web Application Architecture, and Software Process Improvement. In addition, he is an accomplished speaker and technical author.","firstName":"Jeremy","lastName":"Deane","twitterId":"jtdeane","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"RESTful Imaginarium","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1298,"updatedDate":1411659466065,"audioLink":"","description":"An introductory look at the jQuery Mobile framework. The focus will be on using the framework on web sites, but I'll demonstrate using jQM within a Phonegap-wrapped application as well.","presentationLink":"","speakers":[{"createdDate":null,"version":1,"id":1297,"updatedDate":null,"bio":"Raymond Camden is a senior developer evangelist for Adobe. His work focuses on web standards, mobile development and ColdFusion. He's a published author and presents at conferences and user groups on a variety of topics. Raymond can be reached at his blog (http://www.raymondcamden.com/), @cfjedimaster on Twitter, or via email at raymondcamden@gmail.com.","firstName":"Raymond","lastName":"Camden","twitterId":"cfjedimaster","googlePlusId":"115106614688778962135","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Creating Mobile Friendly Sites with jQuery Mobile","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1357,"updatedDate":1411659466220,"audioLink":"","description":"This session will introduce you to building Android applications for the Google TV platform. You’ll learn what “Smart TV” is, or should be; what the landscape for multi-screen, multi-device development looks like; where Google TV fits and why it matters; how to build basic applications for Google TV; and some valuable tips about design and development practices for the big screen.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Charlie Collins - Building Apps for Google TV.pdf","speakers":[{"createdDate":null,"version":2,"id":1015,"updatedDate":null,"bio":"Charlie Collins is the Director of Technology at MOVL; an experienced java, mobile, and web developer; a contributor to several open source projects; and coauthor of Android in Practice, Unlocking Android, and GWT in Practice.","firstName":"Charlie","lastName":"Collins","twitterId":"CharlieCollins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Google TV Basics and Boundaries","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1318,"updatedDate":1411659466121,"audioLink":"","description":"Want to go deep on a popular NoSQL database? Cassandra is a scalable, highly available, column-oriented data store in use at Facebook, Twitter, Reddit, Rackspace, and other web-scale operations. It offers a compelling combination of a rich data model, a robust deployment track record, and a sound architecture, making it a good choice of NoSQL databases to study first.\r\n\r\nIn this session, we'll talk about Cassandra's data model, look at its query idioms, talk about how to deploy it, and look at use cases in which it is an appropriate data storage solution. We'll study its origins in the Amazon Dynamo project and Google's BigTable, and learn how its architecture helps us achieve the gold standard of scalability: horizontal scalability on commodity hardware. You'll leave prepared to begin experimenting with Cassandra immediately and planning its adoption in your next project.\r\n\r\n**Per request, the presentation slides won't  be made available**.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1283,"updatedDate":null,"bio":"Tim is a full-stack generalist and passionate teacher who loves coding, presenting, and working with people. He believes the best developer is one who is well-informed of specifics and can also make deep connections between software development and the broader world. He has recently been exploring non-relational data stores, build systems, and how software architecture should resemble an ant colony.\r\n\r\nHis firm, the [August Technology Group](http://augusttechgroup.com), helps clients with product development, technology consulting, and technology upgrade projects on the JVM. The August Group's technology preferences reflect the generalist sensibilities of its founder, and its development practices are always lightweight, self-improving, and humanizing by design.\r\n\r\nTim is a speaker internationally and on the [No Fluff Just Stuff](http://nofluffjuststuff.com) tour in the United States, and is co-president of the [Denver Open Source User Group](http://denveropensource.org), author of the open-source [Groovy Liquibase DSL](http://github.com/tlberglund/groovy-liquibase), co-author of the [DZone Clojure RefCard](http://refcardz.dzone.com/refcardz/functional-programming-clojure), co-presenter of the best-selling [O'Reilly Git Master Class](http://bit.ly/ogitvid), co-author of [Building and Testing with Gradle](http://www.amazon.com/dp/144930463X), and a member of the [O'Reilly Expert Network](http://oreilly.com/pub/expert/timberglund).\r\n\r\nHe lives in Littleton, CO with the wife of his youth and their three children. ","firstName":"Tim","lastName":"Berglund","twitterId":"tlberglund","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Radical NoSQL Scalability with Cassandra","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1369,"updatedDate":1411659466213,"audioLink":"","description":"Before the web, software developers implemented what we now refer to as desktop applications, using powerful graphics APIs that gave them the ability to program pretty much anything they could imagine. Then along came browsers with virtually no standard graphics support at all. Enter boring web applications, and dull work for developers.\r\n\r\nBut now, with HTML5 Canvas, developers have a powerful graphics API that lets them develop mind-blowing applications. Now you can implement desktop-like applications that run in a browser. In this session, you?ll see how.\r\n\r\nThis talk is a demo-fueled, fast-paced introduction to HTML5 Canvas. You?ll get an overview of the Canvas API, and see how you can use it to draw, manipulate images, and implement sprite-based animation. You will get a feel for what you can do with this powerful API, and you?ll get a basic understanding of how to harness that power.\r\n","presentationLink":"","speakers":[{"createdDate":null,"version":2,"id":1368,"updatedDate":null,"bio":"A long-time best-selling author, instructor, and speaker, David is the author of Core HTML5 Canvas, published by Prentice-Hall in 2012 and four best-selling Java books including one of the best-selling Java books of all time, Graphic Java, and the best-selling books on both Java component frameworks: Swing and JavaServer Faces (JSF). David also writes regularly for IBM's developerworks online where his articles on JSF and HTML5 have collectively drawn nearly one million page views. \r\n\r\nDavid has spoken at hundreds of conferences around the world, including DevNexus, OSCON, Strange Loop, JavaOne, Devoxx, JAOO. David spoke on the highly regarded No Fluff Just Stuff tour for more than six years. He is a three-time JavaOne Rock Star, a designation awarded to the top rated speakers from the JavaOne conference.\r\n\r\nIn 2011 David founded the HTML5 Denver Meetup, which has become one of the most successful meetup groups in the Rockies with over 800 members.\r\n","firstName":"David","lastName":"Geary","twitterId":"davidgeary","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Mind-blowing apps with HTML5 Canvas","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1326,"updatedDate":1411659466129,"audioLink":"","description":"Groovy has several ways to make web development easier. Groovlets are part of the language, are easy to use and deploy, and are the basis of larger frameworks like Gaelyk. Groovy also supports the new style of web development with micro-frameworks. One in particular is Ratpack, based on the Sinatra project in the Ruby world. Finally, there is Grails, the elegant combination of Groovy DSLs with Spring and Hibernate. This talk will demonstrate them all and discuss where each is useful and appropriate.","presentationLink":"","speakers":[{"createdDate":null,"version":5,"id":1323,"updatedDate":1420264607612,"bio":"Ken Kousen is President of Kousen IT, Inc, through which he does software development and technical training in all areas related to Java, especially open source topics like Android, Spring, Hibernate, Groovy, and Grails. He is the author of the book \"Making Java Groovy\" from Manning (http://manning.com/kousen/) and the book \"Gradle for Android\", upcoming from O'Reilly.","firstName":"Ken","lastName":"Kousen","twitterId":"kenkousen","googlePlusId":"+KennethKousen","linkedInId":"kenkousen","lanyrdId":"","githubId":"kousen"}],"title":"The Groovy Web: groovlets, Micro-frameworks, and Grails","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1287,"updatedDate":1411659466054,"audioLink":"","description":"Dart is a new structured programming language designed for the Web. In this talk, we’ll look at the motivation for Dart, language syntax and features, the Dart Editor, using the Dart JS compiler, and the Dart development cycle with frog server and Dartium. We’ll also look at improvements to the DOM, several sample apps built with Dart, and see how easy it is to use Dart with HTML5+CSS to create rich client applications that scale.","presentationLink":"http://www.dartlang.org/slides/2011/12/ajug/#1","speakers":[{"createdDate":null,"version":4,"id":1014,"updatedDate":null,"bio":"David Chandler works with the Google Developer Tools Team in Atlanta. An electrical engineer by training, Chandler got hooked on developing database Web applications in the days of NCSA Mosaic and has since written Web applications in a variety of languages, including C, perl, ksh, ColdFusion, Java, JSF, GWT, and now Dart. Prior to joining Google, Chandler worked on Internet banking applications with Intuit and launched a non-profit startup built with GWT and AppEngine. Chandler holds a patent on a method of organizing hierarchical data in a relational database and blogs about Java Web development at http://turbomanage.wordpress.com.","firstName":"David","lastName":"Chandler","twitterId":"drfibonacci","googlePlusId":"102717421433762219474","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Building Maintainable Web Apps with HTML5 and Dart","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1361,"updatedDate":1411659466224,"audioLink":"","description":"For a minor release, Spring Integration 2.1 delivers some major features. Channel Adapters are now available for AMQP-based messaging via RabbitMQ. Message Store implementations are now available for a number of NoSQL data stores, including GemFire, MongoDB, and Redis. Other noteworthy additions include JSR-223 scripting support, stored procedure adapters, and a new Content Enricher component. Attend this session to learn about these new features, and don't worry if you know nothing about Spring Integration yet, we'll begin with a quick introduction.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Mark Fisher - Whats new in Spring Integration 2_1.pdf","speakers":[{"createdDate":null,"version":3,"id":1149,"updatedDate":null,"bio":"Mark is the founder of the [Spring Integration](http://www.springintegration.org/) project. Currently at VMware, he continues to lead the Spring Integration team while exploring the intersection of big data and messaging. He has been a committer on a number of Spring projects, including the [Spring Framework](http://www.springsource.org/spring-framework) itself and [Spring AMQP](http://www.springsource.org/spring-amqp), which he co-founded. Mark speaks regularly at conferences and user groups about messaging, data, integration, and cloud computing.","firstName":"Mark","lastName":"Fisher","twitterId":"m_f_","googlePlusId":"","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"What's new in Spring Integration 2.1","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1305,"updatedDate":1411659465554,"audioLink":"","description":"Are you ready to bring your web development skills to natively installed mobile applications on multiple platforms?   In this session get ready for a deep dive into HTML & JavaScript powered cross-platform applications using PhoneGap (Apache Callback), powered by enterprise Java backend systems.","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1304,"updatedDate":1419201586456,"bio":"Andrew Trice is a MobileFirst Developer Advocate with IBM. Andrew is an experienced software architect, team leader, accomplished speaker, and published author who possesses more than a decade of designing and implementing rich applications for the web, desktop, and mobile devices. Andrew has delivered customer solutions in realtime data systems, GIS, immersive experiences, rich media, and data visualization.","firstName":"Andrew","lastName":"Trice","twitterId":"andytrice","googlePlusId":"+AndrewTrice","linkedInId":"andrewtrice","lanyrdId":"","githubId":"triceam"}],"title":"Java-Powered Cross-Platform Mobile Applications with PhoneGap","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1347,"updatedDate":1411659466187,"audioLink":"","description":"This session will introduce you to the cross-platform game library we created in the process of porting Rovio's \"Angry Birds\" to the browser, which we've called \"PlayN\". You'll learn how to use this library to write games in Java that run on modern web browsers, as well as on Flash and as Android and iOS apps. We'll also discuss some of the challenges of building games that target the web, from arithmetic and rendering performance, to rendering and audio bugs, hiding network lag, and avoiding garbage collection pauses.","presentationLink":"","speakers":[{"createdDate":null,"version":0,"id":1346,"updatedDate":null,"bio":"Joel Webber is a co-creator of the Google Web Toolkit, and focuses on bringing the web to the cutting edge of interactive application development. When not hacking WebKit, wrestling compiler bugs, and dealing with browser quirks, he spends his spare time building games and graphics libraries. Prior to joining Google, he worked in mobile development and the game industry.","firstName":"Joel","lastName":"Webber","twitterId":"jgw","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Introduction to the PlayN Cross-Platform Game Library","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":3,"id":1301,"updatedDate":1411659466101,"audioLink":"","description":"Frequently deploying to production puts bigger pressure than before on DevOps to make sure the good, qualified application is provisioned with no mistakes.This session will explore some common pitfalls with traditional Continuous-Integration that increase risk, introduce manual input and human error, and generally make DevOps cringe before hitting the “deploy” button.\r\n\r\nWe will then demonstrate automation techniques that overcome these issues using popular tools, like Maven, Gradle, your CI server, custom scripts and a Binary Repository.\r\nWhether you are building software for the cloud or in-house, this presentation will show you how to have completely automated production builds that release applications which are fully traceable, managed and ready to be provisioned with no fear!","presentationLink":"","speakers":[{"createdDate":null,"version":5,"id":1300,"updatedDate":1420493650714,"bio":"Fred Simon is best known as the Co-founder and Chief Architect of JFrog - the Artifactory Binary Repository creators, JavaOne 2011 and 2013 Duke Choice Awards  winner.\r\n\r\nBefore founding JFrog in 2008, Fred founded AlphaCSP, the Java consulting firm in 1998 where he was the company's global CTO, leading 5 branches worldwide and served as the visionary voice of the company.\r\n\r\nFred’s development experience goes back to 1992 and covers Java technologies evolution from day one as a programmer, Architect and Consultant.\r\n\r\nAs one of JFrog leaders, Fred encourages strong collaboration with leading open-source  projects such as SpringSource, Grails and Gradle  by providing them with the Artifactory Cloud platform, and fuels the Continuous-Integration ecosystem with open-source plugins for leading tools such as Jenkins, TeamCity & Bamboo. \r\n\r\nWhen not on those Fred hacks around  new features for the core Java language, Java port of the popular sky rendering Stellarium project and other neat stuff.\r\n\r\nFred blogs at [JFrog blog[(http://www.jfrog.com/blog/) & http://freddy33.blogspot.com and tweets as @freddy33.\r\n[His speaking history on Lanyrd](http://lanyrd.com/profile/freddy33/sessions/)\r\n","firstName":"Frederic","lastName":"Simon","twitterId":"freddy33","googlePlusId":"+FredericSimon","linkedInId":"freddy33","lanyrdId":"freddy33","githubId":"freddy33"}],"title":"Build Trust in Your Build to Deployment Flow!","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1314,"updatedDate":1411659466158,"audioLink":"","description":"The Play Framework takes the pain out of Java and Scala web app development. This session will use live coding and demos to walk you through getting started with Play! 1.2.x and the latest Play 2 prerelease. You will also learn how to build a browser client with HTML5 & JavaScript, create JSON services, connect to back-end databases and deploy to the cloud.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - James Ward - Intro to Play Framework.pdf","speakers":[{"createdDate":null,"version":4,"id":1000,"updatedDate":null,"bio":"James Ward (http://www.jamesward.com) works for Typesafe where he teaches developers the Typesafe Stack (Play Framework, Scala, and Akka). James frequently presents at conferences around the world such as JavaOne, Devoxx, and many other Java get-togethers. Along with Bruce Eckel, James co-authored First Steps in Flex. He has also published numerous screencasts, blogs, and technical articles. Starting with Pascal and Assembly in the 80′s, James found his passion for writing code. Beginning in the 90′s he began doing web development with HTML, Perl/CGI, then Java. After building a Flex and Java based customer service portal in 2004 for Pillar Data Systems he became a Technical Evangelist for Flex at Adobe. In 2011 James became a Principal Developer Evangelist at Salesforce.com where he taught developers how to deploy apps on the cloud with Heroku. James Tweets as @_JamesWard and posts code at http://github.com/jamesward.","firstName":"James","lastName":"Ward","twitterId":"_JamesWard","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Intro to Play Framework - Making Java & Scala Web App Development Fun","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1338,"updatedDate":1411659466194,"audioLink":"","description":"Spring 3.1 is here, and it offers a LOT! The question is - what does it offer for you? Josh Long will introduce Spring 3.1 in this fast paced tour of all the new features, including profiles, Hibernate 4 support, XML free web applications, numerous updates to the code-centric component model, the environment abstraction, a caching abstraction, an improved REST API, and much more. Josh introduces numerous new features in terms of an application that he'll introduce along the way.","presentationLink":"http://www.devnexus.com/static/2012/DevNexus 2012 - Josh Long - A walking tour of Spring 3_1.pdf","speakers":[{"createdDate":null,"version":4,"id":1284,"updatedDate":1417211686772,"bio":"Josh Long is the Spring Developer Advocate. Josh is the lead author on Apress’ Spring Recipes, 2nd Edition, the O'Reilly \"Pro Spring Roo\" book, the Pearson \"Livelessons for Spring\" and a committer on several Spring projects and the Activiti BPMN framework. When he’s not hacking on code, he can be found at the local Java User Group or at the local coffee shop. Josh likes solutions that push the boundaries of the technologies that enable them. Josh's interests include big-data, mobile, REST, NoSQL and integration. He blogs on the [Spring blog](http://spring.io/team/jlong) and [on his personal blog](http://joshlong.com).\r\n","firstName":"Josh","lastName":"Long","twitterId":"starbuxman","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"A walking tour of Spring 3.1","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1377,"updatedDate":1411659466254,"audioLink":"","description":"Is it the modular design and infinitely extensible architecture? Is it the elegant administration? Perhaps it's compliance with the universal language of standards? Maybe the ease of testing your applications? We'll search the answer together in a journey that will take you from testing the water to the deep dive, and in which you'll learn the secrets behind the unparalleled speed, incredibly small foot print, and exciting usability features of the next generation application server from JBoss.","presentationLink":"http://www.slideshare.net/marius_bogoevici/what-makes-jboss-tick","speakers":[{"createdDate":null,"version":2,"id":1375,"updatedDate":1417297174002,"bio":"Marius Bogoevici is a software engineer with Pivotal, working on Spring XD, and contributor emeritus to Spring Integration. Marius has an experience of more than 17 years of architecting and developing enterprise applications. A staunch open-source software proponent, in his previous tenures at Red Hat and SpringSource, he actively took part in the development of various of open-source Java projects such as Spring Integration, Weld (CDI RI), and well as JBoss AS. Marius is also co-author of “Spring Integration in Action” (Manning, 2012).","firstName":"Marius","lastName":"Bogoevici","twitterId":"@mariusbogoevici","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"What makes JBoss AS 7 tick?","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":1,"id":1358,"updatedDate":1411659466205,"audioLink":"","description":"Titanium is an open-source development tool for producing cross-platform mobile applications by Appcelerator. Using Titanium, you develop your mobile application using Javascript coded against the Titanium API's. Titanium Developer, a management GUI for your mobile apps, invokes their compiler and builder to take your Javascript and build a native application for iOS and Android.\r\n\r\nThis session will walk you through the details of building great apps for the Android and iOS platforms. We'll talk about Titanium development, its ecosystem, and architecture. We'll spend time looking at lots of code - we'll build an app, in fact, while we discuss and explore the framework. We'll also spend some time discussing best practices, what to expect when developing against it, and the limits of this type of development.","presentationLink":"","speakers":[{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"}],"title":"Easy Mobile Development: Appcelerator Titanium Introduction","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":2,"id":1362,"updatedDate":1411659466232,"audioLink":"","description":"This talk covers the basics of Scala syntax and why it's a language that all developers should get to know.  This talk covers the underlying philosophy behind the language as well as the core features that make it wonderful to use.  This is an introductory talk and no prior knowledge of Scala is assumed.","presentationLink":"","speakers":[{"createdDate":null,"version":3,"id":1334,"updatedDate":1389373961466,"bio":"Josh Suereth is a Senior Software Engineer at Typesafe and the author of \"Scala In Depth\". He has been a Scala enthusiast ever since he came to know this beautiful language in 2007. He started his professional career as a software developer in 2004 using programming languages like C++, Perl and Java. In 2009 he began writing the book \"Scala In Depth\" which provides practical support for using Scala in every day applications. Josh regularly shares his expertise in articles and talks.","firstName":"Josh","lastName":"Suereth","twitterId":"jsuereth","googlePlusId":"116090704407622565882","linkedInId":"joshuasuereth","lanyrdId":"","githubId":""}],"title":"Why you want to learn Scala","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]},{"createdDate":null,"version":4,"id":1288,"updatedDate":1411659466247,"audioLink":"","description":"Google AppEngine lets you build and host scalable Web applications written in Python or Java on Google’s infrastructure. In this talk, we'll look at new features in the last year, including the high-replication datastore (HRD), Cloud SQL, the new query planner, and cross-group transactions. In addition, we'll look at a recipe for load testing and many tips to make your apps more responsive and minimize cost.\r\n \r\nGuest speaker Mike Lawrence from [theice.com](http://www.theice.com) will also demo an app (http://wordpong.com) created and hosted on Google App Engine and discuss his experience with the App Engine Datastore.","presentationLink":"http://www.slideshare.net/turbomanage/google-app-engine-update-2012","speakers":[{"createdDate":null,"version":4,"id":1014,"updatedDate":null,"bio":"David Chandler works with the Google Developer Tools Team in Atlanta. An electrical engineer by training, Chandler got hooked on developing database Web applications in the days of NCSA Mosaic and has since written Web applications in a variety of languages, including C, perl, ksh, ColdFusion, Java, JSF, GWT, and now Dart. Prior to joining Google, Chandler worked on Internet banking applications with Intuit and launched a non-profit startup built with GWT and AppEngine. Chandler holds a patent on a method of organizing hierarchical data in a relational database and blogs about Java Web development at http://turbomanage.wordpress.com.","firstName":"David","lastName":"Chandler","twitterId":"drfibonacci","googlePlusId":"102717421433762219474","linkedInId":null,"lanyrdId":null,"githubId":null}],"title":"Launching scalable apps with Google App Engine","presentationType":null,"skillLevel":null,"track":null,"presentationTags":[]}],"speakers":[{"createdDate":null,"version":4,"id":1304,"updatedDate":1419201586456,"bio":"Andrew Trice is a MobileFirst Developer Advocate with IBM. Andrew is an experienced software architect, team leader, accomplished speaker, and published author who possesses more than a decade of designing and implementing rich applications for the web, desktop, and mobile devices. Andrew has delivered customer solutions in realtime data systems, GIS, immersive experiences, rich media, and data visualization.","firstName":"Andrew","lastName":"Trice","twitterId":"andytrice","googlePlusId":"+AndrewTrice","linkedInId":"andrewtrice","lanyrdId":"","githubId":"triceam"},{"createdDate":null,"version":2,"id":1302,"updatedDate":1417211919523,"bio":"Jason is a software engineer currently working in the Java Enterprise Edition Space, Arquillian, Forge, web site and other developer experience projects within Red Hat. His specialties include JBoss AS, Seam, CDI, JSF, Java EE, and Gradle. He has worked with PHP, Ruby, Groovy, XSLT, SASS the rest of the web language arena (HTML, CSS, JS, etc). His current position as Senior Software Engineer at Red Hat has him work primarily on the JBoss website, however, he also contributes to JBoss Forge, Arquillian, Apache DeltaSpike, Awestruct and others as time allows. He's very interested in the developer experience and helping to improve it at all aspects.","firstName":"Jason","lastName":"Porter","twitterId":"lightguardjp","googlePlusId":"110049315339873366294","linkedInId":"jasonporter","lanyrdId":"lightguardjp","githubId":"LightGuard"},{"createdDate":null,"version":4,"id":1284,"updatedDate":1417211686772,"bio":"Josh Long is the Spring Developer Advocate. Josh is the lead author on Apress’ Spring Recipes, 2nd Edition, the O'Reilly \"Pro Spring Roo\" book, the Pearson \"Livelessons for Spring\" and a committer on several Spring projects and the Activiti BPMN framework. When he’s not hacking on code, he can be found at the local Java User Group or at the local coffee shop. Josh likes solutions that push the boundaries of the technologies that enable them. Josh's interests include big-data, mobile, REST, NoSQL and integration. He blogs on the [Spring blog](http://spring.io/team/jlong) and [on his personal blog](http://joshlong.com).\r\n","firstName":"Josh","lastName":"Long","twitterId":"starbuxman","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""},{"createdDate":null,"version":3,"id":1149,"updatedDate":null,"bio":"Mark is the founder of the [Spring Integration](http://www.springintegration.org/) project. Currently at VMware, he continues to lead the Spring Integration team while exploring the intersection of big data and messaging. He has been a committer on a number of Spring projects, including the [Spring Framework](http://www.springsource.org/spring-framework) itself and [Spring AMQP](http://www.springsource.org/spring-amqp), which he co-founded. Mark speaks regularly at conferences and user groups about messaging, data, integration, and cloud computing.","firstName":"Mark","lastName":"Fisher","twitterId":"m_f_","googlePlusId":"","linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":2,"id":1282,"updatedDate":null,"bio":"Patrick Curran is Chair of the Java Community Process organization. In this role he oversees the activities of the JCP's Program Management Office including evolving the process and the organization, managing its membership, guiding specification leads and experts through the process, chairing Executive Committee meetings, and managing the [JCP.org web site](http://jcp.org/).\r\n\r\nPatrick has worked in the software industry for more than 25 years, and at Sun and then Oracle for 20 years. He has a long-standing record in conformance testing, and before joining the JCP he led the Java Conformance Engineering team in Sun's Client Software Group. He was also chair of Sun's Conformance Council, which was responsible for defining Sun's policies and strategies around Java conformance and compatibility.\r\n\r\nPatrick has participated actively in several consortia and communities including the [W3C](http://www.w3.org/) (as a member of the Quality Assurance Working Group and co-chair of the Quality Assurance Interest Group), and [OASIS](http://www.oasis-open.org/) (as co-chair of the Test Assertions Guidelines Technical Committee). Patrick's blog is [here](http://blogs.sun.com/pcurran/).","firstName":"Patrick","lastName":"Curran","twitterId":"","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":3,"id":1294,"updatedDate":1390408236167,"bio":"Peter is a contract member of the GitHub training team, the co-founder and CTO of Speak Geek, helping business people to hire and manage developers more effectively, the co-founder of CTO school and a regular presenter on a range of technologies - from chef to Neo4j.\r\n\r\nHe has presented at a range of conferences including DLD conference, ooPSLA, DevNexus, QCon NY, QCon SF, RubyNation, SpringOne2GX, Code Generation, Practical Product Lines, the British Computer Society Software Practices Advancement conference, GraphConnect, cf.Objective(), CF United, Scotch on the Rocks, WebDU, WebManiacs, UberConf, the Rich Web Experience and the No Fluff Just Stuff Enterprise Java tour. He has been published in IEEE Software, Dr. Dobbs, IBM developerWorks, Information Week, Methods & Tools, Mashed Code, the Open Source Journal, NFJS the Magazine and GroovyMag.","firstName":"Peter","lastName":"Bell","twitterId":"peterbell","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""},{"createdDate":null,"version":4,"id":1014,"updatedDate":null,"bio":"David Chandler works with the Google Developer Tools Team in Atlanta. An electrical engineer by training, Chandler got hooked on developing database Web applications in the days of NCSA Mosaic and has since written Web applications in a variety of languages, including C, perl, ksh, ColdFusion, Java, JSF, GWT, and now Dart. Prior to joining Google, Chandler worked on Internet banking applications with Intuit and launched a non-profit startup built with GWT and AppEngine. Chandler holds a patent on a method of organizing hierarchical data in a relational database and blogs about Java Web development at http://turbomanage.wordpress.com.","firstName":"David","lastName":"Chandler","twitterId":"drfibonacci","googlePlusId":"102717421433762219474","linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":5,"id":1300,"updatedDate":1420493650714,"bio":"Fred Simon is best known as the Co-founder and Chief Architect of JFrog - the Artifactory Binary Repository creators, JavaOne 2011 and 2013 Duke Choice Awards  winner.\r\n\r\nBefore founding JFrog in 2008, Fred founded AlphaCSP, the Java consulting firm in 1998 where he was the company's global CTO, leading 5 branches worldwide and served as the visionary voice of the company.\r\n\r\nFred’s development experience goes back to 1992 and covers Java technologies evolution from day one as a programmer, Architect and Consultant.\r\n\r\nAs one of JFrog leaders, Fred encourages strong collaboration with leading open-source  projects such as SpringSource, Grails and Gradle  by providing them with the Artifactory Cloud platform, and fuels the Continuous-Integration ecosystem with open-source plugins for leading tools such as Jenkins, TeamCity & Bamboo. \r\n\r\nWhen not on those Fred hacks around  new features for the core Java language, Java port of the popular sky rendering Stellarium project and other neat stuff.\r\n\r\nFred blogs at [JFrog blog[(http://www.jfrog.com/blog/) & http://freddy33.blogspot.com and tweets as @freddy33.\r\n[His speaking history on Lanyrd](http://lanyrd.com/profile/freddy33/sessions/)\r\n","firstName":"Frederic","lastName":"Simon","twitterId":"freddy33","googlePlusId":"+FredericSimon","linkedInId":"freddy33","lanyrdId":"freddy33","githubId":"freddy33"},{"createdDate":null,"version":2,"id":1005,"updatedDate":null,"bio":"Greg founded Ehcache in 2003. He regularly speaks at conferences, writes and codes. He has also founded and maintains the JPam and Spnego open source projects, which are security focused. Prior to joining Terracotta in 2009, Greg was Chief Architect at Wotif.com where he provided technical leadership as the company went from a single product startup to a billion dollar public company with multiple product lines. Before that Greg was a consultant for ThoughtWorks with engagements in the US and Australia in the travel, health care, geospatial, banking and insurance industries. Before doing programming, Greg managed IT. He was CIO at Virgin Blue, Tempo Services, Stamford Hotels and Resorts and Australian Resorts. He is a Chartered Accountant, and spent 7 years with KPMG in small business and insolvency. Greg holds a Bachelor of Commerce and a Masters in Information Technology.","firstName":"Greg","lastName":"Luck","twitterId":"gregrluck","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":3,"id":1334,"updatedDate":1389373961466,"bio":"Josh Suereth is a Senior Software Engineer at Typesafe and the author of \"Scala In Depth\". He has been a Scala enthusiast ever since he came to know this beautiful language in 2007. He started his professional career as a software developer in 2004 using programming languages like C++, Perl and Java. In 2009 he began writing the book \"Scala In Depth\" which provides practical support for using Scala in every day applications. Josh regularly shares his expertise in articles and talks.","firstName":"Josh","lastName":"Suereth","twitterId":"jsuereth","googlePlusId":"116090704407622565882","linkedInId":"joshuasuereth","lanyrdId":"","githubId":""},{"createdDate":null,"version":0,"id":1346,"updatedDate":null,"bio":"Joel Webber is a co-creator of the Google Web Toolkit, and focuses on bringing the web to the cutting edge of interactive application development. When not hacking WebKit, wrestling compiler bugs, and dealing with browser quirks, he spends his spare time building games and graphics libraries. Prior to joining Google, he worked in mobile development and the game industry.","firstName":"Joel","lastName":"Webber","twitterId":"jgw","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":0,"id":1373,"updatedDate":null,"bio":"Mark Atwood is a Developer Evangelist for Red Hat OpenShift. He has been a long-time contributor to open source. His technology interests include Cloud Computing and NoSQL. He is the patch queue manager for MySQL Drizzle. He was the Senior Technology Advisor for Network.com at Sun Microsystems. He makes his home in Seattle USA.","firstName":"Mark","lastName":"Atwood","twitterId":"fallenpegasus","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":2,"id":1342,"updatedDate":null,"bio":"Ram serves ThoughtWorks, Inc. as a Principal Consultant and currently heads up the Atlanta office. He was the head of Technology Consulting practice in North America. He plays the role of a Senior Architect and Technical Lead in the creation of large-scale distributed enterprise applications and the integration of disparate systems. Ram has served as a developer, technical lead and architect in high end solutions encompassing custom frameworks, systems integration and business to business solutions using various technologies. He has worked with large corporations and has mentored clients and team members on the best use of technology and Agile techniques. He speaks at conferences and at clients on various topics and also helps in technology assessments and pursuits. He has had over 19 years of experience with over 6 years in ThoughtWorks and has worked in the US, Canada, UK, Thailand and India. He is passionate about motorcycles and riding.\r\n\r\nYou can follow him on twitter at  http://twitter.com/ramsingaram","firstName":"Ram","lastName":"Singaram","twitterId":"ramsingaram","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":3,"id":1127,"updatedDate":1418572160608,"bio":"Roy Clarkson is a software engineer at Pivotal where he works on Spring's open source projects. Roy is the Spring for Android project lead and is also an organizer of the Atlanta Spring User Group. As a long time resident of Atlanta, he studied computer science at Georgia Tech before beginning his career as a software engineer. He has worked as a professional software developer for many years, with a variety of languages and technologies. He has spent the last few years focusing on mobile application development, including iPhone, Android, and mobile web. Prior to that, he focused most of his time on web development. Roy has spoken at several conferences and user groups about Spring and mobile technologies.","firstName":"Roy","lastName":"Clarkson","twitterId":"royclarkson","googlePlusId":"","linkedInId":"","lanyrdId":"royclarkson","githubId":"royclarkson"},{"createdDate":null,"version":6,"id":1285,"updatedDate":1420264261788,"bio":"Rossen is a committer on the Spring Framework team with a strong focus on web development including Spring MVC and WebSocket messaging. Previously Rossen consulted and trained Spring teams for several years. He has been involved with Java and web development in various industries and domains since the mid 90s.\r\n","firstName":"Rossen","lastName":"Stoyanchev","twitterId":"rstoya05","googlePlusId":"116853920244172849367","linkedInId":"","lanyrdId":"rstoyanchev","githubId":"rstoyanchev"},{"createdDate":null,"version":3,"id":1125,"updatedDate":null,"bio":"Brad Anderson has been wrangling data for 20 years, more recently building and using non-relational data stores. He works as a solution architect, assisting clients in their use of MapR's technology-leading Hadoop distribution. Previously, Brad has worked on a large-scale video-on-demand platform, smart grid analytics, a real-time audience participation platform, helped Cloudant build their hosted NoSQL offering based on CouchDB, and organized the NoSQL East 2009 conference in Atlanta.","firstName":"Brad","lastName":"Anderson","twitterId":"boorad","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":4,"id":1349,"updatedDate":1420263676473,"bio":"Burr Sutter is responsible for Red Hat JBoss middleware developer tooling and frameworks and is  specifically focused on technologies such as Java EE, Spring, PaaS, HTML5 and Apache Cordova.  Burr's passion is learning, teaching and demonstrating developer facing technologies. \r\nHe has previously been the President of the Atlanta Java Users Group, founder of the DevNexus conference, founder of the Atlanta chapter of the IASA and an Oracle Java Champion. ","firstName":"Burr","lastName":"Sutter","twitterId":"burrsutter","googlePlusId":"+BurrSutter","linkedInId":"burrsutter","lanyrdId":"","githubId":"burrsutter"},{"createdDate":null,"version":3,"id":1054,"updatedDate":null,"bio":"Ben Galbraith, together with his long-time friend Dion Almaer, forms one-half of the dynamic \"Ben and Dion\" duo that founded Ajaxian.com, headed Developer Tools at Mozilla, ran Developer Relations at Palm and is now running mobile architecture and engineering at Walmart.com after being acquired along with their start-up team in early 2011. Ben's been writing code since he was six and starting businesses since he was ten; he's written books, given hundreds of award-winning presentations world-wide, produced a few technical conferences, sold three companies, and has held CEO, CIO, CTO, and Software Architect positions in the medical, publishing, media, consumer electronics, advertising, software and internet industries. He lives in Palo Alto with his wife and six children.\r\n","firstName":"Ben","lastName":"Galbraith","twitterId":"bgalbs","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":2,"id":1289,"updatedDate":null,"bio":"[Jeremy Deane](http://www.jeremydeane.net) has over 17 years of software engineering experience in leadership positions. His expertise includes Enterprise Integration Architecture, Web Application Architecture, and Software Process Improvement. In addition, he is an accomplished speaker and technical author.","firstName":"Jeremy","lastName":"Deane","twitterId":"jtdeane","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":3,"id":1283,"updatedDate":null,"bio":"Tim is a full-stack generalist and passionate teacher who loves coding, presenting, and working with people. He believes the best developer is one who is well-informed of specifics and can also make deep connections between software development and the broader world. He has recently been exploring non-relational data stores, build systems, and how software architecture should resemble an ant colony.\r\n\r\nHis firm, the [August Technology Group](http://augusttechgroup.com), helps clients with product development, technology consulting, and technology upgrade projects on the JVM. The August Group's technology preferences reflect the generalist sensibilities of its founder, and its development practices are always lightweight, self-improving, and humanizing by design.\r\n\r\nTim is a speaker internationally and on the [No Fluff Just Stuff](http://nofluffjuststuff.com) tour in the United States, and is co-president of the [Denver Open Source User Group](http://denveropensource.org), author of the open-source [Groovy Liquibase DSL](http://github.com/tlberglund/groovy-liquibase), co-author of the [DZone Clojure RefCard](http://refcardz.dzone.com/refcardz/functional-programming-clojure), co-presenter of the best-selling [O'Reilly Git Master Class](http://bit.ly/ogitvid), co-author of [Building and Testing with Gradle](http://www.amazon.com/dp/144930463X), and a member of the [O'Reilly Expert Network](http://oreilly.com/pub/expert/timberglund).\r\n\r\nHe lives in Littleton, CO with the wife of his youth and their three children. ","firstName":"Tim","lastName":"Berglund","twitterId":"tlberglund","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":3,"id":1331,"updatedDate":1418596125825,"bio":"Daniel Hinojosa has been a self-employed developer, teacher and speaker for private business, education, and government since 1999. Daniel also actively teaches programming for the University of New Mexico Continuing Education.\r\n\r\nDaniel is a Pomodoro Technique practitioner and is co-founder of the Albuquerque Java User’s Group in Albuquerque, New Mexico. When he’s not supporting other local Java developers, Daniel spends most of his waking hours developing in and around the Java ecosystem, encompassing multiple languages and frameworks. He is author for the upcoming book ‘Testing in Scala’ and is the latest member of the No Fluff Just Stuff tour.","firstName":"Daniel","lastName":"Hinojosa","twitterId":"dhinojosa","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""},{"createdDate":null,"version":2,"id":1375,"updatedDate":1417297174002,"bio":"Marius Bogoevici is a software engineer with Pivotal, working on Spring XD, and contributor emeritus to Spring Integration. Marius has an experience of more than 17 years of architecting and developing enterprise applications. A staunch open-source software proponent, in his previous tenures at Red Hat and SpringSource, he actively took part in the development of various of open-source Java projects such as Spring Integration, Weld (CDI RI), and well as JBoss AS. Marius is also co-author of “Spring Integration in Action” (Manning, 2012).","firstName":"Marius","lastName":"Bogoevici","twitterId":"@mariusbogoevici","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""},{"createdDate":null,"version":2,"id":1023,"updatedDate":null,"bio":"Barry has played various roles in his 17 years in the software industry, including lone developer, team lead, director, and Agile coach and mentor. Barry is one of the few native Atlantans, currently specializing in coaching and mentoring for Agile software development in addition to doing contract software development. Over the years, he has developed on multiple platforms, focusing primarily on Microsoft technologies and then Java from 2003 onward. He views technology as a set of tools, and embraces the use of dynamic as well as statically-typed languages, procedural, object-oriented, and functional programming, each having their own strengths in a given problem domain.\r\n\r\nPrior to his career in software, Barry Hawkins spent 10 years designing, selling, and delivering turn-key industrial packaging and marking systems into manufacturing plants throughout the southeastern United States. He was responsible for the implementation, maintenance, and support of every system he sold, which was a formative experience that continues to influence his approach to consulting and coaching.","firstName":"Barry","lastName":"Hawkins","twitterId":"barryhawkins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":4,"id":1019,"updatedDate":1420322304880,"bio":"Pratik Patel is the CTO of Atlanta based TripLingo (http://www.triplingo.com/). He wrote the first book on 'enterprise Java' in 1996, “Java Database Programming with JDBC.” He has also spoken at various conferences and participates in several local tech groups and startup groups. He's in the startup world now and hacks iOS, Android, HTML5, CSS3, JavaScript, Rails, and ….. well everything except Perl. \r\nPratik's specialty is in large-scale applications for mission-critical and mobile applications use. He has designed and built applications in the retail, health care, financial services, and telecoms sectors. Pratik holds a master's in Biomedical Engineering from UNC, has worked in places such as New York, London, and Hong Kong, and currently lives in Atlanta, GA.","firstName":"Pratik","lastName":"Patel","twitterId":"prpatel","googlePlusId":"","linkedInId":"","lanyrdId":"prpatel","githubId":"prpatel"},{"createdDate":null,"version":2,"id":1351,"updatedDate":null,"bio":"I have been writing and testing code for over 20 years. From humble as a Computer Science/Philosophy double major at UC San Diego, to working at both startups (IPivot) and large corporations (Qualcomm, Intel, Redback Networks, Juniper Networks, and currently Yahoo!), I have always been dedicated to code quality. Currently as a Senior Principal Front End Engineer on the Yahoo Mail team, I help spearhead testing and quality for the latest rewrite of Yahoo Mail. I have spoken at several internal and\r\nexternal conferences (Yahoo TechPulse 2010 and 2011, Yahoo's Front End Summit, and at YUIConf 2011) about Testable Javascript and am the author of the Open Source Javascript Unit Test Environment ([https://github.com/zzo/JUTE](https://github.com/zzo/JUTE)) and EventHub ([https://github.com/zzo/EventHub](https://github.com/zzo/EventHub)).","firstName":"Mark Ethan","lastName":"Trostler","twitterId":"zzoass","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":2,"id":1368,"updatedDate":null,"bio":"A long-time best-selling author, instructor, and speaker, David is the author of Core HTML5 Canvas, published by Prentice-Hall in 2012 and four best-selling Java books including one of the best-selling Java books of all time, Graphic Java, and the best-selling books on both Java component frameworks: Swing and JavaServer Faces (JSF). David also writes regularly for IBM's developerworks online where his articles on JSF and HTML5 have collectively drawn nearly one million page views. \r\n\r\nDavid has spoken at hundreds of conferences around the world, including DevNexus, OSCON, Strange Loop, JavaOne, Devoxx, JAOO. David spoke on the highly regarded No Fluff Just Stuff tour for more than six years. He is a three-time JavaOne Rock Star, a designation awarded to the top rated speakers from the JavaOne conference.\r\n\r\nIn 2011 David founded the HTML5 Denver Meetup, which has become one of the most successful meetup groups in the Rockies with over 800 members.\r\n","firstName":"David","lastName":"Geary","twitterId":"davidgeary","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1297,"updatedDate":null,"bio":"Raymond Camden is a senior developer evangelist for Adobe. His work focuses on web standards, mobile development and ColdFusion. He's a published author and presents at conferences and user groups on a variety of topics. Raymond can be reached at his blog (http://www.raymondcamden.com/), @cfjedimaster on Twitter, or via email at raymondcamden@gmail.com.","firstName":"Raymond","lastName":"Camden","twitterId":"cfjedimaster","googlePlusId":"115106614688778962135","linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":5,"id":1323,"updatedDate":1420264607612,"bio":"Ken Kousen is President of Kousen IT, Inc, through which he does software development and technical training in all areas related to Java, especially open source topics like Android, Spring, Hibernate, Groovy, and Grails. He is the author of the book \"Making Java Groovy\" from Manning (http://manning.com/kousen/) and the book \"Gradle for Android\", upcoming from O'Reilly.","firstName":"Ken","lastName":"Kousen","twitterId":"kenkousen","googlePlusId":"+KennethKousen","linkedInId":"kenkousen","lanyrdId":"","githubId":"kousen"},{"createdDate":null,"version":4,"id":1117,"updatedDate":1419716357006,"bio":"As I enter my 18th year of developing software, several recurring trends and forces have become obvious to me.  My day job as a technical lead affords me time in the evening to write articles and prepare talks around these trends and forces, all of which interest me greatly.  To date these talks include \"[The ROI of Refactoring](http://www.slideshare.net/NeilGreen1/the-roi-of-refactoring-lego-vs-playdoh)\", \"[Nothing Matters More Than Coding Fast](http://devnexus.com/static/2012/audio/105%20-%20Neil%20Green%20-%20Nothing%20matters%20more%20than%20coding%20fast.mp3)\", and most recently \"[Writing Custom DSLs](https://www.youtube.com/watch?v=lm4jEcnWeKI)\" - which was a sneaky way to speak about these trends and forces in the form of technical talk.  \r\n","firstName":"Neil","lastName":"Green","twitterId":"neilfeyn","googlePlusId":"","linkedInId":"neilgreen","lanyrdId":"","githubId":"ngreen77"},{"createdDate":null,"version":2,"id":1015,"updatedDate":null,"bio":"Charlie Collins is the Director of Technology at MOVL; an experienced java, mobile, and web developer; a contributor to several open source projects; and coauthor of Android in Practice, Unlocking Android, and GWT in Practice.","firstName":"Charlie","lastName":"Collins","twitterId":"CharlieCollins","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":4,"id":1000,"updatedDate":null,"bio":"James Ward (http://www.jamesward.com) works for Typesafe where he teaches developers the Typesafe Stack (Play Framework, Scala, and Akka). James frequently presents at conferences around the world such as JavaOne, Devoxx, and many other Java get-togethers. Along with Bruce Eckel, James co-authored First Steps in Flex. He has also published numerous screencasts, blogs, and technical articles. Starting with Pascal and Assembly in the 80′s, James found his passion for writing code. Beginning in the 90′s he began doing web development with HTML, Perl/CGI, then Java. After building a Flex and Java based customer service portal in 2004 for Pillar Data Systems he became a Technical Evangelist for Flex at Adobe. In 2011 James became a Principal Developer Evangelist at Salesforce.com where he taught developers how to deploy apps on the cloud with Heroku. James Tweets as @_JamesWard and posts code at http://github.com/jamesward.","firstName":"James","lastName":"Ward","twitterId":"_JamesWard","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1370,"updatedDate":null,"bio":"Robert Cooper is a developer based in Atlanta where he develops telemedicine apps at Reach Heath. He is the author of GWT in Practice and a contributor to a number of open source projects including Shortyz Crosswords for Android.","firstName":"Robert","lastName":"Cooper","twitterId":"kebernet","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":4,"id":1024,"updatedDate":null,"bio":"Wesley Hales is a User Interface architect from Atlanta, GA. He has been involved in UI and User Experience roles for over a decade in both startup and enterprise environments. Wesley co-founded several enterprise frameworks during his 4.5 years at JBoss by Red Hat (including the JBoss Portlet Bridge and AeroGear projects) and also served as a co-founder of the recently acquired startup, InstaOps. He is now employed by Apigee as a software developer mainly focused on UI.\r\n\r\nOverall, Wesley enjoys creating world-class user interfaces and experiences that people fall in love with.\r\nYou can see him speak at the occasional conference, read his posts on [wesleyhales.com](http://wesleyhales.com), or follow him on twitter @wesleyhales.","firstName":"Wesley","lastName":"Hales","twitterId":"wesleyhales","googlePlusId":"114682255328371246824","linkedInId":null,"lanyrdId":null,"githubId":null},{"createdDate":null,"version":1,"id":1310,"updatedDate":null,"bio":"Don brings worldwide enterprise software experience, ranging from small \"dot-com\" through Fortune 500 companies. Donald speaks regularly about Java, open source, community development, business models, business integration and software development politics at conferences and events worldwide including Java One, Oracle World, Sun Tech Days, Evans Developer Relations Conference, OOPSLA, JAOO, Server Side Symposium, Colorado Software Summit and others. Prior to returning to Oracle, Donald was Director of Ecosystem Development for the Eclipse Foundation, an independent not-for-profit foundation supporting the Eclipse open source community.","firstName":"Donald","lastName":"Smith","twitterId":"DonaldOJDK","googlePlusId":null,"linkedInId":null,"lanyrdId":null,"githubId":null}],"rooms":[],"sponsors":[]}}