{"presentations":[{"id":5443,"createdDate":1444824386506,"updatedDate":1444824959036,"version":6,"audioLink":"","description":"Microservices are currently at the center of the hype cycle in software architecture. Much of the discussion is very technology/programming-centric or bikeshedding on \"how big a service should be.\" Unfortunately, what's often missed is how the ideas and principles found in DevOps, Continuous Delivery, Domain-Driven Design, and Agile have converged into an architectural style that supports the operationalization of those same ideas and principles, and that architecture has is what we now call \"Cloud Native.\" In this workshop we'll cut through the hype and look at how we can start delivering great software.\r\n\r\nWe will cover the following big ideas:\r\n\r\n* Microservices Defined: Domain-Driven Design at Scale\r\n* The convergence of Microservices with Continuous Delivery\r\n* Inverting Conway's Law: Defining Team Structure via Context Mapping\r\n* Cloud Foundry: Self-service Agile Infrastructure for Business Capability Teams\r\n* Spring Boot/Data/Cloud: Frameworks for Assembling Pattern-Based Distributed Systems\r\n* Consumer-Driven Contracts for Scalable Dependency Testing\r\n* Continuous Delivery Pipelines for Microservices\r\n\r\nYou will need to bring a laptop for this workshop! For the greatest success, try to have the following prerequisites installed before you arrive:\r\n\r\n- [Java 8 JDK](http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html) (not just JRE)\r\n- [Apache Maven](https://maven.apache.org/download.cgi) (latest)\r\n- [cURL](http://curl.haxx.se/download.html) (latest)\r\n- [Git](https://git-scm.com/downloads) (latest)\r\n- [RabbitMQ](https://www.rabbitmq.com/download.html) (latest)\r\n- [Cloud Foundry Client](https://github.com/cloudfoundry/cli/releases) (latest)\r\n- [Spring Tool Suite](https://spring.io/tools) (latest)\r\n\r\nIn addition, we will have a few optional advanced labs that may require booting a VM on your laptop. To expedite that process, please add the following:\r\n\r\n- [Vagrant](https://www.vagrantup.com/downloads.html) (latest)\r\n- [VirtualBox](https://www.virtualbox.org/wiki/Downloads) (latest)","presentationLink":"","speakers":[{"id":1404,"createdDate":null,"updatedDate":1447607671896,"version":9,"bio":"Matt is a technical product manager at Pivotal. He is a 15 year veteran of the enterprise IT industry, with experience spanning numerous business domains. He is the author of recently published _[Migrating to Cloud-Native Application Architectures](http://pivotal.io/platform/migrating-to-cloud-native-application-architectures-ebook)_ from O'Reilly, available as a free e-book download.\r\n\r\nMatt is obsessed with the idea that enterprise IT \"doesn't have to suck\", and spends much of his time thinking about lean/agile software development methodologies, DevOps, architectural principles/patterns/practices, and programming paradigms, in an attempt to find the perfect storm of techniques that will allow corporate IT departments to not only function like startup companies, but also create software that delights users while maintaining a high degree of conceptual integrity. His current focus is driving Pivotal's solutions around supporting microservices architectures with Cloud Foundry and Spring.\r\n\r\nMatt has spoken at conferences ranging from JavaOne to OSCON to YOW!, is a five-year member of the No Fluff Just Stuff tour, and serves as Technical Editor of NFJS the Magazine. Matt is also the founder and past president of the Memphis Java User Group.","firstName":"Matt","lastName":"Stine","twitterId":"mstine","googlePlusId":"","linkedInId":"mattstine","lanyrdId":"mstine","githubId":"mstine"}],"title":"Delivering Cloud Native Applications with Spring and Cloud Foundry","presentationType":"WORKSHOP","skillLevel":"INTERMEDIATE","track":{"id":35,"createdDate":null,"updatedDate":null,"version":null,"name":"Workshop (Full Day)","cssStyleName":null,"color":"#6c7070","description":null,"trackOrder":1},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":5436,"createdDate":1444814694928,"updatedDate":null,"version":0,"name":"boot"},{"id":4597,"createdDate":1419180919466,"updatedDate":null,"version":0,"name":"microservices"},{"id":2316,"createdDate":1389136849649,"updatedDate":null,"version":0,"name":"spring"},{"id":5437,"createdDate":1444814694936,"updatedDate":null,"version":0,"name":"cloud foundry"},{"id":2345,"createdDate":1389200461446,"updatedDate":null,"version":0,"name":"devops"},{"id":4135,"createdDate":1417192185614,"updatedDate":null,"version":0,"name":"continuous delivery"},{"id":2308,"createdDate":1389119813693,"updatedDate":null,"version":0,"name":"cloud"},{"id":2373,"createdDate":1389278999893,"updatedDate":null,"version":0,"name":"paas"}]},{"id":5423,"createdDate":1444778047739,"updatedDate":1444826329662,"version":4,"audioLink":"","description":"Containers are enabling developers to package their applications in new ways that are portable and work consistently everywhere: on your machine, in production, in your data center, and in the cloud. And Docker has become the de facto standard for those portable containers in the cloud. This workshop offers developers an intro-level hands-on session with Docker, from installation to exploring Docker Hub, to crafting their own images, to adding Java apps and running custom containers. This is a BYOL (bring your own laptop) session, so bring your Windows, OS X, or Linux laptop and be ready to dig into a tool that promises to be at the forefront of our industry for some time to come.","presentationLink":"","speakers":[{"id":5421,"createdDate":1444778047677,"updatedDate":1447181073774,"version":2,"bio":"Rafael Benevides is a Senior Software Engineer at Red Hat, working on JBoss open-source projects with emphasis on improving developer productivity. In his current role, he is the JBoss Developer Materials lead providing Quickstarts and tools to improve the developer's experience. He is member of Apache DeltaSpike PMC - a Duke's Choice Award winner project.  Besides that, He also worked in several fields including application architecture and design.","firstName":"Rafael","lastName":"Benevides","twitterId":"rafabene","googlePlusId":"+RafaelBenevides1","linkedInId":"rafaelbenevides","lanyrdId":"rafabene","githubId":"rafabene"},{"id":4594,"createdDate":1419180747620,"updatedDate":1447181053895,"version":4,"bio":"Markus is a Developer Advocate at Red Hat and focuses on JBoss Middleware. He is working with Java EE servers from different vendors since more than 14 years and talks about his favorite topics around Java EE on conferences all over the world. He has been a principal consultant and worked with different customers on all kinds of Java EE related applications and solutions. Beside that he has always been a prolific blogger, writer and tech editor for different Java EE related books. He is an active member of the German DOAG e.V. and it's representative on the iJUG e.V. As a Java Champion and former ACE Director he is well known in the community.","firstName":"Markus","lastName":"Eisele","twitterId":"myfear","googlePlusId":"+MarkusEisele","linkedInId":"markuseisele","lanyrdId":"","githubId":"myfear"}],"title":"Docker for Java EE Developers","presentationType":"WORKSHOP","skillLevel":"BEGINNER","track":{"id":35,"createdDate":null,"updatedDate":null,"version":null,"name":"Workshop (Full Day)","cssStyleName":null,"color":"#6c7070","description":null,"trackOrder":1},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":5455,"createdDate":1444826329653,"updatedDate":null,"version":0,"name":"container"},{"id":2345,"createdDate":1389200461446,"updatedDate":null,"version":0,"name":"devops"},{"id":4681,"createdDate":1419615116942,"updatedDate":null,"version":0,"name":"docker"},{"id":2308,"createdDate":1389119813693,"updatedDate":null,"version":0,"name":"cloud"}]},{"id":5417,"createdDate":1444776647554,"updatedDate":1444826171074,"version":3,"audioLink":"","description":"AngularJS is one of the most popular SPA frameworks out there, and not by mistake. Its powerful and game changing capabilities has brought it to where it is today. JavaScript is also an amazing language but big teams and enterprises find it hard to write maintainable code with it. TypeScript comes to fix this problem by introducing new features to JavaScript which make it easier to write and maintain big projects with.  \r\nIn this 1-day workshop we will build a web application from scratch using TypeScript and AngularJS, while going through the fundamentals of each. Do you want to see how large web applications are being written today? This is the workshop for you! \r\n","presentationLink":"","speakers":[{"id":5416,"createdDate":1444776647420,"updatedDate":1447184459964,"version":2,"bio":"Shay Friedman is the founder and web division leader at CodeValue, and also a Microsoft .NET MVP. In the last years, Shay has migrated numerous companies to modern web technologies like angularjs, html5 and css3. He's spoken in lots of international conferences and conducted various web related courses around the world. In his spare time Shay plays the guitar, plays basketball and drinks beer. And, most important, he's a nice guy! :)","firstName":"Shay","lastName":"Friedman","twitterId":"ironshay","googlePlusId":"","linkedInId":"shayfriedman","lanyrdId":"ironshay","githubId":"shayfriedman"}],"title":"Building Large Web Applications with TypeScript and AngularJS ","presentationType":"WORKSHOP","skillLevel":"BEGINNER","track":{"id":35,"createdDate":null,"updatedDate":null,"version":null,"name":"Workshop (Full Day)","cssStyleName":null,"color":"#6c7070","description":null,"trackOrder":1},"presentationTags":[{"id":2558,"createdDate":1390326654923,"updatedDate":null,"version":0,"name":"spa"},{"id":2241,"createdDate":1389102418425,"updatedDate":null,"version":0,"name":"javascript"},{"id":2556,"createdDate":1390326563335,"updatedDate":null,"version":0,"name":"angularjs"},{"id":4648,"createdDate":1419334272123,"updatedDate":null,"version":0,"name":"typescript"}]},{"id":5435,"createdDate":1444781124020,"updatedDate":1450108500875,"version":4,"audioLink":"","description":"With a strong focus on annotations, minimalist configuration, simple deployment, intelligent defaults and Java centric type-safety, Java EE is one of the most productive full-stack development platforms around today. This very code centric workshop is a quick tour of the Java EE platform as it stands today. If you haven't seen Java EE for a while and want to catch up, this session is definitely for you. \r\n\r\nWe will start with the basic principals of what Java EE is and what it is not, overview the platform at a high level and then dive into each key API like JSF, CDI, EJB 3, JPA, JAX-RS, WebSocket and JMS using examples and demos. This is your chance to look at Java EE 7 in the context of a realistic application named Cargo Tracker, available with an MIT license at http://cargotracker.java.net. \r\n\r\nWe will also briefly take a look at the emerging horizons of Java EE 8.","presentationLink":"","speakers":[{"id":1390,"createdDate":null,"updatedDate":1448908217781,"version":14,"bio":"Reza Rahman is a long time former independent consultant and now officially a Java EE evangelist at Oracle. He is the author of the popular book EJB 3 in Action. Reza is a frequent speaker at Java User Groups and conferences worldwide including JavaOne and Devoxx. He is the content chair for the Java EE track at JavaOne and a JavaOne Rock Star award winner. He is an avid contributor to industry journals like JavaLobby/DZone and TheServerSide. Reza has been a member of the Java EE, EJB and JMS expert groups. He implemented the EJB container for the Resin open source Java EE application server.\r\n\r\nReza has over a decade of experience with technology leadership, enterprise architecture, application development and consulting. He has been working with the standard Java EE platform since its inception. Reza has developed enterprise systems for well-known companies like eBay, Motorola, Comcast, Nokia, Prudential, Guardian Life, USAA, Independence Blue Cross and AAA using EJB 2, EJB 3, CDI, Spring and Seam.","firstName":"Reza","lastName":"Rahman","twitterId":"@reza_rahman","googlePlusId":"+RezaRahmanPublic","linkedInId":"javareza","lanyrdId":"","githubId":"m-reza-rahman"}],"title":"Have You Seen Java EE Lately?","presentationType":"WORKSHOP","skillLevel":"INTERMEDIATE","track":{"id":35,"createdDate":null,"updatedDate":null,"version":null,"name":"Workshop (Full Day)","cssStyleName":null,"color":"#6c7070","description":null,"trackOrder":1},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":2264,"createdDate":1389103820059,"updatedDate":null,"version":0,"name":"jpa"},{"id":5453,"createdDate":1444826233427,"updatedDate":null,"version":0,"name":"jax-rs"},{"id":3993,"createdDate":1415537029177,"updatedDate":null,"version":0,"name":"java ee"},{"id":5451,"createdDate":1444826233418,"updatedDate":null,"version":0,"name":"jsf"},{"id":2375,"createdDate":1389279148757,"updatedDate":null,"version":0,"name":"cdi"},{"id":5452,"createdDate":1444826233425,"updatedDate":null,"version":0,"name":"ejb 3"},{"id":2420,"createdDate":1389356360751,"updatedDate":null,"version":0,"name":"websocket"},{"id":5454,"createdDate":1444826233433,"updatedDate":null,"version":0,"name":"jms"}]},{"id":5445,"createdDate":1444825312782,"updatedDate":null,"version":0,"audioLink":"","description":"With Java supporting lambda expressions, we have nothing to stop us from creating functional style of code for our day to day applications. We are so used to object-oriented programming, but remember the paradigm shift we went through to adapt to that way of programming. It is yet another paradigm shift and most of us wonder how in the world can we write functional style code. Much like how OO was not as much about the syntax as it was about the design, functional programming is about the design, the idioms, and the data structures we would use to program.\r\n\r\nIn this hands-on workshop, we will learn about functional programming using practical examples, create small apps that will make use of this style of programming, and relate to how it differs from the traditional way were used to and the benefits it offers.\r\n\r\n**Workshop Requirements**\r\n\r\nThis session is a workshop. Please come prepared.  Please have the latest version of Java 8 installed along with JUnit. Also, have *svn* or *git-svn* installed to get access to example and lab code during the workshop.\r\n\r\n* Java 8\r\n* JUnit\r\n* svn or git-svn\r\n* your favorite IDE\r\n","presentationLink":"","speakers":[{"id":1009,"createdDate":null,"updatedDate":1448908887888,"version":9,"bio":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats **at** agiledeveloper **dot** com or on twitter at @venkat_s.","firstName":"Venkat","lastName":"Subramaniam","twitterId":"venkat_s","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Functional Programming with Java8","presentationType":"WORKSHOP","skillLevel":"INTERMEDIATE","track":{"id":35,"createdDate":null,"updatedDate":null,"version":null,"name":"Workshop (Full Day)","cssStyleName":null,"color":"#6c7070","description":null,"trackOrder":1},"presentationTags":[{"id":2412,"createdDate":1389356087727,"updatedDate":null,"version":0,"name":"functional programming"},{"id":5444,"createdDate":1444825312778,"updatedDate":null,"version":0,"name":"java8"},{"id":2247,"createdDate":1389102577671,"updatedDate":null,"version":0,"name":"jvm"}]},{"id":5419,"createdDate":1444777211235,"updatedDate":1444826074856,"version":3,"audioLink":"","description":"This course will introduce you to the various skills that go into data science, provide practical walkthroughs of relevant languages and tools and lay down a study plan for moving forward in this field.\r\n\r\nAs there is a rush to hire data scientists these days, there is a coincident rush to update resumes to include the term \"Data Scientist\". Unfortunately, like most types of science, it is less a single topic and more a multi-disciplinary way of thinking, inquiring and communicating.\r\n\r\nYou won't become a data scientist over night, but you can learn to be one in time. Individuals do not need to know everything about the field, but teams should be composed of individuals who collectively do.\r\n\r\nWe will cover:\r\n\r\n* Data Science as a field\r\n* Basic statistics and numerical methods for dealing with data\r\n* Doing Data Analysis in Spreadsheets\r\n* The R programming language, its environment and online ecosystem\r\n* R's visualization packages\r\n* Interacting and visualizing data with D3.js\r\n* Interacting with Big Data environments in R\r\n* Interacting with Linked Data in R","presentationLink":"","speakers":[{"id":5418,"createdDate":1444777211020,"updatedDate":1447184422029,"version":2,"bio":"Brian Sletten is a liberal arts-educated software engineer with a focus on forward-leaning technologies. His experience has spanned many industries including retail, banking, online games, defense, finance, hospitality and health care. He has a B.S. in Computer Science from the College of William and Mary and lives in Auburn, CA. He focuses on web architecture, resource-oriented computing, social networking, the Semantic Web, data science, 3D graphics, visualization, scalable systems, security consulting and other technologies of the late 20th and early 21st Centuries. He is also a rabid reader, devoted foodie and has excellent taste in music. If pressed, he might tell you about his International Pop Recording career.","firstName":"Brian","lastName":"Sletten","twitterId":"bsletten","googlePlusId":"104941059392765677737","linkedInId":"bsletten","lanyrdId":"bsletten","githubId":"bsletten"}],"title":"Data Science Workshop","presentationType":"WORKSHOP","skillLevel":"INTERMEDIATE","track":{"id":35,"createdDate":null,"updatedDate":null,"version":null,"name":"Workshop (Full Day)","cssStyleName":null,"color":"#6c7070","description":null,"trackOrder":1},"presentationTags":[{"id":2244,"createdDate":1389102500687,"updatedDate":null,"version":0,"name":"data"},{"id":4442,"createdDate":1418594092391,"updatedDate":null,"version":0,"name":"data science"},{"id":5450,"createdDate":1444826074851,"updatedDate":null,"version":0,"name":"r programming language"},{"id":5449,"createdDate":1444826074847,"updatedDate":null,"version":0,"name":"d3"},{"id":2298,"createdDate":1389119813688,"updatedDate":null,"version":0,"name":"big data"}]},{"id":5448,"createdDate":1444825879329,"updatedDate":1452622427944,"version":2,"audioLink":"","description":"In this training, you will discover a consistent and reinforcing set of tools and practices rooted in the philosophy of small and simple; this can help you move towards a microservice architecture. Microservices are typically small systems, with single responsibilities, communicating via the networks, installed as well-behaved operating system services. However, with these finer-grained systems come new sources of complexity.\r\n\r\n**Audience**\r\n\r\nDevelopers, architects, technical leaders, operations engineers and anybody interested in the design and architecture of services and components.\r\n\r\n**What You Will Learn**\r\n\r\nDuring this training, you will understand in depth what the benefits are of microservice architectures, how to break apart your existing monolithic applications, and the practical concerns of managing these systems. We will discuss how to ensure your systems can be more stable, how to handle security and the additional complexity of monitoring and deployment.","presentationLink":"","speakers":[{"id":8458,"createdDate":1452622204620,"updatedDate":null,"version":0,"bio":"Rachel is the Head of Technology for North America at ThoughtWorks and is based in New York. She has over 12 years of experience in software delivery, having worked on a wide range of technologies and the integration of many disparate systems. At ThoughtWorks, she has coached teams on Agile and Continuous Delivery technical practices. She contributes to and drives the regional technology strategy, and is a conduit between the technical teams on the ground and global technical leadership. She is also a member of the Technical Advisory Board to the CTO, which regularly produces the ThoughtWorks Technology Radar. She is fascinated by problem solving and has discovered that people problems are often more difficult to solve than software ones. ","firstName":"Rachel","lastName":"Laycock","twitterId":"rachellaycock","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""},{"id":7905,"createdDate":1452202346473,"updatedDate":null,"version":0,"bio":"Cassie is a Lead Consultant with ThoughtWorks, who has primarily been leading and working in a variety of enterprise projects with a specialty in mobile technology. She has primarily been involved in leading projects with a focus on continuous delivery. She is also one of the leaders in the initiative to organize the women’s group in ThoughtWorks and is also involved in promoting more female speakers in technology.","firstName":"Cassandra","lastName":"Shum","twitterId":"cassiend","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Building Microservices","presentationType":"WORKSHOP","skillLevel":"INTERMEDIATE","track":{"id":35,"createdDate":null,"updatedDate":null,"version":null,"name":"Workshop (Full Day)","cssStyleName":null,"color":"#6c7070","description":null,"trackOrder":1},"presentationTags":[{"id":2293,"createdDate":1389113591143,"updatedDate":null,"version":0,"name":"architecture"},{"id":4597,"createdDate":1419180919466,"updatedDate":null,"version":0,"name":"microservices"}]},{"id":5420,"createdDate":1444777290619,"updatedDate":1446492235972,"version":6,"audioLink":"","description":"Join Jared Richardson to learn about GROWS, a modern development approach created by Agile manifesto author Andy Hunt and Jared Richardson. GROWS is built around the Dreyfus Model of Skills Acquisition and deliberate experimentation to guide project decisions. Incorporating existing practices, it's a methodology designed to improve both initial adoption and on-going evolution of your team and organization. Jared describe GROWS in detail, diving into specific steps and practices for managers and executives. Learn techniques to share the company's vision effectively, and simple tools for managing progress without micromanaging. Know when a project is doing well and when it's in trouble. Discover how to keep your team on track with the R's: building on a Rhythm (their iteration cadence), building the Right thing (from the vision), and working the Right way (with craftsmanship and technical practices). Come, learn, and participate as Jared provides an understanding of the GROWS Method and how it can move your company forward.","presentationLink":"","speakers":[{"id":1074,"createdDate":null,"updatedDate":1447187929524,"version":5,"bio":"Principal consultant and a member of the core team at Agile Artisans (AgileArtisans.com), Jared Richardson is a process coach who works with software teams to help them build excellent software. He sold his first software program in 1991 and has been immersed in software ever since. He helped create the GROWS methodology and has authored a number of books, including the best selling Ship It! A Practical Guide to Successful Software Projects and Career 2.0: Take Control of Your Life. He is a frequent speaker at software conferences and a thought leader in the agile space. Jared lives with his wife and children in North Carolina where they, quite by accident, became backyard chicken farmers.","firstName":"Jared","lastName":"Richardson","twitterId":"jaredrichardson","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"The GROWS Workshop: A Modern Software Development Methodology","presentationType":"WORKSHOP","skillLevel":"BEGINNER","track":{"id":35,"createdDate":null,"updatedDate":null,"version":null,"name":"Workshop (Full Day)","cssStyleName":null,"color":"#6c7070","description":null,"trackOrder":1},"presentationTags":[{"id":2267,"createdDate":1389104078446,"updatedDate":null,"version":0,"name":"agile"}]},{"id":5433,"createdDate":1444780203514,"updatedDate":1444781027961,"version":2,"audioLink":"","description":"A consistent, shared vision is essential in order for teams to push in the same direction, but it's surprising that many teams struggle to effectively communicate the architecture of the software they are building. As an industry we do have the Unified Modeling Language (UML), yet many people favour informal boxes and lines sketches instead. The problem is that such diagrams rarely make any sense, usually need a narrative to accompany them and ultimately slow the team down. Although we can argue whether UML offers an effective way to communicate software architecture, that's often irrelevant because many teams have already thrown out UML or simply don't know it. Abandoning UML is one thing but, in the race for agility, many software development teams have lost the ability to communicate visually too.\r\n\r\nThis hands-on session is aimed at those involved in the software development process and is about improving communication. You'll see some patterns and anti-patterns related to \"boxes and lines\" diagrams, and you'll learn some lightweight techniques for communicating software architecture using simple sketches and my C4 software architecture model.","presentationLink":"","speakers":[{"id":5427,"createdDate":1444780203454,"updatedDate":1447188747505,"version":4,"bio":"Simon is an independent software development consultant specialising in software architecture; specifically technical leadership, communication and lightweight, pragmatic approaches to software architecture. He is the author of two books about software architecture; [Software Architecture for Developers](http://leanpub.com/software-architecture-for-developers) (a developer-friendly guide to software architecture, technical leadership and the balance with agility) and [The Art of Visualising Software Architecture](https://leanpub.com/visualising-software-architecture) (a guide to communicating software architecture with sketches, diagrams and models). I'm also the creator of the C4 software architecture model and Structurizr, a web-based tool to create software architecture diagrams.","firstName":"Simon","lastName":"Brown","twitterId":"simonbrown","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":"simonbrowndotje"}],"title":"The Art of Visualising Software Architecture","presentationType":"WORKSHOP","skillLevel":"INTERMEDIATE","track":{"id":35,"createdDate":null,"updatedDate":null,"version":null,"name":"Workshop (Full Day)","cssStyleName":null,"color":"#6c7070","description":null,"trackOrder":1},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":5430,"createdDate":1444780203492,"updatedDate":null,"version":0,"name":"communication"},{"id":5429,"createdDate":1444780203490,"updatedDate":null,"version":0,"name":"code"},{"id":5428,"createdDate":1444780203477,"updatedDate":null,"version":0,"name":"software architecture"},{"id":5431,"createdDate":1444780203496,"updatedDate":null,"version":0,"name":"diagrams"},{"id":5432,"createdDate":1444780203508,"updatedDate":null,"version":0,"name":"uml"}]},{"id":6656,"createdDate":1448855155527,"updatedDate":1448855694325,"version":2,"audioLink":"","description":"You went ahead a built a whole new set of shiny microservices. While doing this you realize you can no longer rely on you Application Server to handle all the authentication. Oh, and of course one of your teams used Node.JS How are you going to secure all these endpoints so that the end user doesn't have to authenticate against each one. This talk will be a demonstration of using a centralized authentication service to secure many different microservice architecture. The demos will Project Keycloak but would apply just as well with Stormpath, Ping.Indenty, or similar services.","presentationLink":"","speakers":[{"id":2369,"createdDate":1389278640612,"updatedDate":1448855155462,"version":4,"bio":"Steve is a Dad, Son, Partner, and PaaS Dust Spreader (aka developer evangelist) with OpenShift. He goes around and shows off all the great work the OpenShift engineers do. He can teach you about PaaS with Java, Python, PostgreSQL MongoDB, and some JavaScript. He has deep subject area expertise in GIS/Spatial, Statistics, and Ecology. He has spoken at over 75 conferences and done over 50 workshops including Monktoberfest, MongoNY, JavaOne, FOSS4G, CiscoLive, Fluent, DevNation, Where2.0, and OSCON. Before OpenShift, Steve was a developer evangelist for LinkedIn, deCarta, and ESRI. Steve has a Ph.D. in Ecology from University of Connecticut. He likes building interesting applications and helping developers create great solutions.","firstName":"Steven","lastName":"Pousty","twitterId":"thesteve0","googlePlusId":"","linkedInId":"","lanyrdId":"thesteve0","githubId":"thesteve0"}],"title":" You've got Microservices...Let's Secure Them","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":43,"createdDate":null,"updatedDate":null,"version":null,"name":"Microservices","cssStyleName":null,"color":"#2a2d7c","description":null,"trackOrder":70},"presentationTags":[{"id":6662,"createdDate":1448855694312,"updatedDate":null,"version":0,"name":"keycloak"},{"id":4597,"createdDate":1419180919466,"updatedDate":null,"version":0,"name":"microservices"},{"id":6649,"createdDate":1448761458641,"updatedDate":null,"version":0,"name":"authentication"}]},{"id":6414,"createdDate":1447802352527,"updatedDate":1450152428810,"version":8,"audioLink":"","description":"The third platform, characterized by a fluid infrastructure where virtualized servers come into and out of existence, and workloads are constantly being moved about and scaled up and down to meet variable demand, calls for new design patterns, processes and even culture. One of the most well known descriptions of these new paradigms is the Twelve Factor App (12factor.net), which describes elements of cloud native applications. Many of these needs are squarely met through the Spring Framework, others require support from other systems. In this session we will examine each of the twelve factors and present how Spring, and platforms such as Cloud Foundry satisfy them, and in some cases we’ll even suggest that responsibility should shift from Spring to platforms. At the conclusion you will understand what is needed for cloud‐native applications, why and how to deliver on those requirements.","presentationLink":"","speakers":[{"id":6413,"createdDate":1447802352480,"updatedDate":1449088377501,"version":5,"bio":"A self-proclaimed propellerhead, Cornelia Davis is CTO of the Transformation Practice at Pivotal, where she helps customers develop and execute on their cloud platform strategies. Responsible for guiding clients on the technical elements of broader transformation, she focuses on making developers and operations teams successful with the Pivotal Cloud Foundry application platform. To that end, you’ll find her knee deep in the code base, writing cloud native apps and deploying them onto the platform, teaching at a whiteboard, talking Devops, presenting at conferences and passionately driving new features into the product.","firstName":"Cornelia","lastName":"Davis","twitterId":"cdavisafc","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":"cdavisafc"},{"id":6613,"createdDate":1448376550299,"updatedDate":1448908473296,"version":3,"bio":"Josh is an Advisory Solutions Architect at Pivotal Software. He is focused on enabling delivery of customer value at a sustainable pace. In his spare time he has been building operational utilities for Cloud Foundry.","firstName":"Josh","lastName":"Kruck","twitterId":"krujos","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":"krujos"}],"title":"12 Factor, or Cloud Native Apps - What EXACTLY Does that Mean for Spring Developers?","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":43,"createdDate":null,"updatedDate":null,"version":null,"name":"Microservices","cssStyleName":null,"color":"#2a2d7c","description":null,"trackOrder":70},"presentationTags":[{"id":2293,"createdDate":1389113591143,"updatedDate":null,"version":0,"name":"architecture"},{"id":2316,"createdDate":1389136849649,"updatedDate":null,"version":0,"name":"spring"},{"id":4597,"createdDate":1419180919466,"updatedDate":null,"version":0,"name":"microservices"},{"id":2308,"createdDate":1389119813693,"updatedDate":null,"version":0,"name":"cloud"}]},{"id":6419,"createdDate":1447802722550,"updatedDate":1448376018397,"version":6,"audioLink":"","description":"Developing cloud native applications presents several challenges. How do microservices discover each other? How do you configure them? How can you make them resilient to failure? How can you monitor the health of each microservice?\r\n\r\nSpring Cloud addresses all of these concerns. Even so, you still must explicitly develop your own discovery server, configuration server, and circuit breaker dashboard for monitoring the circuit breakers in each microservice.\r\n\r\nSpring Cloud Services for Pivotal Cloud Foundry picks up where Spring Cloud leaves off, offering a discovery server, configuration server, and Hystrix dashboard as services that can be bound to applications deployed in Pivotal Cloud Foundry, leaving you to focus on developing the services that drive your application. In this talk, we will introduce the capabilities provided by Spring Cloud Services and demonstrate how it makes simple work of deploying cloud native applications to Cloud Foundry.","presentationLink":"","speakers":[{"id":1127,"createdDate":null,"updatedDate":1447802722493,"version":4,"bio":"Roy Clarkson is an engineer at Pivotal where he is a member of the Spring team. Roy is currently working on Spring Cloud Services for Pivotal Cloud Foundry, and is also an organizer of the Atlanta Spring User Group and Atlanta Cloud Foundry Meetup.","firstName":"Roy","lastName":"Clarkson","twitterId":"royclarkson","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":"royclarkson"},{"id":2523,"createdDate":1390003326211,"updatedDate":1447802722520,"version":2,"bio":"Craig Walls is a senior engineer with Pivotal as the Spring Social project lead and is the author of Spring in Action and Spring Boot in Action. He's a zealous promoter of the Spring Framework, speaking frequently at local user groups and conferences and writing about Spring. When he's not slinging code, Craig spends as much time as he can with his wife, two daughters, 2 birds and 2 dogs.","firstName":"Craig","lastName":"Walls","twitterId":"habuma","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":"habuma"}],"title":"Cloud Native Java with Spring Cloud Services","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":43,"createdDate":null,"updatedDate":null,"version":null,"name":"Microservices","cssStyleName":null,"color":"#2a2d7c","description":null,"trackOrder":70},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":2316,"createdDate":1389136849649,"updatedDate":null,"version":0,"name":"spring"},{"id":4597,"createdDate":1419180919466,"updatedDate":null,"version":0,"name":"microservices"},{"id":6600,"createdDate":1448333346523,"updatedDate":null,"version":0,"name":"spring cloud"},{"id":2308,"createdDate":1389119813693,"updatedDate":null,"version":0,"name":"cloud"}]},{"id":6657,"createdDate":1448855219816,"updatedDate":1448855711766,"version":2,"audioLink":"","description":"Microservices seems to have become the new kid of the buzzword block in our ever colorful industry. In this session we will explore what microservices really mean within the relatively well established context of distributed computing/SOA, when they make sense and how to develop them using the lightweight, simple, productive Java EE programming model. \r\n\r\nWe'll explore microservices using a simple but representative example using Java EE. You'll see how the Java EE programming model and APIs like JAX-RS, WebSocket, JSON-P, Bean Validation, CDI, JPA, EJB 3, JMS 2 and JTA aligns with the concept of microservices. \r\n\r\nIt may or may not surprise you to learn in the end that you already know more about microservices than you realize and that it is an architectural style that does not really require you to learn an entirely new tool set beyond the ones you already have. You might even see that Java EE is a particularly powerful and elegant tool set for developing microservices.","presentationLink":"","speakers":[{"id":1390,"createdDate":null,"updatedDate":1448908217781,"version":14,"bio":"Reza Rahman is a long time former independent consultant and now officially a Java EE evangelist at Oracle. He is the author of the popular book EJB 3 in Action. Reza is a frequent speaker at Java User Groups and conferences worldwide including JavaOne and Devoxx. He is the content chair for the Java EE track at JavaOne and a JavaOne Rock Star award winner. He is an avid contributor to industry journals like JavaLobby/DZone and TheServerSide. Reza has been a member of the Java EE, EJB and JMS expert groups. He implemented the EJB container for the Resin open source Java EE application server.\r\n\r\nReza has over a decade of experience with technology leadership, enterprise architecture, application development and consulting. He has been working with the standard Java EE platform since its inception. Reza has developed enterprise systems for well-known companies like eBay, Motorola, Comcast, Nokia, Prudential, Guardian Life, USAA, Independence Blue Cross and AAA using EJB 2, EJB 3, CDI, Spring and Seam.","firstName":"Reza","lastName":"Rahman","twitterId":"@reza_rahman","googlePlusId":"+RezaRahmanPublic","linkedInId":"javareza","lanyrdId":"","githubId":"m-reza-rahman"}],"title":"Down-to-Earth Microservices with Java EE","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":43,"createdDate":null,"updatedDate":null,"version":null,"name":"Microservices","cssStyleName":null,"color":"#2a2d7c","description":null,"trackOrder":70},"presentationTags":[{"id":3993,"createdDate":1415537029177,"updatedDate":null,"version":0,"name":"java ee"},{"id":4597,"createdDate":1419180919466,"updatedDate":null,"version":0,"name":"microservices"}]},{"id":6661,"createdDate":1448855630528,"updatedDate":1448855727622,"version":2,"audioLink":"","description":"This presentation looks at the importance of events and the role that they play in software applications. We describe how events are a key application integration mechanism and how they are used by applications to communicate with the outside world. You will learn how the microservices inside a system can use events to maintain data consistency. We discuss how easy it is to implement both these mechanisms by developing your core business logic using an event-centric approach.\r\n","presentationLink":"","speakers":[{"id":1400,"createdDate":null,"updatedDate":1448855630516,"version":5,"bio":"Chris Richardson is a developer and architect. He is a Java Champion, a JavaOne rock star and the author of POJOs in Action, which describes how to build enterprise Java applications with frameworks such as Spring and Hibernate. Chris was also the founder of the original CloudFoundry.com, an early Java PaaS for Amazon EC2. He is the creator of microservices.io and is working on his third startup: a platform for developing reactive microservices. Blog: http://plainoldobjects.com/, Twitter: @crichardson\r\n","firstName":"Chris","lastName":"Richardson","twitterId":"crichardson","googlePlusId":"","linkedInId":"","lanyrdId":"crichardson","githubId":"cer"}],"title":"Events on the outside, on the inside and at the core","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":43,"createdDate":null,"updatedDate":null,"version":null,"name":"Microservices","cssStyleName":null,"color":"#2a2d7c","description":null,"trackOrder":70},"presentationTags":[{"id":4597,"createdDate":1419180919466,"updatedDate":null,"version":0,"name":"microservices"}]},{"id":6660,"createdDate":1448855564104,"updatedDate":null,"version":0,"audioLink":"","description":"With the ascent of DevOps, microservices, containers, and cloud-based development platforms, the gap between state-of-the-art solutions and the technology that enterprises typically support has greatly increased. But some enterprises are now looking to bridge that gap by building microservice-based architectures on top of Java EE. Can it be done? Is it even a good idea? We thoroughly explores the possibility and provides savvy advice for enterprises that want to move ahead. The issue is complex: Java EE wasn’t built with the distributed application approach in mind, but rather as one monolithic server runtime or cluster hosting many different applications. If you’re part of an enterprise development team investigating the use of microservices with Java EE, there are several items to consider.","presentationLink":"","speakers":[{"id":4594,"createdDate":1419180747620,"updatedDate":1447181053895,"version":4,"bio":"Markus is a Developer Advocate at Red Hat and focuses on JBoss Middleware. He is working with Java EE servers from different vendors since more than 14 years and talks about his favorite topics around Java EE on conferences all over the world. He has been a principal consultant and worked with different customers on all kinds of Java EE related applications and solutions. Beside that he has always been a prolific blogger, writer and tech editor for different Java EE related books. He is an active member of the German DOAG e.V. and it's representative on the iJUG e.V. As a Java Champion and former ACE Director he is well known in the community.","firstName":"Markus","lastName":"Eisele","twitterId":"myfear","googlePlusId":"+MarkusEisele","linkedInId":"markuseisele","lanyrdId":"","githubId":"myfear"}],"title":"Java EE Microservices Architecture: Migrating Monolithic Systems for Sustainable Enterprise Development","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":43,"createdDate":null,"updatedDate":null,"version":null,"name":"Microservices","cssStyleName":null,"color":"#2a2d7c","description":null,"trackOrder":70},"presentationTags":[{"id":3993,"createdDate":1415537029177,"updatedDate":null,"version":0,"name":"java ee"},{"id":4597,"createdDate":1419180919466,"updatedDate":null,"version":0,"name":"microservices"}]},{"id":6612,"createdDate":1448375513659,"updatedDate":1448375583645,"version":2,"audioLink":"","description":"In this session we will discuss the Spring Cloud abstractions and interfaces that an implementation might choose to implement: DiscoveryClient, LoadBalancerClient, Configuration and Bus.  We will compare and contrast some target technologies and discus the tradeoffs and nuances of each, such as: netflix, consul, etcd, zookeeper and lattice.  We will then show and demonstrate Spring Cloud implementations of those technologies","presentationLink":"","speakers":[{"id":4445,"createdDate":1418640849693,"updatedDate":1448375513633,"version":2,"bio":"Spencer Gibb is a Software Engineer for Pivotal, Inc.\r\n\r\nHis interests include distributed systems, jvm languages, web services frameworks, message-driven architectures and making software development simpler.  He loves to create software to solve a pain point, such as creating a tool to automate workstation setup in his free time.\r\n\r\nAt Pivotal he works on Spring Cloud.\r\n\r\nHis industry experience has taken him from early e-commerce platforms to government and non-profit organizations to business intelligence startups.  He has extensive java experience and experience in other languages such as scala and python.  His database experience runs from Oracle and MySQL to Riak and Cassandra.\r\n\r\nHis blog is located at http://spencer.gibb.u","firstName":"Spencer","lastName":"Gibb","twitterId":"spencerbgibb","googlePlusId":"","linkedInId":"spencergibb","lanyrdId":"spencergibb","githubId":"spencergibb"}],"title":"Spring Cloud *: Exploring Alternative Spring Cloud Implementations","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":43,"createdDate":null,"updatedDate":null,"version":null,"name":"Microservices","cssStyleName":null,"color":"#2a2d7c","description":null,"trackOrder":70},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":2316,"createdDate":1389136849649,"updatedDate":null,"version":0,"name":"spring"},{"id":4597,"createdDate":1419180919466,"updatedDate":null,"version":0,"name":"microservices"},{"id":2308,"createdDate":1389119813693,"updatedDate":null,"version":0,"name":"cloud"}]},{"id":6659,"createdDate":1448855332821,"updatedDate":1448855755383,"version":2,"audioLink":"","description":"In most cases, it is convenient to have some human interaction with a web (micro-)service, no matter how small it is. A traditional approach would be to create an HTTP interface, where user requests will be dispatched and HTML/CSS pages must be served. This approach is indeed very traditional for a web site, but not really convenient for a web service, which is not intended to be good looking, 24x7 up and running and UX-optimized. Instead, talking to a web service in a chat-bot mode would be much more convenient, both for a user and web service developer. In this session I will try to explain why chat-bot design is more preferable, what are the pros and cons.","presentationLink":"","speakers":[{"id":6658,"createdDate":1448855332789,"updatedDate":1448897766276,"version":1,"bio":"Yegor is a CTO and Co-founder of Teamed.io, a software development company with a unique approach to management of distributed teams; a regular blogger at www.yegor256.com; a proud holder of PMP and OCMEA certifications; a hands-on Java developer and a lead architect of a few popular open source projects, including jcabi.com, takes.org, rultor.com and qulice.com. Yegor lives in Palo Alto, CA and Kyiv, Ukraine.","firstName":"Yegor","lastName":"Bugayenko","twitterId":"yegor256","googlePlusId":"+YegorBugayenko","linkedInId":"yegor.bugayenko","lanyrdId":"","githubId":"yegor256"}],"title":"Talk To Your Microservice Via a Chat Bot, not UI","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":43,"createdDate":null,"updatedDate":null,"version":null,"name":"Microservices","cssStyleName":null,"color":"#2a2d7c","description":null,"trackOrder":70},"presentationTags":[{"id":4597,"createdDate":1419180919466,"updatedDate":null,"version":0,"name":"microservices"}]},{"id":6526,"createdDate":1448219579138,"updatedDate":1448376922876,"version":5,"audioLink":"","description":"Hystrix is an open-source library developed by Netflix to help us build resilient distributed systems.  It provides boundaries that prevent failures in one service from cascading to other services. It is also designed with the knowledge that failures in a distributed system are inevitable, and have to be handled as a first-class citizen through the use of fallbacks.  Used properly, Hystrix will greatly improve the availability of a system that may encounter errors or increased latency in a distributed environment.  \r\n\r\nIn my talk, I will describe the principles of Hystrix and what role it plays in operating the Netflix API.  I will describe a variety of cases where proper Hystrix usage has protected our API, and lessons we learned about how improper usage can lead to customer-affecting outages.","presentationLink":"","speakers":[{"id":6525,"createdDate":1448219579100,"updatedDate":1448905655166,"version":1,"bio":"Matt is an engineer on the Edge Platform team at Netflix, responsible for the availability of the Netflix API.  He is the maintainer of Hystrix, and applies it to a variety of systems at Netflix to help maintain a fault-tolerant system.","firstName":"Matt","lastName":"Jacobs","twitterId":"mattrjacobs","googlePlusId":"","linkedInId":"mattrjacobs","lanyrdId":"","githubId":"mattrjacobs"}],"title":"Using Hystrix to Build Resilient Distributed Systems","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":43,"createdDate":null,"updatedDate":null,"version":null,"name":"Microservices","cssStyleName":null,"color":"#2a2d7c","description":null,"trackOrder":70},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":6606,"createdDate":1448334559567,"updatedDate":null,"version":0,"name":"hystrix"},{"id":5851,"createdDate":1447038744312,"updatedDate":null,"version":0,"name":"distributed systems"},{"id":4597,"createdDate":1419180919466,"updatedDate":null,"version":0,"name":"microservices"},{"id":2247,"createdDate":1389102577671,"updatedDate":null,"version":0,"name":"jvm"}]},{"id":6572,"createdDate":1448225239412,"updatedDate":1448225261732,"version":2,"audioLink":"","description":"Class loaders are at the core of the Java language. Java EE containers, OSGi, NetBeans modules, Tapestry 5, Grails and many others use class loaders heavily. Yet when something goes wrong, would you know how to solve it?\r\n\r\nIn this session we'll take a tour of the Java class loading mechanism, both from JVM and developer point of view. We'll see how different delegation systems are built, how synchronization works, what is the difference between finding classes and resources, what wrong assumptions has been made and are now supported.\r\n\r\nNext we will look at typical problems that you get with class loading and how to solve them. ClassNoDefError, IncompatibleClassChangeError, LinkageError and many others are symptoms of specific things going wrong that you can usually find and fix. For each problem we'll go through a hands on demo with a corresponding solution. \r\n\r\nWe'll also take a look at how and why classloaders leak and how can you remedy that.\r\n","presentationLink":"","speakers":[{"id":6443,"createdDate":1447803945244,"updatedDate":1449067632214,"version":2,"bio":"Simon is a Developer Advocate at ZeroTurnaround, and is all about community discussion and interaction. His passion around technical communities led him to become the founder and organiser of the vJUG (virtualJUG), as well as continuing to be an active leader of the London Java Community (LJC). Simon's energy in building and driving the Java community forward culminated in him becoming a Java Champion in 2014. Previously, Simon worked for IBM for almost 12 years, testing, developing and evangelising WebSphere Application Server. He is an experienced speaker, having presented at JavaOne, DevoxxUK, DevoxxFR, IBM Impact, JDC, JMaghreb and many more (including the vJUG :) ), and is a keen technical writer for RebelLabs. You can catch up with Simon on twitter at @sjmaple","firstName":"Simon","lastName":"Maple","twitterId":"sjmaple","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Do you really get class loaders?","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":37,"createdDate":null,"updatedDate":null,"version":null,"name":"Java","cssStyleName":null,"color":"#faa21b","description":null,"trackOrder":10},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":6571,"createdDate":1448225239402,"updatedDate":null,"version":0,"name":"classloaders"}]},{"id":5891,"createdDate":1447126847597,"updatedDate":1447735432498,"version":6,"audioLink":"","description":"You ever wonder how to start your own Java User Group?  Maybe how to become a Java Champion or JavaOne Rock Star?  Did you ever wonder how you could get published in Java Magazine?  Perhaps you were interested to know how join the JCP and sit on an Expert Group.  In this presentation you will learn all of the insider secrets on how to become a presence in the worldwide community of 9 million Java developers.\r\n\r\nWarning: Community social engagement is highly addictive and can cause one or more of the following symptoms:\r\n\r\n*  Difficulty keeping track of your thousands of \"followers\" and \"friends\"\r\n*  More \"free stuff\" than you can store in your garage\r\n*  Humbling run-ins with language designers, JVM gurus, and framework authors\r\n*  Unsolicited, crazy job offers! [e.g. Snorkeling in the Pacific to test your steering algorithm]\r\n\r\nCome learn how the Java Community ticks from someone who has gone from Java coder to Java Champion and now is a humble Java Community Servant.","presentationLink":"","speakers":[{"id":2172,"createdDate":1388430065577,"updatedDate":1447180951055,"version":6,"bio":"Stephen Chin is the Lead Java Community Manager at Oracle, author of Raspberry Pi with Java, co-author of Pro JavaFX Platform, and JavaOne Content Co-Chair. He has keynoted numerous Java conferences around the world including JavaOne, where he is a 4 time Rock Star Award recipient. Stephen is an avid motorcyclist who has done several Pan-European evangelism tours, interviewing hackers in their natural habitat and posting the videos on http://nighthacking.com/. When he is not traveling, he enjoys teaching kids how to do embedded and robot programming together with his 12 year old daughter.","firstName":"Stephen","lastName":"Chin","twitterId":"steveonjava","googlePlusId":"+steveonjava","linkedInId":"steveonjava","lanyrdId":"steveonjava","githubId":"steveonjava"},{"id":5889,"createdDate":1447126847560,"updatedDate":1450228257013,"version":2,"bio":"Yolande is a Senior Java Community and Marketing Manager for the Oracle Technology Network. She is managing developer content across all Java channels including technical website, the new community platform, @Java, blogs.oracle.com/java, YouTube/Java and the Java Developer Newsletter. She collaborates with developers to create content about Java-related technologies and the Java community. She supports the work of women developers with the Duchess and other organizations. Follow her on Twitter @java.\r\n","firstName":"Yolande","lastName":"Poirier","twitterId":"ypoirier","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Java Community Insider Secrets!","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":37,"createdDate":null,"updatedDate":null,"version":null,"name":"Java","cssStyleName":null,"color":"#faa21b","description":null,"trackOrder":10},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":5890,"createdDate":1447126847589,"updatedDate":null,"version":0,"name":"community"}]},{"id":5930,"createdDate":1447190183308,"updatedDate":null,"version":0,"audioLink":"","description":"We all have heard about lambda expressions in Java 8. The real unsung hero of Java 8 are the Streams.\r\n\r\nIn this presentation we will take an example driven approach to explore streams, their core capabilities form the application development point of view, and how to explore these capabilities for improve performance and efficiency.","presentationLink":"","speakers":[{"id":1009,"createdDate":null,"updatedDate":1448908887888,"version":9,"bio":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats **at** agiledeveloper **dot** com or on twitter at @venkat_s.","firstName":"Venkat","lastName":"Subramaniam","twitterId":"venkat_s","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Programming with Streams in Java 8","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":37,"createdDate":null,"updatedDate":null,"version":null,"name":"Java","cssStyleName":null,"color":"#faa21b","description":null,"trackOrder":10},"presentationTags":[]},{"id":6540,"createdDate":1448221419908,"updatedDate":1448222491433,"version":2,"audioLink":"","description":"Speech recognition has made ground-breaking progress in the last few years, thanks to the growing availability of faster hardware, bigger data, and better algorithms. Today real-time, near human-level speech recognition is available on desktop and mobile devices, and leveraging this technology to build your own speech-enabled applications is easier than ever before. Many open source tools for speech, including state-of-the-art libraries like [CMUSphinx](http://cmusphinx.sourceforge.net/) and [kaldi](http://kaldi.sourceforge.net/) offer powerful APIs for developers to perform live speech recognition. In this talk we will show you how to train a language model and build a custom voice-control interface from scratch using open source tools and real-world data. We will demonstrate a plugin built at JetBrains for controlling your IDE by voice, and give you advice for implementing your own speech applications. No prior experience is necessary.","presentationLink":"","speakers":[{"id":6539,"createdDate":1448221419871,"updatedDate":1448902474088,"version":2,"bio":"Breandan is a developer advocate at JetBrains, where he enjoys building software, writing technical content, speaking at conferences, and learning from some of the world's best software developers.","firstName":"Breandan","lastName":"Considine","twitterId":"breandan","googlePlusId":"+BreandanConsidine","linkedInId":"bconsidine","lanyrdId":"breandan/","githubId":"breandan"}],"title":"Speech Recognition on Java","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":37,"createdDate":null,"updatedDate":null,"version":null,"name":"Java","cssStyleName":null,"color":"#faa21b","description":null,"trackOrder":10},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"}]},{"id":6653,"createdDate":1448770684339,"updatedDate":1449712125477,"version":4,"audioLink":"","description":"Almost every major version of Spring framework introduced a new way to configure the context: XML, Annotations, Java Config, Groovy... What's next, and, more important - why so many?! And how to know what to use and when? In this session Baruch, Viktor and Leonid will try to find the silver bullet, and you will have a chance to vote for the best feature implementations or even make a bet of the winner!","presentationLink":"","speakers":[{"id":1070,"createdDate":null,"updatedDate":1447182830174,"version":5,"bio":"Yakov Fain is Java Champion and a co-founder of IT consultancy Farata Systems, USA. He authored many articles and several books about software development. He's a co-author of the book \"Angular 2 Development with TypeScript\", Manning, 2016.  Yakov's e-book \"Java Programming for Kids\" is available for free download at http://yfain.github.io/Java4Kids/. His Twitter tag is @yfain.","firstName":"Yakov","lastName":"Fain","twitterId":"yfian","googlePlusId":"","linkedInId":"yfain","lanyrdId":"","githubId":"yfain"},{"id":4846,"createdDate":1421234356758,"updatedDate":1448210581662,"version":4,"bio":"Viktor Gamov is a Senior Solution Architect at Hazelcast - a leading open-source in memory data grid(IMDG) company. Viktor joined Hazelcast with comprehensive knowledge and expertise of the enterprise application architectures using open source technologies. He helps companies building distributed systems on the JVM and holds an MS in Computer Science. He is a co-organizer of the Princeton Java Users Group and co-author of the O'Reilly's Enterprise Web Development. Viktor presented at various international conferences (http://lanyrd.com/gamussa) on Java and JavaScript related topics. He tweets at @gamussa.","firstName":"Viktor","lastName":"Gamov","twitterId":"gamussa","googlePlusId":"","linkedInId":"vikgamov","lanyrdId":"gamussa","githubId":"gamussa"},{"id":2236,"createdDate":1389052287494,"updatedDate":1448770684312,"version":6,"bio":"JavaOne Rockstar Baruch Sadogursky (a.k.a JBaruch) is the Developer Advocate of JFrog, the creators of Artifactory Binary Repository, the home of Bintray, JavaOne 2011 and 2013 Duke Choice Awards winner.\r\n\r\nFor a living he hangs out with the JFrog tech leaders, writes some code around Artifactory and Bintray, and then speaks and blogs about all that. He does it repeatedly for the last dozen of years and enjoys every moment of it.\r\n\r\nBaruch is @jbaruch on twitter and mostly blogs on [JFrog](http://www.jfrog.com/blog/) and [Bintray](http://blog.bintray.com) blogs.\r\nHis speaker history on [Lanyrd](http://lanyrd.com/profile/jbaruch/sessions/).\r\n","firstName":"Baruch","lastName":"Sadogursky","twitterId":"jbaruch","googlePlusId":"+BaruchSadogursky","linkedInId":"jbaruch","lanyrdId":"jbaruch","githubId":"jbaruch"}],"title":"Spring Framework: The Ultimate Configurations Faceoff!","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":37,"createdDate":null,"updatedDate":null,"version":null,"name":"Java","cssStyleName":null,"color":"#faa21b","description":null,"trackOrder":10},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":2316,"createdDate":1389136849649,"updatedDate":null,"version":0,"name":"spring"}]},{"id":6570,"createdDate":1448224897847,"updatedDate":1448224912680,"version":2,"audioLink":"","description":"Let's sing a story about ol Timmy. \r\nHe yearned to write more complex code. \r\nAs he venture in the land of the multi-threaded grabs, \r\nHe felled swiftly on despair and traps.\r\n\r\nCome and listen to the Java Rhymester as we take a plunge into proper multi-threading programming. It's a hard topic, but it doesn't have to be! Once you start seeing the code behind threads you'll know that just being aware of how multi-threading really works will make most of your fears go away, and while the path to writing perfect multi-threaded code is long, this is the journey that will take you there!\r\n","presentationLink":"","speakers":[{"id":4476,"createdDate":1418726846150,"updatedDate":1448908246314,"version":5,"bio":"Freddy is a Senior Developer at Expedia. Always dealing with performance and usability he is always curious on how to make the overabundance of data useful for travelers, traders and consumers. Having worked with different technologies before has allowed him to come with solutions to rendering bottleneck problems. A Usability Guru, Freddy understands and bridges the concepts of high-throughput with usability within software.\r\n\r\nHe is also the author and maintainer of the javapubhouse.com, a podcast dedicated to tutorial topics in Java that covers everything from the use of the keyword volatile to the definition of beautiful code, also of javaoffheap.com, a java news podcast and he’s the current community leader for the Chicago Java Users Group.\r\n","firstName":"Freddy","lastName":"Guime","twitterId":"fguime","googlePlusId":"","linkedInId":"fguime","lanyrdId":"","githubId":"windust"}],"title":"The Java Rhymester Presents - A tale of Multiple Threads","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":37,"createdDate":null,"updatedDate":null,"version":null,"name":"Java","cssStyleName":null,"color":"#faa21b","description":null,"trackOrder":10},"presentationTags":[{"id":6569,"createdDate":1448224897836,"updatedDate":null,"version":0,"name":"java/multi-threading"}]},{"id":5931,"createdDate":1447190200104,"updatedDate":1448334630974,"version":1,"audioLink":"","description":"The new facilities in Java 8 is about the change the way we write code. Our code will become \r\nmore expressive and concise. But, exactly how?\r\n\r\nIn this presentation we will take several common Java code examples, discuss the core idea expressed in code, and transform that code to use the facilities in Java 8. Watch and interact as you see Java code go through a weight loss program right in front of your eyes.","presentationLink":"","speakers":[{"id":1009,"createdDate":null,"updatedDate":1448908887888,"version":9,"bio":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats **at** agiledeveloper **dot** com or on twitter at @venkat_s.","firstName":"Venkat","lastName":"Subramaniam","twitterId":"venkat_s","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Transforming to Java 8","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":37,"createdDate":null,"updatedDate":null,"version":null,"name":"Java","cssStyleName":null,"color":"#faa21b","description":null,"trackOrder":10},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"}]},{"id":6561,"createdDate":1448223862100,"updatedDate":1448223885320,"version":2,"audioLink":"","description":"Since the inception of the JAR modularity has been a big reason why developers have chosen Java as a development platform. In Java's 20 year history there have never been so many options to choose from. This talk explores modularity from OSGi, to Docker, to the upcoming Java 9 release with the promise of Project Jigsaw. Attendees will leave this session with a better understanding of the different types of modular architectures available for Java applications and when to use each.","presentationLink":"","speakers":[{"id":6559,"createdDate":1448223862059,"updatedDate":1449240509279,"version":1,"bio":"Bob Paulin is an independent consultant and speaker that has been developing open source software for the past 10 years. He’s presented at large international conferences such as ApacheCon, JavaOne and local user groups such as CJUG (Chicago Java Users Group). Bob is actively involved in the Chicago developer community as the CJUG President and Devoxx4Kids Chicagoland Organizer. As a passionate open source advocate Bob donates his off cycles to Apache Felix project as a committer. During his on cycles Bob helps his clients perform modular development/design, automation for continuous delivery, and build forward leaning web applications. When not coding, Bob enjoys coaching football, robotics, and spending time with his wife and 3 kids.","firstName":"Bob","lastName":"Paulin","twitterId":"bobpaulin","googlePlusId":"","linkedInId":"bobpaulin","lanyrdId":"bob.paulin","githubId":"bobpaulin"}],"title":"What's My Modularity","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":37,"createdDate":null,"updatedDate":null,"version":null,"name":"Java","cssStyleName":null,"color":"#faa21b","description":null,"trackOrder":10},"presentationTags":[{"id":6560,"createdDate":1448223862089,"updatedDate":null,"version":0,"name":"java osgi docker"}]},{"id":7431,"createdDate":1451917097880,"updatedDate":1451917158929,"version":2,"audioLink":"","description":"Hibernate ORM has revved to version 5 recently, along with some of the other projects in the Hibernate suite!  Learn about the changes and how they will affect your project (spoiler: upgrading is easy).  We'll take a look at some new features, consolidation, spatial usage, additional Java 8 support, and a few more depending on time.","presentationLink":"","speakers":[{"id":1302,"createdDate":null,"updatedDate":1451917097813,"version":3,"bio":"Jason is a software engineer currently working in the Java Enterprise Edition Space, Arquillian, Forge, web site and other developer experience projects within Red Hat. His specialties include Wildfly, Seam, CDI, JSF, Java EE, and Gradle. He has worked with PHP, Ruby, Groovy, XSLT, SASS the rest of the web language arena (HTML, CSS, JS, etc). His current position as Senior Software Engineer at Red Hat has him work primarily on the JBoss website, however, he also contributes to JBoss Forge, Arquillian, Apache DeltaSpike, Awestruct, Asciidoctor and others as time allows. He's very interested in the developer experience and helping to improve it at all aspects.\r\n","firstName":"Jason","lastName":"Porter","twitterId":"lightguardjp","googlePlusId":"110049315339873366294","linkedInId":"jasonporter","lanyrdId":"lightguardjp","githubId":"LightGuard"}],"title":"You.areCurrent? Hibernate 5","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":37,"createdDate":null,"updatedDate":null,"version":null,"name":"Java","cssStyleName":null,"color":"#faa21b","description":null,"trackOrder":10},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":2264,"createdDate":1389103820059,"updatedDate":null,"version":0,"name":"jpa"},{"id":2262,"createdDate":1389103659191,"updatedDate":null,"version":0,"name":"hibernate"}]},{"id":6587,"createdDate":1448292653396,"updatedDate":1448292682763,"version":2,"audioLink":"","description":"Kotlin, a language developed by JetBrains for nearly 5 years is very close to its first release. However, did you know that it's being used in production for over a few years now already? Both inside and outside of JetBrains there are people deploying Kotlin applications for Android platform, for Web Applications and just about any other type of application. \r\n\r\nWhy are people using it instead of Java or some of the other languages out there? Primarily because it provides significant benefits in terms of conciseness, readability and safety, without some of the drawbacks that adopting a new language has such as a higher learning curve or interoperability with existing code and ecosystems. See Kotlin not only is interoperable with the Java 100% but even can target JavaScript and allow you to share client and server code while fitting nicely within the ecosystem. \r\n\r\nCome and find out more about this language and what benefits it can provide you. ","presentationLink":"","speakers":[{"id":4483,"createdDate":1418735424502,"updatedDate":1448292653332,"version":4,"bio":"Developer and creator of many things OSS, his passions includes Web Development and Software Architecture. Has authored a couple of books, a few courses and has been speaking at industry events for nearly 15 years. Currently at JetBrains leading the Developer Advocacy team. Spends as much time as he can writing code.","firstName":"Hadi","lastName":"Hariri","twitterId":"hhariri","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":"hhariri"}],"title":"Kotlin - Ready for Production","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":39,"createdDate":null,"updatedDate":null,"version":null,"name":"JVM Languages","cssStyleName":null,"color":"#8b2246","description":null,"trackOrder":30},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":4730,"createdDate":1420306907318,"updatedDate":null,"version":0,"name":"html"},{"id":2241,"createdDate":1389102418425,"updatedDate":null,"version":0,"name":"javascript"}]},{"id":6591,"createdDate":1448294140304,"updatedDate":1448333784542,"version":1,"audioLink":"","description":"Take control of your knowledge portfolio and be in demand! Your command of the top JVM languages; Java 8, Groovy, Scala, JRuby, and Clojure; will set you apart from the rest. This presentation will introduce each of these languages, highlight common ground, and show some stark differences.\r\n\r\nThis presentation will cover:\r\n\r\nHow to install each of the JVM languages\r\nDescribe the “functionality” of each of the languages\r\nExpressiveness vs. Terseness of each language\r\nHow each language handles mutability\r\nHow each language handles concurrency\r\nAmazing tricks of each language\r\nComparison of language typing\r\nComparison and contrast of language performance\r\nEach language's killer app\r\nAnalysis of the language culture and where to get help?\r\nTips on how to start learning and keep learning with a busy schedule","presentationLink":"","speakers":[{"id":1331,"createdDate":null,"updatedDate":1418578125825,"version":3,"bio":"Daniel Hinojosa has been a self-employed developer, teacher and speaker for private business, education, and government since 1999. Daniel also actively teaches programming for the University of New Mexico Continuing Education.\r\n\r\nDaniel is a Pomodoro Technique practitioner and is co-founder of the Albuquerque Java User’s Group in Albuquerque, New Mexico. When he’s not supporting other local Java developers, Daniel spends most of his waking hours developing in and around the Java ecosystem, encompassing multiple languages and frameworks. He is author for the upcoming book ‘Testing in Scala’ and is the latest member of the No Fluff Just Stuff tour.","firstName":"Daniel","lastName":"Hinojosa","twitterId":"dhinojosa","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Learning 5 JVM Languages in the Next 5 Years","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":39,"createdDate":null,"updatedDate":null,"version":null,"name":"JVM Languages","cssStyleName":null,"color":"#8b2246","description":null,"trackOrder":30},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":6601,"createdDate":1448333784522,"updatedDate":null,"version":0,"name":"jruby"},{"id":2414,"createdDate":1389356087728,"updatedDate":null,"version":0,"name":"scala"},{"id":2444,"createdDate":1389391904289,"updatedDate":null,"version":0,"name":"clojure"},{"id":2247,"createdDate":1389102577671,"updatedDate":null,"version":0,"name":"jvm"},{"id":2431,"createdDate":1389366462173,"updatedDate":null,"version":0,"name":"groovy"}]},{"id":6592,"createdDate":1448294437736,"updatedDate":1448333950614,"version":2,"audioLink":"","description":"A set various tools to write reactive, concurrent, fault-tolerant applications and services using immutable data, asynchronous message passing using local and remote actors, software transactional memory, and supervised systems. This entire presentation is done in Java.\r\n\r\nAkka is a set of various tools to write reactive, concurrent, fault-tolerant applications and services using immutable data, asynchronous message passing using local and remote actors, software transactional memory, and supervised systems.\r\n\r\nAkka is also part of the Typesafe stack, a stack that include the Play web framework, Spray, Slick, and the Scala programming language. This Akka presentation will cover Java style usage of Akka with actors, asynchronous message passing, supervision, and streams","presentationLink":"","speakers":[{"id":1331,"createdDate":null,"updatedDate":1418578125825,"version":3,"bio":"Daniel Hinojosa has been a self-employed developer, teacher and speaker for private business, education, and government since 1999. Daniel also actively teaches programming for the University of New Mexico Continuing Education.\r\n\r\nDaniel is a Pomodoro Technique practitioner and is co-founder of the Albuquerque Java User’s Group in Albuquerque, New Mexico. When he’s not supporting other local Java developers, Daniel spends most of his waking hours developing in and around the Java ecosystem, encompassing multiple languages and frameworks. He is author for the upcoming book ‘Testing in Scala’ and is the latest member of the No Fluff Just Stuff tour.","firstName":"Daniel","lastName":"Hinojosa","twitterId":"dhinojosa","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Reactive Systems with Akka and Java","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":39,"createdDate":null,"updatedDate":null,"version":null,"name":"JVM Languages","cssStyleName":null,"color":"#8b2246","description":null,"trackOrder":30},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":2416,"createdDate":1389356360747,"updatedDate":null,"version":0,"name":"akka"},{"id":2414,"createdDate":1389356087728,"updatedDate":null,"version":0,"name":"scala"},{"id":5885,"createdDate":1447122685757,"updatedDate":null,"version":0,"name":"reactive"}]},{"id":6547,"createdDate":1448222412881,"updatedDate":1450109142235,"version":10,"audioLink":"","description":"Have you begun working in Scala, know the basic syntax and able to manage simple applications?  Do you want to learn more about the language and see how to use some of the more interesting features that the language has to offer?  We'll be covering all the topics that will make all your friends jealous.  We'll start with case classes and enhanced pattern matching then dive into implicits, multi-parameter functions, currying and covariance/contravariance.  Finally, if we have time we'll finish up with with streams, macros and continuations, by the end you should be able to take these concepts and impress your friends using these new awesome concepts making your code base even more awesome!","presentationLink":"","speakers":[{"id":3987,"createdDate":1415536471683,"updatedDate":1448222412863,"version":3,"bio":"Joshua F. Backfield is a Senior Software Development Engineer at Dell SecureWorks, Inc., an industry-leading MSSP. He is responsible for the design and development of many internal UI tools as well as multiple backend processes. He has over five years of development experience, three of which have been in production software. He holds a Bachelor of Science in Electronic Systems Technologies from Southern Illinois University at Carbondale and a Masters of Science in Computer Science from DePaul University. He has worked in a variety of languages such as C, C++, Perl, Java, Javascript, and Scala, and constantly continues to learn and grow with more languages. He has ported multiple native C applications to Scala, introduced many coworkers to Scala, and taught them the underlying functional programming concepts.\r\n","firstName":"Josh","lastName":"Backfield","twitterId":"jbackfield","googlePlusId":"","linkedInId":"jbackfield","lanyrdId":"","githubId":"jbackfield"}],"title":"Scala: Things that make you go h(mmm)","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":39,"createdDate":null,"updatedDate":null,"version":null,"name":"JVM Languages","cssStyleName":null,"color":"#8b2246","description":null,"trackOrder":30},"presentationTags":[{"id":2414,"createdDate":1389356087728,"updatedDate":null,"version":0,"name":"scala"}]},{"id":6514,"createdDate":1448047633196,"updatedDate":1448047980298,"version":2,"audioLink":"","description":"Groovy is unusual among programming languages in that it doesn't seek to replace its predecessor. You can freely mix Groovy with Java on a class-by-class, or even line-by-line, basis. If you are working with Java, there's no reason not to make your life easier by adding Groovy where it helps the most.\r\n\r\nGroovy helps Java in many ways, especially when processing XML or JSON data, replacing anonymous inner classes, adding tons of library methods that Java has needed all along, vastly simplified file and database manipulation, and much more. This talk will demonstrate how you can add Groovy to Java applications and simplify your development job immediately.","presentationLink":"","speakers":[{"id":1323,"createdDate":null,"updatedDate":1448047633177,"version":7,"bio":"Ken Kousen is a technical trainer, software developer, and conference speaker specializing in Java and open source topics, including Android, Spring, Hibernate/JPA, Groovy, Grails, and Gradle. He is the author of the O'Reilly book \"Gradle Recipes for Android\" and the Manning book \"Making Java Groovy\". He also has recorded several video courses for O'Reilly, including two on Android, three on Groovy, two on Gradle, and one on the Spring Framework. \r\n\r\nIn 2013 was awarded a JavaOne Rockstar award. His academic background include BS degrees in Mechanical Engineering and Mathematics from M.I.T., an MA and Ph.D. in Aerospace Engineering from Princeton, and an MS in Computer Science from R.P.I. He is currently President of Kousen IT, Inc., based in Connecticut.","firstName":"Ken","lastName":"Kousen","twitterId":"kenkousen","googlePlusId":"+KennethKousen","linkedInId":"kenkousen","lanyrdId":"","githubId":"kousen"}],"title":"Seriously, Use Groovy NOW","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":39,"createdDate":null,"updatedDate":null,"version":null,"name":"JVM Languages","cssStyleName":null,"color":"#8b2246","description":null,"trackOrder":30},"presentationTags":[{"id":2247,"createdDate":1389102577671,"updatedDate":null,"version":0,"name":"jvm"},{"id":2431,"createdDate":1389366462173,"updatedDate":null,"version":0,"name":"groovy"}]},{"id":6594,"createdDate":1448295892707,"updatedDate":1448334121127,"version":1,"audioLink":"","description":"The Spock framework brings simple, elegant testing to Java and Groovy projects. It integrates cleanly with JUnit, so Spock tests can be integrated as part of an existing test suite. Spock also includes an embedded mocking framework that can be used right away.\r\n\r\nIn this presentation, we'll look at several examples of Spock tests and review most of its capabilities, including mock objects and integration with Spring.","presentationLink":"","speakers":[{"id":1323,"createdDate":null,"updatedDate":1448047633177,"version":7,"bio":"Ken Kousen is a technical trainer, software developer, and conference speaker specializing in Java and open source topics, including Android, Spring, Hibernate/JPA, Groovy, Grails, and Gradle. He is the author of the O'Reilly book \"Gradle Recipes for Android\" and the Manning book \"Making Java Groovy\". He also has recorded several video courses for O'Reilly, including two on Android, three on Groovy, two on Gradle, and one on the Spring Framework. \r\n\r\nIn 2013 was awarded a JavaOne Rockstar award. His academic background include BS degrees in Mechanical Engineering and Mathematics from M.I.T., an MA and Ph.D. in Aerospace Engineering from Princeton, and an MS in Computer Science from R.P.I. He is currently President of Kousen IT, Inc., based in Connecticut.","firstName":"Ken","lastName":"Kousen","twitterId":"kenkousen","googlePlusId":"+KennethKousen","linkedInId":"kenkousen","lanyrdId":"","githubId":"kousen"}],"title":"Spock: Logical Testing for Enterprise Applications","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":39,"createdDate":null,"updatedDate":null,"version":null,"name":"JVM Languages","cssStyleName":null,"color":"#8b2246","description":null,"trackOrder":30},"presentationTags":[{"id":2240,"createdDate":1389102418415,"updatedDate":null,"version":0,"name":"java"},{"id":2430,"createdDate":1389366462172,"updatedDate":null,"version":0,"name":"spock"},{"id":2431,"createdDate":1389366462173,"updatedDate":null,"version":0,"name":"groovy"},{"id":2340,"createdDate":1389197892371,"updatedDate":null,"version":0,"name":"testing"},{"id":2432,"createdDate":1389366462174,"updatedDate":null,"version":0,"name":"junit"}]},{"id":6444,"createdDate":1447803945275,"updatedDate":1447807392703,"version":2,"audioLink":"","description":"There are more than 50 actively worked JVM languages in existence today. Some have been ported to the JVM, whereas others were written specifically for the JVM. This hands-on session takes an introductory (but non-Hello, World) look at several JVM languages, including Java 8, Scala, Groovy, Kotlin, Ceylon and Xtend. It covers ZeroTurnaround’s initial experiences, including what rocked and sucked in learning each one. You don’t need any prior knowledge of these languages to attend the session. You will learn whether they are for you and will hear about some real-life experiences of trying these languages for the first time.","presentationLink":"","speakers":[{"id":6443,"createdDate":1447803945244,"updatedDate":1449067632214,"version":2,"bio":"Simon is a Developer Advocate at ZeroTurnaround, and is all about community discussion and interaction. His passion around technical communities led him to become the founder and organiser of the vJUG (virtualJUG), as well as continuing to be an active leader of the London Java Community (LJC). Simon's energy in building and driving the Java community forward culminated in him becoming a Java Champion in 2014. Previously, Simon worked for IBM for almost 12 years, testing, developing and evangelising WebSphere Application Server. He is an experienced speaker, having presented at JavaOne, DevoxxUK, DevoxxFR, IBM Impact, JDC, JMaghreb and many more (including the vJUG :) ), and is a keen technical writer for RebelLabs. You can catch up with Simon on twitter at @sjmaple","firstName":"Simon","lastName":"Maple","twitterId":"sjmaple","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"The Adventurous developers guide to JVM langs","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":39,"createdDate":null,"updatedDate":null,"version":null,"name":"JVM Languages","cssStyleName":null,"color":"#8b2246","description":null,"trackOrder":30},"presentationTags":[{"id":4503,"createdDate":1418861556630,"updatedDate":null,"version":0,"name":"jvm languages"}]},{"id":6636,"createdDate":1448681852751,"updatedDate":1448681950336,"version":2,"audioLink":"","description":"More strange, more bizarre, more fun! The Groovy Puzzlers hits with its second season in which we implemented the lesson learned from the first one - do more of the same (always as a duet)! Expect even more “NO WAY!”, “WHOA!”, “WTF!”, O_o and prizes flying around, and expect to learn more about Groovy’s darkest secrets! As usual, the traps we fell into here in JFrog and contributions from top-notch Groovy authors and users!","presentationLink":"","speakers":[{"id":4846,"createdDate":1421234356758,"updatedDate":1448210581662,"version":4,"bio":"Viktor Gamov is a Senior Solution Architect at Hazelcast - a leading open-source in memory data grid(IMDG) company. Viktor joined Hazelcast with comprehensive knowledge and expertise of the enterprise application architectures using open source technologies. He helps companies building distributed systems on the JVM and holds an MS in Computer Science. He is a co-organizer of the Princeton Java Users Group and co-author of the O'Reilly's Enterprise Web Development. Viktor presented at various international conferences (http://lanyrd.com/gamussa) on Java and JavaScript related topics. He tweets at @gamussa.","firstName":"Viktor","lastName":"Gamov","twitterId":"gamussa","googlePlusId":"","linkedInId":"vikgamov","lanyrdId":"gamussa","githubId":"gamussa"},{"id":2236,"createdDate":1389052287494,"updatedDate":1448770684312,"version":6,"bio":"JavaOne Rockstar Baruch Sadogursky (a.k.a JBaruch) is the Developer Advocate of JFrog, the creators of Artifactory Binary Repository, the home of Bintray, JavaOne 2011 and 2013 Duke Choice Awards winner.\r\n\r\nFor a living he hangs out with the JFrog tech leaders, writes some code around Artifactory and Bintray, and then speaks and blogs about all that. He does it repeatedly for the last dozen of years and enjoys every moment of it.\r\n\r\nBaruch is @jbaruch on twitter and mostly blogs on [JFrog](http://www.jfrog.com/blog/) and [Bintray](http://blog.bintray.com) blogs.\r\nHis speaker history on [Lanyrd](http://lanyrd.com/profile/jbaruch/sessions/).\r\n","firstName":"Baruch","lastName":"Sadogursky","twitterId":"jbaruch","googlePlusId":"+BaruchSadogursky","linkedInId":"jbaruch","lanyrdId":"jbaruch","githubId":"jbaruch"}],"title":"The Epic Groovy Puzzlers S02: The revenge of the parentheses","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":39,"createdDate":null,"updatedDate":null,"version":null,"name":"JVM Languages","cssStyleName":null,"color":"#8b2246","description":null,"trackOrder":30},"presentationTags":[{"id":2247,"createdDate":1389102577671,"updatedDate":null,"version":0,"name":"jvm"},{"id":2431,"createdDate":1389366462173,"updatedDate":null,"version":0,"name":"groovy"}]},{"id":5906,"createdDate":1447170208801,"updatedDate":1448334283605,"version":5,"audioLink":"","description":"In a field of continually recycled ideas, the old paradigm of functional programming is gaining popularity among software developers.  In this presentation we will review some of the catalytic trends that have reshaped the challenges of software development.  We then will discuss how functional programming is a fundamentally simpler paradigm well-suited for modern software development.  Managers and developers alike will leave understanding how and why to embrace functional programming to improve their software projects.","presentationLink":"","speakers":[{"id":5905,"createdDate":1447170208773,"updatedDate":1447174406267,"version":1,"bio":"Joe Barnes is currently a Senior Software Architect at Mentor Graphics where he leads development of cloud-based web solutions such as PartQuest.com. He has spent most of the last decade developing applications on the JVM, with Scala taking focus in recent years. His contributions to the development community come through open source development, blogging, and speaking.","firstName":"Joe","lastName":"Barnes","twitterId":"joescii","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":"joescii"}],"title":"The Renaissance of Functional Programming","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":39,"createdDate":null,"updatedDate":null,"version":null,"name":"JVM Languages","cssStyleName":null,"color":"#8b2246","description":null,"trackOrder":30},"presentationTags":[{"id":2412,"createdDate":1389356087727,"updatedDate":null,"version":0,"name":"functional programming"},{"id":2247,"createdDate":1389102577671,"updatedDate":null,"version":0,"name":"jvm"}]},{"id":5883,"createdDate":1447120780947,"updatedDate":1447801786325,"version":4,"audioLink":"","description":"Microservice architectures are quite popular, described as \"SOA done correctly\". But what are the real differences between Service *Oriented*, Service *Based*, and *Micro*service architectural styles? And what about middle ground between the *shared everything* of SOA versus *shared nothing* of microservices? This talk explores the similarities and differences between various service-oriented architectural styles. I describe the characteristics of SOA, microservices, and hybrid service-based architectures, along with decision criteria to choose between them. I also discuss specific engineering practices, orchestration styles, reuse strategies, and migrating between architectural styles (e.g., from monolithic applications to service-based or microservice). No one architecture can solve every problem, and many projects take on more complexity than necessary by choosing the wrong paradigm. This talk equips attendees with the knowledge and context to choose the architecture that best fits their needs.","presentationLink":"","speakers":[{"id":1006,"createdDate":null,"updatedDate":1448909234679,"version":10,"bio":"Neal has a degree in Computer Science from Georgia State University specializing in languages and compilers and a minor in mathematics specializing in statistical analysis. He is also the designer and developer of applications, instructional materials, magazine articles, and video presentations. He is also the author of 6 books, including the most recent [Presentation Patterns](http://presentationpatterns.com) and [Functional Thinking](http://nealford.com/books/functionalthinking.html). Given his degree, Neal is a bit of a language geek, with affections including but not limited to Ruby, Clo*j*ure, Java, Groovy, JavaScript, Scala and C#/.NET. His primary consulting focus is the design and construction of large-scale enterprise applications. Neal is an internationally acclaimed speaker, having spoken at over 300 developer conferences worldwide, delivering more than 2000 presentations. If you have an insatiable curiosity about Neal, visit his web site at [nealford.com](http://nealford.com). He welcomes feedback and can be reached at `nford at thoughtworks dot com`.","firstName":"Neal","lastName":"Ford","twitterId":"neal4d","googlePlusId":"neal.ford","linkedInId":"","lanyrdId":"","githubId":"neal.ford"}],"title":"Comparing Service Based Architectures","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":50,"createdDate":null,"updatedDate":null,"version":null,"name":"Architecture","cssStyleName":null,"color":"#015351","description":null,"trackOrder":76},"presentationTags":[{"id":2293,"createdDate":1389113591143,"updatedDate":null,"version":0,"name":"architecture"},{"id":4597,"createdDate":1419180919466,"updatedDate":null,"version":0,"name":"microservices"},{"id":4598,"createdDate":1419180919467,"updatedDate":null,"version":0,"name":"soa"}]},{"id":6597,"createdDate":1448296755880,"updatedDate":1448333578570,"version":1,"audioLink":"","description":"This multi-disciplinary session takes a deep dive into \r\nthe confluence of topics required to fully understand the intersection \r\nof Continuous Delivery and architecture, including evolutionary \r\narchitecture and emergent design, with an emphasis on how \r\narchitectural decisions affect the ease in changing and evolving your \r\ncode, the role of metrics to understand code, how Domain Driven \r\nDesign's Bounded Context reifies in architecture, how to reduce \r\nintra-component/service coupling, and other techniques.\r\n\r\nContinuous Delivery is a process for automating the production \r\nreadiness of your application every time a change occurs – to code, \r\ninfrastructure, or configuration. In the Continuous Delivery world, \r\nrather than hone skills at predicting the future via Big Design Up \r\nFront, Continuous Delivery emphasizes techniques for understanding \r\nand changing code with less cost during the process. Some architectures \r\nand engineering practices yield better designs for this \r\nenvironment. This multi-disciplinary session takes a deep dive into \r\nthe confluence of topics required to fully understand the intersection \r\nof Continuous Delivery and architecture, including evolutionary \r\narchitecture and emergent design, with an emphasis on how \r\narchitectural decisions affect the ease in changing and evolving your \r\ncode, the role of metrics to understand code, how Domain Driven \r\nDesign's Bounded Context reifies in architecture, how to reduce \r\nintra-component/service coupling, and other techniques.","presentationLink":"","speakers":[{"id":1006,"createdDate":null,"updatedDate":1448909234679,"version":10,"bio":"Neal has a degree in Computer Science from Georgia State University specializing in languages and compilers and a minor in mathematics specializing in statistical analysis. He is also the designer and developer of applications, instructional materials, magazine articles, and video presentations. He is also the author of 6 books, including the most recent [Presentation Patterns](http://presentationpatterns.com) and [Functional Thinking](http://nealford.com/books/functionalthinking.html). Given his degree, Neal is a bit of a language geek, with affections including but not limited to Ruby, Clo*j*ure, Java, Groovy, JavaScript, Scala and C#/.NET. His primary consulting focus is the design and construction of large-scale enterprise applications. Neal is an internationally acclaimed speaker, having spoken at over 300 developer conferences worldwide, delivering more than 2000 presentations. If you have an insatiable curiosity about Neal, visit his web site at [nealford.com](http://nealford.com). He welcomes feedback and can be reached at `nford at thoughtworks dot com`.","firstName":"Neal","lastName":"Ford","twitterId":"neal4d","googlePlusId":"neal.ford","linkedInId":"","lanyrdId":"","githubId":"neal.ford"}],"title":"Continuous Delivery for Architects","presentationType":"BREAKOUT","skillLevel":"INTERMEDIATE","track":{"id":50,"createdDate":null,"updatedDate":null,"version":null,"name":"Architecture","cssStyleName":null,"color":"#015351","description":null,"trackOrder":76},"presentationTags":[{"id":2293,"createdDate":1389113591143,"updatedDate":null,"version":0,"name":"architecture"},{"id":4135,"createdDate":1417192185614,"updatedDate":null,"version":0,"name":"continuous delivery"}]},{"id":5929,"createdDate":1447190128056,"updatedDate":1448333657677,"version":3,"audioLink":"","description":"Organizations have moved from making their employees available to having their applications available directly to the users. This changes the magnitude of scale \r\nof interactions the applications have to support. Furthermore, with devices and bots accessing the systems, we’re looking at a complete different rate of response than we once had to aim for.\r\n\r\nIn this presentation we will discuss the fundamentals of reactive systems, the key design goals, and the technologies that facilitate building such systems.","presentationLink":"","speakers":[{"id":1009,"createdDate":null,"updatedDate":1448908887888,"version":9,"bio":"Dr. Venkat Subramaniam is an award-winning author, founder of Agile Developer, Inc., and an instructional professor at the University of Houston.\r\n\r\nHe has trained and mentored thousands of software developers in the US, Canada, Europe, and Asia, and is a regularly-invited speaker at several international conferences. Venkat helps his clients effectively apply and succeed with agile practices on their software projects.\r\n\r\nVenkat is a (co)author of multiple books, including the 2007 Jolt Productivity award winning book Practices of an Agile Developer. His latest book is Functional Programming in Java: Harnessing the Power of Java 8 Lambda Expressions. You can reach him by email at venkats **at** agiledeveloper **dot** com or on twitter at @venkat_s.","firstName":"Venkat","lastName":"Subramaniam","twitterId":"venkat_s","googlePlusId":"","linkedInId":"","lanyrdId":"","githubId":""}],"title":"Designing Reactive Systems: Creating Highly Responsive and Resilient Applications","presentationType":"BREAKOUT","skillLevel":"BEGINNER","track":{"id":50,"createdDate":null,"updatedDate":null,"version":null,"name":"Architecture","cssStyleName":null,"color":"#015351","description":null,"trackOrder":76},"presentationTags":[{"id":2293,"createdDate":1389113591143,"updatedDate":null,"version":0,"name":"architecture"},{"id":5885,"createdDate":1447122685757,"updatedDate":null,"version":0,"name":"reactive"}]},{"id":6595,"createdDate":1448296479476,"updatedDate":1448333974014,"version":2,"audioLink":"","description":"For many years,